var citylist =[

    {
        "id": 0,
        "name": "北京",
        "aid": "110000",
        "sub": [

            {
                "id": 0,
                "name": "北京市",
                "aid": "110100",
                "sub": [

                    {
                        "id": 0,
                        "name": "东城区",
                        "aid": "110101"
                    },

                    {
                        "id": 1,
                        "name": "西城区",
                        "aid": "110102"
                    },

                    {
                        "id": 2,
                        "name": "朝阳区",
                        "aid": "110105"
                    },

                    {
                        "id": 3,
                        "name": "丰台区",
                        "aid": "110106"
                    },

                    {
                        "id": 4,
                        "name": "石景山区",
                        "aid": "110107"
                    },

                    {
                        "id": 5,
                        "name": "海淀区",
                        "aid": "110108"
                    },

                    {
                        "id": 6,
                        "name": "门头沟区",
                        "aid": "110109"
                    },

                    {
                        "id": 7,
                        "name": "房山区",
                        "aid": "110111"
                    },

                    {
                        "id": 8,
                        "name": "通州区",
                        "aid": "110112"
                    },

                    {
                        "id": 9,
                        "name": "顺义区",
                        "aid": "110113"
                    },

                    {
                        "id": 10,
                        "name": "昌平区",
                        "aid": "110114"
                    },

                    {
                        "id": 11,
                        "name": "大兴区",
                        "aid": "110115"
                    },

                    {
                        "id": 12,
                        "name": "怀柔区",
                        "aid": "110116"
                    },

                    {
                        "id": 13,
                        "name": "平谷区",
                        "aid": "110117"
                    },

                    {
                        "id": 14,
                        "name": "密云区",
                        "aid": "110118"
                    },

                    {
                        "id": 15,
                        "name": "延庆区",
                        "aid": "110119"
                    },

                    {
                        "id": 16,
                        "name": "中关村科技园区",
                        "aid": "110120"
                    },

                ]
            },

        ]
    },

    {
        "id": 1,
        "name": "天津",
        "aid": "120000",
        "sub": [

            {
                "id": 0,
                "name": "天津市",
                "aid": "120100",
                "sub": [

                    {
                        "id": 0,
                        "name": "和平区",
                        "aid": "120101"
                    },

                    {
                        "id": 1,
                        "name": "河东区",
                        "aid": "120102"
                    },

                    {
                        "id": 2,
                        "name": "河西区",
                        "aid": "120103"
                    },

                    {
                        "id": 3,
                        "name": "南开区",
                        "aid": "120104"
                    },

                    {
                        "id": 4,
                        "name": "河北区",
                        "aid": "120105"
                    },

                    {
                        "id": 5,
                        "name": "红桥区",
                        "aid": "120106"
                    },

                    {
                        "id": 6,
                        "name": "东丽区",
                        "aid": "120110"
                    },

                    {
                        "id": 7,
                        "name": "西青区",
                        "aid": "120111"
                    },

                    {
                        "id": 8,
                        "name": "津南区",
                        "aid": "120112"
                    },

                    {
                        "id": 9,
                        "name": "北辰区",
                        "aid": "120113"
                    },

                    {
                        "id": 10,
                        "name": "武清区",
                        "aid": "120114"
                    },

                    {
                        "id": 11,
                        "name": "宝坻区",
                        "aid": "120115"
                    },

                    {
                        "id": 12,
                        "name": "滨海新区",
                        "aid": "120116"
                    },

                    {
                        "id": 13,
                        "name": "宁河区",
                        "aid": "120117"
                    },

                    {
                        "id": 14,
                        "name": "静海区",
                        "aid": "120118"
                    },

                    {
                        "id": 15,
                        "name": "蓟州区",
                        "aid": "120119"
                    },

                    {
                        "id": 16,
                        "name": "滨海高新区",
                        "aid": "120120"
                    },

                ]
            },

        ]
    },

    {
        "id": 2,
        "name": "河北省",
        "aid": "130000",
        "sub": [

            {
                "id": 0,
                "name": "石家庄市",
                "aid": "130100",
                "sub": [

                    {
                        "id": 0,
                        "name": "长安区",
                        "aid": "130102"
                    },

                    {
                        "id": 1,
                        "name": "桥西区",
                        "aid": "130104"
                    },

                    {
                        "id": 2,
                        "name": "新华区",
                        "aid": "130105"
                    },

                    {
                        "id": 3,
                        "name": "井陉矿区",
                        "aid": "130107"
                    },

                    {
                        "id": 4,
                        "name": "裕华区",
                        "aid": "130108"
                    },

                    {
                        "id": 5,
                        "name": "藁城区",
                        "aid": "130109"
                    },

                    {
                        "id": 6,
                        "name": "鹿泉区",
                        "aid": "130110"
                    },

                    {
                        "id": 7,
                        "name": "栾城区",
                        "aid": "130111"
                    },

                    {
                        "id": 8,
                        "name": "井陉县",
                        "aid": "130121"
                    },

                    {
                        "id": 9,
                        "name": "正定新区",
                        "aid": "130123"
                    },

                    {
                        "id": 10,
                        "name": "行唐县",
                        "aid": "130125"
                    },

                    {
                        "id": 11,
                        "name": "灵寿县",
                        "aid": "130126"
                    },

                    {
                        "id": 12,
                        "name": "高邑县",
                        "aid": "130127"
                    },

                    {
                        "id": 13,
                        "name": "深泽县",
                        "aid": "130128"
                    },

                    {
                        "id": 14,
                        "name": "赞皇县",
                        "aid": "130129"
                    },

                    {
                        "id": 15,
                        "name": "无极县",
                        "aid": "130130"
                    },

                    {
                        "id": 16,
                        "name": "平山县",
                        "aid": "130131"
                    },

                    {
                        "id": 17,
                        "name": "元氏县",
                        "aid": "130132"
                    },

                    {
                        "id": 18,
                        "name": "赵县",
                        "aid": "130133"
                    },

                    {
                        "id": 19,
                        "name": "辛集市",
                        "aid": "130181"
                    },

                    {
                        "id": 20,
                        "name": "晋州市",
                        "aid": "130183"
                    },

                    {
                        "id": 21,
                        "name": "新乐市",
                        "aid": "130184"
                    },

                    {
                        "id": 22,
                        "name": "高新区",
                        "aid": "130185"
                    },

                    {
                        "id": 23,
                        "name": "经济技术开发区",
                        "aid": "130186"
                    },

                ]
            },

            {
                "id": 1,
                "name": "唐山市",
                "aid": "130200",
                "sub": [

                    {
                        "id": 0,
                        "name": "路南区",
                        "aid": "130202"
                    },

                    {
                        "id": 1,
                        "name": "路北区",
                        "aid": "130203"
                    },

                    {
                        "id": 2,
                        "name": "古冶区",
                        "aid": "130204"
                    },

                    {
                        "id": 3,
                        "name": "开平区",
                        "aid": "130205"
                    },

                    {
                        "id": 4,
                        "name": "丰南区",
                        "aid": "130207"
                    },

                    {
                        "id": 5,
                        "name": "丰润区",
                        "aid": "130208"
                    },

                    {
                        "id": 6,
                        "name": "曹妃甸区",
                        "aid": "130209"
                    },

                    {
                        "id": 7,
                        "name": "滦县",
                        "aid": "130223"
                    },

                    {
                        "id": 8,
                        "name": "滦南县",
                        "aid": "130224"
                    },

                    {
                        "id": 9,
                        "name": "乐亭县",
                        "aid": "130225"
                    },

                    {
                        "id": 10,
                        "name": "迁西县",
                        "aid": "130227"
                    },

                    {
                        "id": 11,
                        "name": "玉田县",
                        "aid": "130229"
                    },

                    {
                        "id": 12,
                        "name": "遵化市",
                        "aid": "130281"
                    },

                    {
                        "id": 13,
                        "name": "迁安市",
                        "aid": "130283"
                    },

                ]
            },

            {
                "id": 2,
                "name": "秦皇岛市",
                "aid": "130300",
                "sub": [

                    {
                        "id": 0,
                        "name": "海港区",
                        "aid": "130302"
                    },

                    {
                        "id": 1,
                        "name": "山海关区",
                        "aid": "130303"
                    },

                    {
                        "id": 2,
                        "name": "北戴河区",
                        "aid": "130304"
                    },

                    {
                        "id": 3,
                        "name": "抚宁区",
                        "aid": "130306"
                    },

                    {
                        "id": 4,
                        "name": "青龙满族自治县",
                        "aid": "130321"
                    },

                    {
                        "id": 5,
                        "name": "昌黎县",
                        "aid": "130322"
                    },

                    {
                        "id": 6,
                        "name": "卢龙县",
                        "aid": "130324"
                    },

                    {
                        "id": 7,
                        "name": "北戴河新区",
                        "aid": "130325"
                    },

                ]
            },

            {
                "id": 3,
                "name": "邯郸市",
                "aid": "130400",
                "sub": [

                    {
                        "id": 0,
                        "name": "邯山区",
                        "aid": "130402"
                    },

                    {
                        "id": 1,
                        "name": "丛台区",
                        "aid": "130403"
                    },

                    {
                        "id": 2,
                        "name": "复兴区",
                        "aid": "130404"
                    },

                    {
                        "id": 3,
                        "name": "峰峰矿区",
                        "aid": "130406"
                    },

                    {
                        "id": 4,
                        "name": "肥乡区",
                        "aid": "130407"
                    },

                    {
                        "id": 5,
                        "name": "永年区",
                        "aid": "130408"
                    },

                    {
                        "id": 6,
                        "name": "临漳县",
                        "aid": "130423"
                    },

                    {
                        "id": 7,
                        "name": "成安县",
                        "aid": "130424"
                    },

                    {
                        "id": 8,
                        "name": "大名县",
                        "aid": "130425"
                    },

                    {
                        "id": 9,
                        "name": "涉县",
                        "aid": "130426"
                    },

                    {
                        "id": 10,
                        "name": "磁县",
                        "aid": "130427"
                    },

                    {
                        "id": 11,
                        "name": "邱县",
                        "aid": "130430"
                    },

                    {
                        "id": 12,
                        "name": "鸡泽县",
                        "aid": "130431"
                    },

                    {
                        "id": 13,
                        "name": "广平县",
                        "aid": "130432"
                    },

                    {
                        "id": 14,
                        "name": "馆陶县",
                        "aid": "130433"
                    },

                    {
                        "id": 15,
                        "name": "魏县",
                        "aid": "130434"
                    },

                    {
                        "id": 16,
                        "name": "曲周县",
                        "aid": "130435"
                    },

                    {
                        "id": 17,
                        "name": "武安市",
                        "aid": "130481"
                    },

                    {
                        "id": 18,
                        "name": "高新技术产业开发区",
                        "aid": "130482"
                    },

                ]
            },

            {
                "id": 4,
                "name": "邢台市",
                "aid": "130500",
                "sub": [

                    {
                        "id": 0,
                        "name": "桥东区",
                        "aid": "130502"
                    },

                    {
                        "id": 1,
                        "name": "桥西区",
                        "aid": "130503"
                    },

                    {
                        "id": 2,
                        "name": "邢台县",
                        "aid": "130521"
                    },

                    {
                        "id": 3,
                        "name": "临城县",
                        "aid": "130522"
                    },

                    {
                        "id": 4,
                        "name": "内丘县",
                        "aid": "130523"
                    },

                    {
                        "id": 5,
                        "name": "柏乡县",
                        "aid": "130524"
                    },

                    {
                        "id": 6,
                        "name": "隆尧县",
                        "aid": "130525"
                    },

                    {
                        "id": 7,
                        "name": "任县",
                        "aid": "130526"
                    },

                    {
                        "id": 8,
                        "name": "南和县",
                        "aid": "130527"
                    },

                    {
                        "id": 9,
                        "name": "宁晋县",
                        "aid": "130528"
                    },

                    {
                        "id": 10,
                        "name": "巨鹿县",
                        "aid": "130529"
                    },

                    {
                        "id": 11,
                        "name": "新河县",
                        "aid": "130530"
                    },

                    {
                        "id": 12,
                        "name": "广宗县",
                        "aid": "130531"
                    },

                    {
                        "id": 13,
                        "name": "平乡县",
                        "aid": "130532"
                    },

                    {
                        "id": 14,
                        "name": "威县",
                        "aid": "130533"
                    },

                    {
                        "id": 15,
                        "name": "清河县",
                        "aid": "130534"
                    },

                    {
                        "id": 16,
                        "name": "临西县",
                        "aid": "130535"
                    },

                    {
                        "id": 17,
                        "name": "南宫市",
                        "aid": "130581"
                    },

                    {
                        "id": 18,
                        "name": "沙河市",
                        "aid": "130582"
                    },

                ]
            },

            {
                "id": 5,
                "name": "保定市",
                "aid": "130600",
                "sub": [

                    {
                        "id": 0,
                        "name": "竞秀区",
                        "aid": "130602"
                    },

                    {
                        "id": 1,
                        "name": "莲池区",
                        "aid": "130606"
                    },

                    {
                        "id": 2,
                        "name": "满城区",
                        "aid": "130607"
                    },

                    {
                        "id": 3,
                        "name": "清苑区",
                        "aid": "130608"
                    },

                    {
                        "id": 4,
                        "name": "徐水区",
                        "aid": "130609"
                    },

                    {
                        "id": 5,
                        "name": "涞水县",
                        "aid": "130623"
                    },

                    {
                        "id": 6,
                        "name": "阜平县",
                        "aid": "130624"
                    },

                    {
                        "id": 7,
                        "name": "定兴县",
                        "aid": "130626"
                    },

                    {
                        "id": 8,
                        "name": "唐县",
                        "aid": "130627"
                    },

                    {
                        "id": 9,
                        "name": "高阳县",
                        "aid": "130628"
                    },

                    {
                        "id": 10,
                        "name": "容城县",
                        "aid": "130629"
                    },

                    {
                        "id": 11,
                        "name": "涞源县",
                        "aid": "130630"
                    },

                    {
                        "id": 12,
                        "name": "望都县",
                        "aid": "130631"
                    },

                    {
                        "id": 13,
                        "name": "安新县",
                        "aid": "130632"
                    },

                    {
                        "id": 14,
                        "name": "易县",
                        "aid": "130633"
                    },

                    {
                        "id": 15,
                        "name": "曲阳县",
                        "aid": "130634"
                    },

                    {
                        "id": 16,
                        "name": "蠡县",
                        "aid": "130635"
                    },

                    {
                        "id": 17,
                        "name": "顺平县",
                        "aid": "130636"
                    },

                    {
                        "id": 18,
                        "name": "博野县",
                        "aid": "130637"
                    },

                    {
                        "id": 19,
                        "name": "雄县",
                        "aid": "130638"
                    },

                    {
                        "id": 20,
                        "name": "涿州市",
                        "aid": "130681"
                    },

                    {
                        "id": 21,
                        "name": "定州市",
                        "aid": "130682"
                    },

                    {
                        "id": 22,
                        "name": "安国市",
                        "aid": "130683"
                    },

                    {
                        "id": 23,
                        "name": "高碑店市",
                        "aid": "130684"
                    },

                    {
                        "id": 24,
                        "name": "雄安新区",
                        "aid": "130685"
                    },

                    {
                        "id": 25,
                        "name": "高新区",
                        "aid": "130686"
                    },

                ]
            },

            {
                "id": 6,
                "name": "张家口市",
                "aid": "130700",
                "sub": [

                    {
                        "id": 0,
                        "name": "桥东区",
                        "aid": "130702"
                    },

                    {
                        "id": 1,
                        "name": "桥西区",
                        "aid": "130703"
                    },

                    {
                        "id": 2,
                        "name": "宣化区",
                        "aid": "130705"
                    },

                    {
                        "id": 3,
                        "name": "下花园区",
                        "aid": "130706"
                    },

                    {
                        "id": 4,
                        "name": "万全区",
                        "aid": "130708"
                    },

                    {
                        "id": 5,
                        "name": "崇礼区",
                        "aid": "130709"
                    },

                    {
                        "id": 6,
                        "name": "张北县",
                        "aid": "130722"
                    },

                    {
                        "id": 7,
                        "name": "康保县",
                        "aid": "130723"
                    },

                    {
                        "id": 8,
                        "name": "沽源县",
                        "aid": "130724"
                    },

                    {
                        "id": 9,
                        "name": "尚义县",
                        "aid": "130725"
                    },

                    {
                        "id": 10,
                        "name": "蔚县",
                        "aid": "130726"
                    },

                    {
                        "id": 11,
                        "name": "阳原县",
                        "aid": "130727"
                    },

                    {
                        "id": 12,
                        "name": "怀安县",
                        "aid": "130728"
                    },

                    {
                        "id": 13,
                        "name": "怀来县",
                        "aid": "130730"
                    },

                    {
                        "id": 14,
                        "name": "涿鹿县",
                        "aid": "130731"
                    },

                    {
                        "id": 15,
                        "name": "赤城县",
                        "aid": "130732"
                    },

                ]
            },

            {
                "id": 7,
                "name": "承德市",
                "aid": "130800",
                "sub": [

                    {
                        "id": 0,
                        "name": "双桥区",
                        "aid": "130802"
                    },

                    {
                        "id": 1,
                        "name": "双滦区",
                        "aid": "130803"
                    },

                    {
                        "id": 2,
                        "name": "鹰手营子矿区",
                        "aid": "130804"
                    },

                    {
                        "id": 3,
                        "name": "承德县",
                        "aid": "130821"
                    },

                    {
                        "id": 4,
                        "name": "兴隆县",
                        "aid": "130822"
                    },

                    {
                        "id": 5,
                        "name": "滦平县",
                        "aid": "130824"
                    },

                    {
                        "id": 6,
                        "name": "隆化县",
                        "aid": "130825"
                    },

                    {
                        "id": 7,
                        "name": "丰宁满族自治县",
                        "aid": "130826"
                    },

                    {
                        "id": 8,
                        "name": "宽城满族自治县",
                        "aid": "130827"
                    },

                    {
                        "id": 9,
                        "name": "围场满族蒙古族自治县",
                        "aid": "130828"
                    },

                    {
                        "id": 10,
                        "name": "平泉市",
                        "aid": "130881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "沧州市",
                "aid": "130900",
                "sub": [

                    {
                        "id": 0,
                        "name": "新华区",
                        "aid": "130902"
                    },

                    {
                        "id": 1,
                        "name": "运河区",
                        "aid": "130903"
                    },

                    {
                        "id": 2,
                        "name": "沧县",
                        "aid": "130921"
                    },

                    {
                        "id": 3,
                        "name": "青县",
                        "aid": "130922"
                    },

                    {
                        "id": 4,
                        "name": "东光县",
                        "aid": "130923"
                    },

                    {
                        "id": 5,
                        "name": "海兴县",
                        "aid": "130924"
                    },

                    {
                        "id": 6,
                        "name": "盐山县",
                        "aid": "130925"
                    },

                    {
                        "id": 7,
                        "name": "肃宁县",
                        "aid": "130926"
                    },

                    {
                        "id": 8,
                        "name": "南皮县",
                        "aid": "130927"
                    },

                    {
                        "id": 9,
                        "name": "吴桥县",
                        "aid": "130928"
                    },

                    {
                        "id": 10,
                        "name": "献县",
                        "aid": "130929"
                    },

                    {
                        "id": 11,
                        "name": "孟村回族自治县",
                        "aid": "130930"
                    },

                    {
                        "id": 12,
                        "name": "泊头市",
                        "aid": "130981"
                    },

                    {
                        "id": 13,
                        "name": "任丘市",
                        "aid": "130982"
                    },

                    {
                        "id": 14,
                        "name": "黄骅市",
                        "aid": "130983"
                    },

                    {
                        "id": 15,
                        "name": "河间市",
                        "aid": "130984"
                    },

                    {
                        "id": 16,
                        "name": "渤海新区",
                        "aid": "130985"
                    },

                    {
                        "id": 17,
                        "name": "临港经济技术开发区",
                        "aid": "130986"
                    },

                ]
            },

            {
                "id": 9,
                "name": "廊坊市",
                "aid": "131000",
                "sub": [

                    {
                        "id": 0,
                        "name": "安次区",
                        "aid": "131002"
                    },

                    {
                        "id": 1,
                        "name": "广阳区",
                        "aid": "131003"
                    },

                    {
                        "id": 2,
                        "name": "固安县",
                        "aid": "131022"
                    },

                    {
                        "id": 3,
                        "name": "永清县",
                        "aid": "131023"
                    },

                    {
                        "id": 4,
                        "name": "香河县",
                        "aid": "131024"
                    },

                    {
                        "id": 5,
                        "name": "大城县",
                        "aid": "131025"
                    },

                    {
                        "id": 6,
                        "name": "文安县",
                        "aid": "131026"
                    },

                    {
                        "id": 7,
                        "name": "大厂回族自治县",
                        "aid": "131028"
                    },

                    {
                        "id": 8,
                        "name": "霸州市",
                        "aid": "131081"
                    },

                    {
                        "id": 9,
                        "name": "三河市",
                        "aid": "131082"
                    },

                    {
                        "id": 10,
                        "name": "经济技术开发区",
                        "aid": "131083"
                    },

                ]
            },

            {
                "id": 10,
                "name": "衡水市",
                "aid": "131100",
                "sub": [

                    {
                        "id": 0,
                        "name": "桃城区",
                        "aid": "131102"
                    },

                    {
                        "id": 1,
                        "name": "冀州区",
                        "aid": "131103"
                    },

                    {
                        "id": 2,
                        "name": "枣强县",
                        "aid": "131121"
                    },

                    {
                        "id": 3,
                        "name": "武邑县",
                        "aid": "131122"
                    },

                    {
                        "id": 4,
                        "name": "武强县",
                        "aid": "131123"
                    },

                    {
                        "id": 5,
                        "name": "饶阳县",
                        "aid": "131124"
                    },

                    {
                        "id": 6,
                        "name": "安平县",
                        "aid": "131125"
                    },

                    {
                        "id": 7,
                        "name": "故城县",
                        "aid": "131126"
                    },

                    {
                        "id": 8,
                        "name": "景县",
                        "aid": "131127"
                    },

                    {
                        "id": 9,
                        "name": "阜城县",
                        "aid": "131128"
                    },

                    {
                        "id": 10,
                        "name": "深州市",
                        "aid": "131182"
                    },

                ]
            },

        ]
    },

    {
        "id": 3,
        "name": "山西省",
        "aid": "140000",
        "sub": [

            {
                "id": 0,
                "name": "太原市",
                "aid": "140100",
                "sub": [

                    {
                        "id": 0,
                        "name": "小店区",
                        "aid": "140105"
                    },

                    {
                        "id": 1,
                        "name": "迎泽区",
                        "aid": "140106"
                    },

                    {
                        "id": 2,
                        "name": "杏花岭区",
                        "aid": "140107"
                    },

                    {
                        "id": 3,
                        "name": "尖草坪区",
                        "aid": "140108"
                    },

                    {
                        "id": 4,
                        "name": "万柏林区",
                        "aid": "140109"
                    },

                    {
                        "id": 5,
                        "name": "晋源区",
                        "aid": "140110"
                    },

                    {
                        "id": 6,
                        "name": "清徐县",
                        "aid": "140121"
                    },

                    {
                        "id": 7,
                        "name": "阳曲县",
                        "aid": "140122"
                    },

                    {
                        "id": 8,
                        "name": "娄烦县",
                        "aid": "140123"
                    },

                    {
                        "id": 9,
                        "name": "古交市",
                        "aid": "140181"
                    },

                    {
                        "id": 10,
                        "name": "高新阳曲园区",
                        "aid": "140182"
                    },

                    {
                        "id": 11,
                        "name": "高新汾东园区",
                        "aid": "140183"
                    },

                    {
                        "id": 12,
                        "name": "高新姚村园区",
                        "aid": "140184"
                    },

                ]
            },

            {
                "id": 10,
                "name": "吕梁市",
                "aid": "141100",
                "sub": [

                    {
                        "id": 0,
                        "name": "离石区",
                        "aid": "141102"
                    },

                    {
                        "id": 1,
                        "name": "文水县",
                        "aid": "141121"
                    },

                    {
                        "id": 2,
                        "name": "交城县",
                        "aid": "141122"
                    },

                    {
                        "id": 3,
                        "name": "兴县",
                        "aid": "141123"
                    },

                    {
                        "id": 4,
                        "name": "临县",
                        "aid": "141124"
                    },

                    {
                        "id": 5,
                        "name": "柳林县",
                        "aid": "141125"
                    },

                    {
                        "id": 6,
                        "name": "石楼县",
                        "aid": "141126"
                    },

                    {
                        "id": 7,
                        "name": "岚县",
                        "aid": "141127"
                    },

                    {
                        "id": 8,
                        "name": "方山县",
                        "aid": "141128"
                    },

                    {
                        "id": 9,
                        "name": "中阳县",
                        "aid": "141129"
                    },

                    {
                        "id": 10,
                        "name": "交口县",
                        "aid": "141130"
                    },

                    {
                        "id": 11,
                        "name": "孝义市",
                        "aid": "141181"
                    },

                    {
                        "id": 12,
                        "name": "汾阳市",
                        "aid": "141182"
                    },

                ]
            },

            {
                "id": 1,
                "name": "大同市",
                "aid": "140200",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "140202"
                    },

                    {
                        "id": 1,
                        "name": "矿区",
                        "aid": "140203"
                    },

                    {
                        "id": 2,
                        "name": "南郊区",
                        "aid": "140211"
                    },

                    {
                        "id": 3,
                        "name": "新荣区",
                        "aid": "140212"
                    },

                    {
                        "id": 4,
                        "name": "阳高县",
                        "aid": "140221"
                    },

                    {
                        "id": 5,
                        "name": "天镇县",
                        "aid": "140222"
                    },

                    {
                        "id": 6,
                        "name": "广灵县",
                        "aid": "140223"
                    },

                    {
                        "id": 7,
                        "name": "灵丘县",
                        "aid": "140224"
                    },

                    {
                        "id": 8,
                        "name": "浑源县",
                        "aid": "140225"
                    },

                    {
                        "id": 9,
                        "name": "左云县",
                        "aid": "140226"
                    },

                    {
                        "id": 10,
                        "name": "大同县",
                        "aid": "140227"
                    },

                    {
                        "id": 11,
                        "name": "经济开发区",
                        "aid": "140228"
                    },

                ]
            },

            {
                "id": 2,
                "name": "阳泉市",
                "aid": "140300",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "140302"
                    },

                    {
                        "id": 1,
                        "name": "矿区",
                        "aid": "140303"
                    },

                    {
                        "id": 2,
                        "name": "郊区",
                        "aid": "140311"
                    },

                    {
                        "id": 3,
                        "name": "平定县",
                        "aid": "140321"
                    },

                    {
                        "id": 4,
                        "name": "盂县",
                        "aid": "140322"
                    },

                ]
            },

            {
                "id": 3,
                "name": "长治市",
                "aid": "140400",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "140402"
                    },

                    {
                        "id": 1,
                        "name": "郊区",
                        "aid": "140411"
                    },

                    {
                        "id": 2,
                        "name": "长治县",
                        "aid": "140421"
                    },

                    {
                        "id": 3,
                        "name": "襄垣县",
                        "aid": "140423"
                    },

                    {
                        "id": 4,
                        "name": "屯留县",
                        "aid": "140424"
                    },

                    {
                        "id": 5,
                        "name": "平顺县",
                        "aid": "140425"
                    },

                    {
                        "id": 6,
                        "name": "黎城县",
                        "aid": "140426"
                    },

                    {
                        "id": 7,
                        "name": "壶关县",
                        "aid": "140427"
                    },

                    {
                        "id": 8,
                        "name": "长子县",
                        "aid": "140428"
                    },

                    {
                        "id": 9,
                        "name": "武乡县",
                        "aid": "140429"
                    },

                    {
                        "id": 10,
                        "name": "沁县",
                        "aid": "140430"
                    },

                    {
                        "id": 11,
                        "name": "沁源县",
                        "aid": "140431"
                    },

                    {
                        "id": 12,
                        "name": "潞城市",
                        "aid": "140481"
                    },

                ]
            },

            {
                "id": 4,
                "name": "晋城市",
                "aid": "140500",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "140502"
                    },

                    {
                        "id": 1,
                        "name": "沁水县",
                        "aid": "140521"
                    },

                    {
                        "id": 2,
                        "name": "阳城县",
                        "aid": "140522"
                    },

                    {
                        "id": 3,
                        "name": "陵川县",
                        "aid": "140524"
                    },

                    {
                        "id": 4,
                        "name": "泽州县",
                        "aid": "140525"
                    },

                    {
                        "id": 5,
                        "name": "高平市",
                        "aid": "140581"
                    },

                    {
                        "id": 6,
                        "name": "经济开发区",
                        "aid": "140582"
                    },

                ]
            },

            {
                "id": 5,
                "name": "朔州市",
                "aid": "140600",
                "sub": [

                    {
                        "id": 0,
                        "name": "朔城区",
                        "aid": "140602"
                    },

                    {
                        "id": 1,
                        "name": "平鲁区",
                        "aid": "140603"
                    },

                    {
                        "id": 2,
                        "name": "山阴县",
                        "aid": "140621"
                    },

                    {
                        "id": 3,
                        "name": "应县",
                        "aid": "140622"
                    },

                    {
                        "id": 4,
                        "name": "右玉县",
                        "aid": "140623"
                    },

                    {
                        "id": 5,
                        "name": "怀仁县",
                        "aid": "140624"
                    },

                ]
            },

            {
                "id": 6,
                "name": "晋中市",
                "aid": "140700",
                "sub": [

                    {
                        "id": 0,
                        "name": "榆次区",
                        "aid": "140702"
                    },

                    {
                        "id": 1,
                        "name": "榆社县",
                        "aid": "140721"
                    },

                    {
                        "id": 2,
                        "name": "左权县",
                        "aid": "140722"
                    },

                    {
                        "id": 3,
                        "name": "和顺县",
                        "aid": "140723"
                    },

                    {
                        "id": 4,
                        "name": "昔阳县",
                        "aid": "140724"
                    },

                    {
                        "id": 5,
                        "name": "寿阳县",
                        "aid": "140725"
                    },

                    {
                        "id": 6,
                        "name": "太谷县",
                        "aid": "140726"
                    },

                    {
                        "id": 7,
                        "name": "祁县",
                        "aid": "140727"
                    },

                    {
                        "id": 8,
                        "name": "平遥县",
                        "aid": "140728"
                    },

                    {
                        "id": 9,
                        "name": "灵石县",
                        "aid": "140729"
                    },

                    {
                        "id": 10,
                        "name": "介休市",
                        "aid": "140781"
                    },

                ]
            },

            {
                "id": 7,
                "name": "运城市",
                "aid": "140800",
                "sub": [

                    {
                        "id": 0,
                        "name": "盐湖区",
                        "aid": "140802"
                    },

                    {
                        "id": 1,
                        "name": "临猗县",
                        "aid": "140821"
                    },

                    {
                        "id": 2,
                        "name": "万荣县",
                        "aid": "140822"
                    },

                    {
                        "id": 3,
                        "name": "闻喜县",
                        "aid": "140823"
                    },

                    {
                        "id": 4,
                        "name": "稷山县",
                        "aid": "140824"
                    },

                    {
                        "id": 5,
                        "name": "新绛县",
                        "aid": "140825"
                    },

                    {
                        "id": 6,
                        "name": "绛县",
                        "aid": "140826"
                    },

                    {
                        "id": 7,
                        "name": "垣曲县",
                        "aid": "140827"
                    },

                    {
                        "id": 8,
                        "name": "夏县",
                        "aid": "140828"
                    },

                    {
                        "id": 9,
                        "name": "平陆县",
                        "aid": "140829"
                    },

                    {
                        "id": 10,
                        "name": "芮城县",
                        "aid": "140830"
                    },

                    {
                        "id": 11,
                        "name": "永济市",
                        "aid": "140881"
                    },

                    {
                        "id": 12,
                        "name": "河津市",
                        "aid": "140882"
                    },

                ]
            },

            {
                "id": 8,
                "name": "忻州市",
                "aid": "140900",
                "sub": [

                    {
                        "id": 0,
                        "name": "忻府区",
                        "aid": "140902"
                    },

                    {
                        "id": 1,
                        "name": "定襄县",
                        "aid": "140921"
                    },

                    {
                        "id": 2,
                        "name": "五台县",
                        "aid": "140922"
                    },

                    {
                        "id": 3,
                        "name": "代县",
                        "aid": "140923"
                    },

                    {
                        "id": 4,
                        "name": "繁峙县",
                        "aid": "140924"
                    },

                    {
                        "id": 5,
                        "name": "宁武县",
                        "aid": "140925"
                    },

                    {
                        "id": 6,
                        "name": "静乐县",
                        "aid": "140926"
                    },

                    {
                        "id": 7,
                        "name": "神池县",
                        "aid": "140927"
                    },

                    {
                        "id": 8,
                        "name": "五寨县",
                        "aid": "140928"
                    },

                    {
                        "id": 9,
                        "name": "岢岚县",
                        "aid": "140929"
                    },

                    {
                        "id": 10,
                        "name": "河曲县",
                        "aid": "140930"
                    },

                    {
                        "id": 11,
                        "name": "保德县",
                        "aid": "140931"
                    },

                    {
                        "id": 12,
                        "name": "偏关县",
                        "aid": "140932"
                    },

                    {
                        "id": 13,
                        "name": "原平市",
                        "aid": "140981"
                    },

                ]
            },

            {
                "id": 9,
                "name": "临汾市",
                "aid": "141000",
                "sub": [

                    {
                        "id": 0,
                        "name": "尧都区",
                        "aid": "141002"
                    },

                    {
                        "id": 1,
                        "name": "曲沃县",
                        "aid": "141021"
                    },

                    {
                        "id": 2,
                        "name": "翼城县",
                        "aid": "141022"
                    },

                    {
                        "id": 3,
                        "name": "襄汾县",
                        "aid": "141023"
                    },

                    {
                        "id": 4,
                        "name": "洪洞县",
                        "aid": "141024"
                    },

                    {
                        "id": 5,
                        "name": "古县",
                        "aid": "141025"
                    },

                    {
                        "id": 6,
                        "name": "安泽县",
                        "aid": "141026"
                    },

                    {
                        "id": 7,
                        "name": "浮山县",
                        "aid": "141027"
                    },

                    {
                        "id": 8,
                        "name": "吉县",
                        "aid": "141028"
                    },

                    {
                        "id": 9,
                        "name": "乡宁县",
                        "aid": "141029"
                    },

                    {
                        "id": 10,
                        "name": "大宁县",
                        "aid": "141030"
                    },

                    {
                        "id": 11,
                        "name": "隰县",
                        "aid": "141031"
                    },

                    {
                        "id": 12,
                        "name": "永和县",
                        "aid": "141032"
                    },

                    {
                        "id": 13,
                        "name": "蒲县",
                        "aid": "141033"
                    },

                    {
                        "id": 14,
                        "name": "汾西县",
                        "aid": "141034"
                    },

                    {
                        "id": 15,
                        "name": "侯马市",
                        "aid": "141081"
                    },

                    {
                        "id": 16,
                        "name": "霍州市",
                        "aid": "141082"
                    },

                ]
            },

        ]
    },

    {
        "id": 4,
        "name": "内蒙古自治区",
        "aid": "150000",
        "sub": [

            {
                "id": 0,
                "name": "呼和浩特市",
                "aid": "150100",
                "sub": [

                    {
                        "id": 0,
                        "name": "新城区",
                        "aid": "150102"
                    },

                    {
                        "id": 1,
                        "name": "回民区",
                        "aid": "150103"
                    },

                    {
                        "id": 2,
                        "name": "玉泉区",
                        "aid": "150104"
                    },

                    {
                        "id": 3,
                        "name": "赛罕区",
                        "aid": "150105"
                    },

                    {
                        "id": 4,
                        "name": "土默特左旗",
                        "aid": "150121"
                    },

                    {
                        "id": 5,
                        "name": "托克托县",
                        "aid": "150122"
                    },

                    {
                        "id": 6,
                        "name": "和林格尔县",
                        "aid": "150123"
                    },

                    {
                        "id": 7,
                        "name": "清水河县",
                        "aid": "150124"
                    },

                    {
                        "id": 8,
                        "name": "武川县",
                        "aid": "150125"
                    },

                ]
            },

            {
                "id": 2,
                "name": "乌海市",
                "aid": "150300",
                "sub": [

                    {
                        "id": 0,
                        "name": "海勃湾区",
                        "aid": "150302"
                    },

                    {
                        "id": 1,
                        "name": "海南区",
                        "aid": "150303"
                    },

                    {
                        "id": 2,
                        "name": "乌达区",
                        "aid": "150304"
                    },

                ]
            },

            {
                "id": 1,
                "name": "包头市",
                "aid": "150200",
                "sub": [

                    {
                        "id": 0,
                        "name": "东河区",
                        "aid": "150202"
                    },

                    {
                        "id": 1,
                        "name": "昆都仑区",
                        "aid": "150203"
                    },

                    {
                        "id": 2,
                        "name": "青山区",
                        "aid": "150204"
                    },

                    {
                        "id": 3,
                        "name": "石拐区",
                        "aid": "150205"
                    },

                    {
                        "id": 4,
                        "name": "白云鄂博矿区",
                        "aid": "150206"
                    },

                    {
                        "id": 5,
                        "name": "九原区",
                        "aid": "150207"
                    },

                    {
                        "id": 6,
                        "name": "土默特右旗",
                        "aid": "150221"
                    },

                    {
                        "id": 7,
                        "name": "固阳县",
                        "aid": "150222"
                    },

                    {
                        "id": 8,
                        "name": "达尔罕茂明安联合旗",
                        "aid": "150223"
                    },

                ]
            },

            {
                "id": 3,
                "name": "赤峰市",
                "aid": "150400",
                "sub": [

                    {
                        "id": 0,
                        "name": "红山区",
                        "aid": "150402"
                    },

                    {
                        "id": 1,
                        "name": "元宝山区",
                        "aid": "150403"
                    },

                    {
                        "id": 2,
                        "name": "松山区",
                        "aid": "150404"
                    },

                    {
                        "id": 3,
                        "name": "阿鲁科尔沁旗",
                        "aid": "150421"
                    },

                    {
                        "id": 4,
                        "name": "巴林左旗",
                        "aid": "150422"
                    },

                    {
                        "id": 5,
                        "name": "巴林右旗",
                        "aid": "150423"
                    },

                    {
                        "id": 6,
                        "name": "林西县",
                        "aid": "150424"
                    },

                    {
                        "id": 7,
                        "name": "克什克腾旗",
                        "aid": "150425"
                    },

                    {
                        "id": 8,
                        "name": "翁牛特旗",
                        "aid": "150426"
                    },

                    {
                        "id": 9,
                        "name": "喀喇沁旗",
                        "aid": "150428"
                    },

                    {
                        "id": 10,
                        "name": "宁城县",
                        "aid": "150429"
                    },

                    {
                        "id": 11,
                        "name": "敖汉旗",
                        "aid": "150430"
                    },

                ]
            },

            {
                "id": 4,
                "name": "通辽市",
                "aid": "150500",
                "sub": [

                    {
                        "id": 0,
                        "name": "科尔沁区",
                        "aid": "150502"
                    },

                    {
                        "id": 1,
                        "name": "科尔沁左翼中旗",
                        "aid": "150521"
                    },

                    {
                        "id": 2,
                        "name": "科尔沁左翼后旗",
                        "aid": "150522"
                    },

                    {
                        "id": 3,
                        "name": "开鲁县",
                        "aid": "150523"
                    },

                    {
                        "id": 4,
                        "name": "库伦旗",
                        "aid": "150524"
                    },

                    {
                        "id": 5,
                        "name": "奈曼旗",
                        "aid": "150525"
                    },

                    {
                        "id": 6,
                        "name": "扎鲁特旗",
                        "aid": "150526"
                    },

                    {
                        "id": 7,
                        "name": "霍林郭勒市",
                        "aid": "150581"
                    },

                ]
            },

            {
                "id": 5,
                "name": "鄂尔多斯市",
                "aid": "150600",
                "sub": [

                    {
                        "id": 0,
                        "name": "东胜区",
                        "aid": "150602"
                    },

                    {
                        "id": 1,
                        "name": "康巴什区",
                        "aid": "150603"
                    },

                    {
                        "id": 2,
                        "name": "达拉特旗",
                        "aid": "150621"
                    },

                    {
                        "id": 3,
                        "name": "准格尔旗",
                        "aid": "150622"
                    },

                    {
                        "id": 4,
                        "name": "鄂托克前旗",
                        "aid": "150623"
                    },

                    {
                        "id": 5,
                        "name": "鄂托克旗",
                        "aid": "150624"
                    },

                    {
                        "id": 6,
                        "name": "杭锦旗",
                        "aid": "150625"
                    },

                    {
                        "id": 7,
                        "name": "乌审旗",
                        "aid": "150626"
                    },

                    {
                        "id": 8,
                        "name": "伊金霍洛旗",
                        "aid": "150627"
                    },

                ]
            },

            {
                "id": 6,
                "name": "呼伦贝尔市",
                "aid": "150700",
                "sub": [

                    {
                        "id": 0,
                        "name": "海拉尔区",
                        "aid": "150702"
                    },

                    {
                        "id": 1,
                        "name": "扎赉诺尔区",
                        "aid": "150703"
                    },

                    {
                        "id": 2,
                        "name": "阿荣旗",
                        "aid": "150721"
                    },

                    {
                        "id": 3,
                        "name": "莫力达瓦达斡尔族自治旗",
                        "aid": "150722"
                    },

                    {
                        "id": 4,
                        "name": "鄂伦春自治旗",
                        "aid": "150723"
                    },

                    {
                        "id": 5,
                        "name": "鄂温克族自治旗",
                        "aid": "150724"
                    },

                    {
                        "id": 6,
                        "name": "陈巴尔虎旗",
                        "aid": "150725"
                    },

                    {
                        "id": 7,
                        "name": "新巴尔虎左旗",
                        "aid": "150726"
                    },

                    {
                        "id": 8,
                        "name": "新巴尔虎右旗",
                        "aid": "150727"
                    },

                    {
                        "id": 9,
                        "name": "满洲里市",
                        "aid": "150781"
                    },

                    {
                        "id": 10,
                        "name": "牙克石市",
                        "aid": "150782"
                    },

                    {
                        "id": 11,
                        "name": "扎兰屯市",
                        "aid": "150783"
                    },

                    {
                        "id": 12,
                        "name": "额尔古纳市",
                        "aid": "150784"
                    },

                    {
                        "id": 13,
                        "name": "根河市",
                        "aid": "150785"
                    },

                ]
            },

            {
                "id": 7,
                "name": "巴彦淖尔市",
                "aid": "150800",
                "sub": [

                    {
                        "id": 0,
                        "name": "临河区",
                        "aid": "150802"
                    },

                    {
                        "id": 1,
                        "name": "五原县",
                        "aid": "150821"
                    },

                    {
                        "id": 2,
                        "name": "磴口县",
                        "aid": "150822"
                    },

                    {
                        "id": 3,
                        "name": "乌拉特前旗",
                        "aid": "150823"
                    },

                    {
                        "id": 4,
                        "name": "乌拉特中旗",
                        "aid": "150824"
                    },

                    {
                        "id": 5,
                        "name": "乌拉特后旗",
                        "aid": "150825"
                    },

                    {
                        "id": 6,
                        "name": "杭锦后旗",
                        "aid": "150826"
                    },

                ]
            },

            {
                "id": 8,
                "name": "乌兰察布市",
                "aid": "150900",
                "sub": [

                    {
                        "id": 0,
                        "name": "集宁区",
                        "aid": "150902"
                    },

                    {
                        "id": 1,
                        "name": "卓资县",
                        "aid": "150921"
                    },

                    {
                        "id": 2,
                        "name": "化德县",
                        "aid": "150922"
                    },

                    {
                        "id": 3,
                        "name": "商都县",
                        "aid": "150923"
                    },

                    {
                        "id": 4,
                        "name": "兴和县",
                        "aid": "150924"
                    },

                    {
                        "id": 5,
                        "name": "凉城县",
                        "aid": "150925"
                    },

                    {
                        "id": 6,
                        "name": "察哈尔右翼前旗",
                        "aid": "150926"
                    },

                    {
                        "id": 7,
                        "name": "察哈尔右翼中旗",
                        "aid": "150927"
                    },

                    {
                        "id": 8,
                        "name": "察哈尔右翼后旗",
                        "aid": "150928"
                    },

                    {
                        "id": 9,
                        "name": "四子王旗",
                        "aid": "150929"
                    },

                    {
                        "id": 10,
                        "name": "丰镇市",
                        "aid": "150981"
                    },

                ]
            },

            {
                "id": 9,
                "name": "兴安盟",
                "aid": "152200",
                "sub": [

                    {
                        "id": 0,
                        "name": "乌兰浩特市",
                        "aid": "152201"
                    },

                    {
                        "id": 1,
                        "name": "阿尔山市",
                        "aid": "152202"
                    },

                    {
                        "id": 2,
                        "name": "科尔沁右翼前旗",
                        "aid": "152221"
                    },

                    {
                        "id": 3,
                        "name": "科尔沁右翼中旗",
                        "aid": "152222"
                    },

                    {
                        "id": 4,
                        "name": "扎赉特旗",
                        "aid": "152223"
                    },

                    {
                        "id": 5,
                        "name": "突泉县",
                        "aid": "152224"
                    },

                ]
            },

            {
                "id": 10,
                "name": "锡林郭勒盟",
                "aid": "152500",
                "sub": [

                    {
                        "id": 0,
                        "name": "二连浩特市",
                        "aid": "152501"
                    },

                    {
                        "id": 1,
                        "name": "锡林浩特市",
                        "aid": "152502"
                    },

                    {
                        "id": 2,
                        "name": "阿巴嘎旗",
                        "aid": "152522"
                    },

                    {
                        "id": 3,
                        "name": "苏尼特左旗",
                        "aid": "152523"
                    },

                    {
                        "id": 4,
                        "name": "苏尼特右旗",
                        "aid": "152524"
                    },

                    {
                        "id": 5,
                        "name": "东乌珠穆沁旗",
                        "aid": "152525"
                    },

                    {
                        "id": 6,
                        "name": "西乌珠穆沁旗",
                        "aid": "152526"
                    },

                    {
                        "id": 7,
                        "name": "太仆寺旗",
                        "aid": "152527"
                    },

                    {
                        "id": 8,
                        "name": "镶黄旗",
                        "aid": "152528"
                    },

                    {
                        "id": 9,
                        "name": "正镶白旗",
                        "aid": "152529"
                    },

                    {
                        "id": 10,
                        "name": "正蓝旗",
                        "aid": "152530"
                    },

                    {
                        "id": 11,
                        "name": "多伦县",
                        "aid": "152531"
                    },

                ]
            },

            {
                "id": 11,
                "name": "阿拉善盟",
                "aid": "152900",
                "sub": [

                    {
                        "id": 0,
                        "name": "阿拉善左旗",
                        "aid": "152921"
                    },

                    {
                        "id": 1,
                        "name": "阿拉善右旗",
                        "aid": "152922"
                    },

                    {
                        "id": 2,
                        "name": "额济纳旗",
                        "aid": "152923"
                    },

                ]
            },

        ]
    },

    {
        "id": 5,
        "name": "辽宁省",
        "aid": "210000",
        "sub": [

            {
                "id": 0,
                "name": "沈阳市",
                "aid": "210100",
                "sub": [

                    {
                        "id": 0,
                        "name": "和平区",
                        "aid": "210102"
                    },

                    {
                        "id": 1,
                        "name": "沈河区",
                        "aid": "210103"
                    },

                    {
                        "id": 2,
                        "name": "大东区",
                        "aid": "210104"
                    },

                    {
                        "id": 3,
                        "name": "皇姑区",
                        "aid": "210105"
                    },

                    {
                        "id": 4,
                        "name": "铁西区",
                        "aid": "210106"
                    },

                    {
                        "id": 5,
                        "name": "苏家屯区",
                        "aid": "210111"
                    },

                    {
                        "id": 6,
                        "name": "浑南区",
                        "aid": "210112"
                    },

                    {
                        "id": 7,
                        "name": "沈北新区",
                        "aid": "210113"
                    },

                    {
                        "id": 8,
                        "name": "于洪区",
                        "aid": "210114"
                    },

                    {
                        "id": 9,
                        "name": "辽中区",
                        "aid": "210115"
                    },

                    {
                        "id": 10,
                        "name": "康平县",
                        "aid": "210123"
                    },

                    {
                        "id": 11,
                        "name": "法库县",
                        "aid": "210124"
                    },

                    {
                        "id": 12,
                        "name": "新民市",
                        "aid": "210181"
                    },

                    {
                        "id": 13,
                        "name": "高新区",
                        "aid": "210182"
                    },

                ]
            },

            {
                "id": 1,
                "name": "大连市",
                "aid": "210200",
                "sub": [

                    {
                        "id": 0,
                        "name": "中山区",
                        "aid": "210202"
                    },

                    {
                        "id": 1,
                        "name": "西岗区",
                        "aid": "210203"
                    },

                    {
                        "id": 2,
                        "name": "沙河口区",
                        "aid": "210204"
                    },

                    {
                        "id": 3,
                        "name": "甘井子区",
                        "aid": "210211"
                    },

                    {
                        "id": 4,
                        "name": "旅顺口区",
                        "aid": "210212"
                    },

                    {
                        "id": 5,
                        "name": "金州区",
                        "aid": "210213"
                    },

                    {
                        "id": 6,
                        "name": "普兰店区",
                        "aid": "210214"
                    },

                    {
                        "id": 7,
                        "name": "长海县",
                        "aid": "210224"
                    },

                    {
                        "id": 8,
                        "name": "瓦房店市",
                        "aid": "210281"
                    },

                    {
                        "id": 9,
                        "name": "庄河市",
                        "aid": "210283"
                    },

                    {
                        "id": 10,
                        "name": "高新区",
                        "aid": "210284"
                    },

                    {
                        "id": 11,
                        "name": "经济开发区",
                        "aid": "210285"
                    },

                    {
                        "id": 12,
                        "name": "金普新区",
                        "aid": "210286"
                    },

                ]
            },

            {
                "id": 2,
                "name": "鞍山市",
                "aid": "210300",
                "sub": [

                    {
                        "id": 0,
                        "name": "铁东区",
                        "aid": "210302"
                    },

                    {
                        "id": 1,
                        "name": "铁西区",
                        "aid": "210303"
                    },

                    {
                        "id": 2,
                        "name": "立山区",
                        "aid": "210304"
                    },

                    {
                        "id": 3,
                        "name": "千山区",
                        "aid": "210311"
                    },

                    {
                        "id": 4,
                        "name": "台安县",
                        "aid": "210321"
                    },

                    {
                        "id": 5,
                        "name": "岫岩满族自治县",
                        "aid": "210323"
                    },

                    {
                        "id": 6,
                        "name": "海城市",
                        "aid": "210381"
                    },

                    {
                        "id": 7,
                        "name": "高新区",
                        "aid": "210382"
                    },

                ]
            },

            {
                "id": 3,
                "name": "抚顺市",
                "aid": "210400",
                "sub": [

                    {
                        "id": 0,
                        "name": "新抚区",
                        "aid": "210402"
                    },

                    {
                        "id": 1,
                        "name": "东洲区",
                        "aid": "210403"
                    },

                    {
                        "id": 2,
                        "name": "望花区",
                        "aid": "210404"
                    },

                    {
                        "id": 3,
                        "name": "顺城区",
                        "aid": "210411"
                    },

                    {
                        "id": 4,
                        "name": "抚顺县",
                        "aid": "210421"
                    },

                    {
                        "id": 5,
                        "name": "新宾满族自治县",
                        "aid": "210422"
                    },

                    {
                        "id": 6,
                        "name": "清原满族自治县",
                        "aid": "210423"
                    },

                ]
            },

            {
                "id": 4,
                "name": "本溪市",
                "aid": "210500",
                "sub": [

                    {
                        "id": 0,
                        "name": "平山区",
                        "aid": "210502"
                    },

                    {
                        "id": 1,
                        "name": "溪湖区",
                        "aid": "210503"
                    },

                    {
                        "id": 2,
                        "name": "明山区",
                        "aid": "210504"
                    },

                    {
                        "id": 3,
                        "name": "南芬区",
                        "aid": "210505"
                    },

                    {
                        "id": 4,
                        "name": "本溪满族自治县",
                        "aid": "210521"
                    },

                    {
                        "id": 5,
                        "name": "桓仁满族自治县",
                        "aid": "210522"
                    },

                ]
            },

            {
                "id": 5,
                "name": "丹东市",
                "aid": "210600",
                "sub": [

                    {
                        "id": 0,
                        "name": "元宝区",
                        "aid": "210602"
                    },

                    {
                        "id": 1,
                        "name": "振兴区",
                        "aid": "210603"
                    },

                    {
                        "id": 2,
                        "name": "振安区",
                        "aid": "210604"
                    },

                    {
                        "id": 3,
                        "name": "宽甸满族自治县",
                        "aid": "210624"
                    },

                    {
                        "id": 4,
                        "name": "东港市",
                        "aid": "210681"
                    },

                    {
                        "id": 5,
                        "name": "凤城市",
                        "aid": "210682"
                    },

                ]
            },

            {
                "id": 6,
                "name": "锦州市",
                "aid": "210700",
                "sub": [

                    {
                        "id": 0,
                        "name": "古塔区",
                        "aid": "210702"
                    },

                    {
                        "id": 1,
                        "name": "凌河区",
                        "aid": "210703"
                    },

                    {
                        "id": 2,
                        "name": "太和区",
                        "aid": "210711"
                    },

                    {
                        "id": 3,
                        "name": "黑山县",
                        "aid": "210726"
                    },

                    {
                        "id": 4,
                        "name": "义县",
                        "aid": "210727"
                    },

                    {
                        "id": 5,
                        "name": "凌海市",
                        "aid": "210781"
                    },

                    {
                        "id": 6,
                        "name": "北镇市",
                        "aid": "210782"
                    },

                    {
                        "id": 7,
                        "name": "松山新区",
                        "aid": "210783"
                    },

                    {
                        "id": 8,
                        "name": "龙栖湾新区",
                        "aid": "210784"
                    },

                    {
                        "id": 9,
                        "name": "经济技术开发区",
                        "aid": "210785"
                    },

                ]
            },

            {
                "id": 7,
                "name": "营口市",
                "aid": "210800",
                "sub": [

                    {
                        "id": 0,
                        "name": "站前区",
                        "aid": "210802"
                    },

                    {
                        "id": 1,
                        "name": "西市区",
                        "aid": "210803"
                    },

                    {
                        "id": 2,
                        "name": "鲅鱼圈区",
                        "aid": "210804"
                    },

                    {
                        "id": 3,
                        "name": "老边区",
                        "aid": "210811"
                    },

                    {
                        "id": 4,
                        "name": "盖州市",
                        "aid": "210881"
                    },

                    {
                        "id": 5,
                        "name": "大石桥市",
                        "aid": "210882"
                    },

                ]
            },

            {
                "id": 8,
                "name": "阜新市",
                "aid": "210900",
                "sub": [

                    {
                        "id": 0,
                        "name": "海州区",
                        "aid": "210902"
                    },

                    {
                        "id": 1,
                        "name": "新邱区",
                        "aid": "210903"
                    },

                    {
                        "id": 2,
                        "name": "太平区",
                        "aid": "210904"
                    },

                    {
                        "id": 3,
                        "name": "清河门区",
                        "aid": "210905"
                    },

                    {
                        "id": 4,
                        "name": "细河区",
                        "aid": "210911"
                    },

                    {
                        "id": 5,
                        "name": "阜新蒙古族自治县",
                        "aid": "210921"
                    },

                    {
                        "id": 6,
                        "name": "彰武县",
                        "aid": "210922"
                    },

                ]
            },

            {
                "id": 9,
                "name": "辽阳市",
                "aid": "211000",
                "sub": [

                    {
                        "id": 0,
                        "name": "白塔区",
                        "aid": "211002"
                    },

                    {
                        "id": 1,
                        "name": "文圣区",
                        "aid": "211003"
                    },

                    {
                        "id": 2,
                        "name": "宏伟区",
                        "aid": "211004"
                    },

                    {
                        "id": 3,
                        "name": "弓长岭区",
                        "aid": "211005"
                    },

                    {
                        "id": 4,
                        "name": "太子河区",
                        "aid": "211011"
                    },

                    {
                        "id": 5,
                        "name": "辽阳县",
                        "aid": "211021"
                    },

                    {
                        "id": 6,
                        "name": "灯塔市",
                        "aid": "211081"
                    },

                ]
            },

            {
                "id": 10,
                "name": "盘锦市",
                "aid": "211100",
                "sub": [

                    {
                        "id": 0,
                        "name": "双台子区",
                        "aid": "211102"
                    },

                    {
                        "id": 1,
                        "name": "兴隆台区",
                        "aid": "211103"
                    },

                    {
                        "id": 2,
                        "name": "大洼区",
                        "aid": "211104"
                    },

                    {
                        "id": 3,
                        "name": "盘山县",
                        "aid": "211122"
                    },

                ]
            },

            {
                "id": 11,
                "name": "铁岭市",
                "aid": "211200",
                "sub": [

                    {
                        "id": 0,
                        "name": "银州区",
                        "aid": "211202"
                    },

                    {
                        "id": 1,
                        "name": "清河区",
                        "aid": "211204"
                    },

                    {
                        "id": 2,
                        "name": "铁岭县",
                        "aid": "211221"
                    },

                    {
                        "id": 3,
                        "name": "西丰县",
                        "aid": "211223"
                    },

                    {
                        "id": 4,
                        "name": "昌图县",
                        "aid": "211224"
                    },

                    {
                        "id": 5,
                        "name": "调兵山市",
                        "aid": "211281"
                    },

                    {
                        "id": 6,
                        "name": "开原市",
                        "aid": "211282"
                    },

                ]
            },

            {
                "id": 12,
                "name": "朝阳市",
                "aid": "211300",
                "sub": [

                    {
                        "id": 0,
                        "name": "双塔区",
                        "aid": "211302"
                    },

                    {
                        "id": 1,
                        "name": "龙城区",
                        "aid": "211303"
                    },

                    {
                        "id": 2,
                        "name": "朝阳县",
                        "aid": "211321"
                    },

                    {
                        "id": 3,
                        "name": "建平县",
                        "aid": "211322"
                    },

                    {
                        "id": 4,
                        "name": "喀喇沁左翼蒙古族自治县",
                        "aid": "211324"
                    },

                    {
                        "id": 5,
                        "name": "北票市",
                        "aid": "211381"
                    },

                    {
                        "id": 6,
                        "name": "凌源市",
                        "aid": "211382"
                    },

                ]
            },

            {
                "id": 13,
                "name": "葫芦岛市",
                "aid": "211400",
                "sub": [

                    {
                        "id": 0,
                        "name": "连山区",
                        "aid": "211402"
                    },

                    {
                        "id": 1,
                        "name": "龙港区",
                        "aid": "211403"
                    },

                    {
                        "id": 2,
                        "name": "南票区",
                        "aid": "211404"
                    },

                    {
                        "id": 3,
                        "name": "绥中县",
                        "aid": "211421"
                    },

                    {
                        "id": 4,
                        "name": "建昌县",
                        "aid": "211422"
                    },

                    {
                        "id": 5,
                        "name": "兴城市",
                        "aid": "211481"
                    },

                ]
            },

        ]
    },

    {
        "id": 6,
        "name": "吉林省",
        "aid": "220000",
        "sub": [

            {
                "id": 0,
                "name": "通化市",
                "aid": "220500",
                "sub": [

                    {
                        "id": 0,
                        "name": "东昌区",
                        "aid": "220502"
                    },

                    {
                        "id": 1,
                        "name": "二道江区",
                        "aid": "220503"
                    },

                    {
                        "id": 2,
                        "name": "通化县",
                        "aid": "220521"
                    },

                    {
                        "id": 3,
                        "name": "辉南县",
                        "aid": "220523"
                    },

                    {
                        "id": 4,
                        "name": "柳河县",
                        "aid": "220524"
                    },

                    {
                        "id": 5,
                        "name": "梅河口市",
                        "aid": "220581"
                    },

                    {
                        "id": 6,
                        "name": "集安市",
                        "aid": "220582"
                    },

                ]
            },

            {
                "id": 1,
                "name": "长春市",
                "aid": "220100",
                "sub": [

                    {
                        "id": 0,
                        "name": "南关区",
                        "aid": "220102"
                    },

                    {
                        "id": 1,
                        "name": "宽城区",
                        "aid": "220103"
                    },

                    {
                        "id": 2,
                        "name": "朝阳区",
                        "aid": "220104"
                    },

                    {
                        "id": 3,
                        "name": "二道区",
                        "aid": "220105"
                    },

                    {
                        "id": 4,
                        "name": "绿园区",
                        "aid": "220106"
                    },

                    {
                        "id": 5,
                        "name": "双阳区",
                        "aid": "220112"
                    },

                    {
                        "id": 6,
                        "name": "九台区",
                        "aid": "220113"
                    },

                    {
                        "id": 7,
                        "name": "农安县",
                        "aid": "220122"
                    },

                    {
                        "id": 8,
                        "name": "榆树市",
                        "aid": "220182"
                    },

                    {
                        "id": 9,
                        "name": "德惠市",
                        "aid": "220183"
                    },

                    {
                        "id": 10,
                        "name": "长春新区",
                        "aid": "220184"
                    },

                    {
                        "id": 11,
                        "name": "高新技术产业开发区",
                        "aid": "220185"
                    },

                    {
                        "id": 12,
                        "name": "经济技术开发区",
                        "aid": "220186"
                    },

                    {
                        "id": 13,
                        "name": "汽车产业开发区",
                        "aid": "220187"
                    },

                    {
                        "id": 14,
                        "name": "兴隆综合保税区",
                        "aid": "220188"
                    },

                ]
            },

            {
                "id": 2,
                "name": "吉林市",
                "aid": "220200",
                "sub": [

                    {
                        "id": 0,
                        "name": "昌邑区",
                        "aid": "220202"
                    },

                    {
                        "id": 1,
                        "name": "龙潭区",
                        "aid": "220203"
                    },

                    {
                        "id": 2,
                        "name": "船营区",
                        "aid": "220204"
                    },

                    {
                        "id": 3,
                        "name": "丰满区",
                        "aid": "220211"
                    },

                    {
                        "id": 4,
                        "name": "永吉县",
                        "aid": "220221"
                    },

                    {
                        "id": 5,
                        "name": "蛟河市",
                        "aid": "220281"
                    },

                    {
                        "id": 6,
                        "name": "桦甸市",
                        "aid": "220282"
                    },

                    {
                        "id": 7,
                        "name": "舒兰市",
                        "aid": "220283"
                    },

                    {
                        "id": 8,
                        "name": "磐石市",
                        "aid": "220284"
                    },

                    {
                        "id": 9,
                        "name": "高新区",
                        "aid": "220285"
                    },

                ]
            },

            {
                "id": 3,
                "name": "四平市",
                "aid": "220300",
                "sub": [

                    {
                        "id": 0,
                        "name": "铁西区",
                        "aid": "220302"
                    },

                    {
                        "id": 1,
                        "name": "铁东区",
                        "aid": "220303"
                    },

                    {
                        "id": 2,
                        "name": "梨树县",
                        "aid": "220322"
                    },

                    {
                        "id": 3,
                        "name": "伊通满族自治县",
                        "aid": "220323"
                    },

                    {
                        "id": 4,
                        "name": "公主岭市",
                        "aid": "220381"
                    },

                    {
                        "id": 5,
                        "name": "双辽市",
                        "aid": "220382"
                    },

                ]
            },

            {
                "id": 4,
                "name": "辽源市",
                "aid": "220400",
                "sub": [

                    {
                        "id": 0,
                        "name": "龙山区",
                        "aid": "220402"
                    },

                    {
                        "id": 1,
                        "name": "西安区",
                        "aid": "220403"
                    },

                    {
                        "id": 2,
                        "name": "东丰县",
                        "aid": "220421"
                    },

                    {
                        "id": 3,
                        "name": "东辽县",
                        "aid": "220422"
                    },

                ]
            },

            {
                "id": 5,
                "name": "白山市",
                "aid": "220600",
                "sub": [

                    {
                        "id": 0,
                        "name": "浑江区",
                        "aid": "220602"
                    },

                    {
                        "id": 1,
                        "name": "江源区",
                        "aid": "220605"
                    },

                    {
                        "id": 2,
                        "name": "抚松县",
                        "aid": "220621"
                    },

                    {
                        "id": 3,
                        "name": "靖宇县",
                        "aid": "220622"
                    },

                    {
                        "id": 4,
                        "name": "长白朝鲜族自治县",
                        "aid": "220623"
                    },

                    {
                        "id": 5,
                        "name": "临江市",
                        "aid": "220681"
                    },

                ]
            },

            {
                "id": 6,
                "name": "松原市",
                "aid": "220700",
                "sub": [

                    {
                        "id": 0,
                        "name": "宁江区",
                        "aid": "220702"
                    },

                    {
                        "id": 1,
                        "name": "前郭尔罗斯蒙古族自治县",
                        "aid": "220721"
                    },

                    {
                        "id": 2,
                        "name": "长岭县",
                        "aid": "220722"
                    },

                    {
                        "id": 3,
                        "name": "乾安县",
                        "aid": "220723"
                    },

                    {
                        "id": 4,
                        "name": "扶余市",
                        "aid": "220781"
                    },

                ]
            },

            {
                "id": 7,
                "name": "白城市",
                "aid": "220800",
                "sub": [

                    {
                        "id": 0,
                        "name": "洮北区",
                        "aid": "220802"
                    },

                    {
                        "id": 2,
                        "name": "通榆县",
                        "aid": "220822"
                    },

                    {
                        "id": 1,
                        "name": "镇赉县",
                        "aid": "220821"
                    },

                    {
                        "id": 3,
                        "name": "洮南市",
                        "aid": "220881"
                    },

                    {
                        "id": 4,
                        "name": "大安市",
                        "aid": "220882"
                    },

                ]
            },

            {
                "id": 8,
                "name": "延边朝鲜族自治州",
                "aid": "222400",
                "sub": [

                    {
                        "id": 0,
                        "name": "延吉市",
                        "aid": "222401"
                    },

                    {
                        "id": 1,
                        "name": "图们市",
                        "aid": "222402"
                    },

                    {
                        "id": 2,
                        "name": "敦化市",
                        "aid": "222403"
                    },

                    {
                        "id": 3,
                        "name": "珲春市",
                        "aid": "222404"
                    },

                    {
                        "id": 4,
                        "name": "龙井市",
                        "aid": "222405"
                    },

                    {
                        "id": 5,
                        "name": "和龙市",
                        "aid": "222406"
                    },

                    {
                        "id": 6,
                        "name": "汪清县",
                        "aid": "222424"
                    },

                    {
                        "id": 7,
                        "name": "安图县",
                        "aid": "222426"
                    },

                ]
            },

        ]
    },

    {
        "id": 7,
        "name": "黑龙江省",
        "aid": "230000",
        "sub": [

            {
                "id": 0,
                "name": "哈尔滨市",
                "aid": "230100",
                "sub": [

                    {
                        "id": 0,
                        "name": "道里区",
                        "aid": "230102"
                    },

                    {
                        "id": 1,
                        "name": "南岗区",
                        "aid": "230103"
                    },

                    {
                        "id": 2,
                        "name": "道外区",
                        "aid": "230104"
                    },

                    {
                        "id": 3,
                        "name": "平房区",
                        "aid": "230108"
                    },

                    {
                        "id": 4,
                        "name": "松北区",
                        "aid": "230109"
                    },

                    {
                        "id": 5,
                        "name": "香坊区",
                        "aid": "230110"
                    },

                    {
                        "id": 6,
                        "name": "呼兰区",
                        "aid": "230111"
                    },

                    {
                        "id": 7,
                        "name": "阿城区",
                        "aid": "230112"
                    },

                    {
                        "id": 8,
                        "name": "双城区",
                        "aid": "230113"
                    },

                    {
                        "id": 9,
                        "name": "依兰县",
                        "aid": "230123"
                    },

                    {
                        "id": 10,
                        "name": "方正县",
                        "aid": "230124"
                    },

                    {
                        "id": 11,
                        "name": "宾县",
                        "aid": "230125"
                    },

                    {
                        "id": 12,
                        "name": "巴彦县",
                        "aid": "230126"
                    },

                    {
                        "id": 13,
                        "name": "木兰县",
                        "aid": "230127"
                    },

                    {
                        "id": 14,
                        "name": "通河县",
                        "aid": "230128"
                    },

                    {
                        "id": 15,
                        "name": "延寿县",
                        "aid": "230129"
                    },

                    {
                        "id": 16,
                        "name": "尚志市",
                        "aid": "230183"
                    },

                    {
                        "id": 17,
                        "name": "五常市",
                        "aid": "230184"
                    },

                    {
                        "id": 18,
                        "name": "哈尔滨新区",
                        "aid": "230185"
                    },

                    {
                        "id": 19,
                        "name": "高新区",
                        "aid": "230186"
                    },

                ]
            },

            {
                "id": 1,
                "name": "齐齐哈尔市",
                "aid": "230200",
                "sub": [

                    {
                        "id": 0,
                        "name": "龙沙区",
                        "aid": "230202"
                    },

                    {
                        "id": 1,
                        "name": "建华区",
                        "aid": "230203"
                    },

                    {
                        "id": 2,
                        "name": "铁锋区",
                        "aid": "230204"
                    },

                    {
                        "id": 3,
                        "name": "昂昂溪区",
                        "aid": "230205"
                    },

                    {
                        "id": 4,
                        "name": "富拉尔基区",
                        "aid": "230206"
                    },

                    {
                        "id": 5,
                        "name": "碾子山区",
                        "aid": "230207"
                    },

                    {
                        "id": 6,
                        "name": "梅里斯达斡尔族区",
                        "aid": "230208"
                    },

                    {
                        "id": 7,
                        "name": "龙江县",
                        "aid": "230221"
                    },

                    {
                        "id": 8,
                        "name": "依安县",
                        "aid": "230223"
                    },

                    {
                        "id": 9,
                        "name": "泰来县",
                        "aid": "230224"
                    },

                    {
                        "id": 10,
                        "name": "甘南县",
                        "aid": "230225"
                    },

                    {
                        "id": 11,
                        "name": "富裕县",
                        "aid": "230227"
                    },

                    {
                        "id": 12,
                        "name": "克山县",
                        "aid": "230229"
                    },

                    {
                        "id": 13,
                        "name": "克东县",
                        "aid": "230230"
                    },

                    {
                        "id": 14,
                        "name": "拜泉县",
                        "aid": "230231"
                    },

                    {
                        "id": 15,
                        "name": "讷河市",
                        "aid": "230281"
                    },

                    {
                        "id": 16,
                        "name": "高新区",
                        "aid": "230282"
                    },

                ]
            },

            {
                "id": 2,
                "name": "鸡西市",
                "aid": "230300",
                "sub": [

                    {
                        "id": 0,
                        "name": "鸡冠区",
                        "aid": "230302"
                    },

                    {
                        "id": 1,
                        "name": "恒山区",
                        "aid": "230303"
                    },

                    {
                        "id": 2,
                        "name": "滴道区",
                        "aid": "230304"
                    },

                    {
                        "id": 3,
                        "name": "梨树区",
                        "aid": "230305"
                    },

                    {
                        "id": 4,
                        "name": "城子河区",
                        "aid": "230306"
                    },

                    {
                        "id": 5,
                        "name": "麻山区",
                        "aid": "230307"
                    },

                    {
                        "id": 6,
                        "name": "鸡东县",
                        "aid": "230321"
                    },

                    {
                        "id": 7,
                        "name": "虎林市",
                        "aid": "230381"
                    },

                    {
                        "id": 8,
                        "name": "密山市",
                        "aid": "230382"
                    },

                ]
            },

            {
                "id": 3,
                "name": "鹤岗市",
                "aid": "230400",
                "sub": [

                    {
                        "id": 0,
                        "name": "向阳区",
                        "aid": "230402"
                    },

                    {
                        "id": 1,
                        "name": "工农区",
                        "aid": "230403"
                    },

                    {
                        "id": 2,
                        "name": "南山区",
                        "aid": "230404"
                    },

                    {
                        "id": 3,
                        "name": "兴安区",
                        "aid": "230405"
                    },

                    {
                        "id": 4,
                        "name": "东山区",
                        "aid": "230406"
                    },

                    {
                        "id": 5,
                        "name": "兴山区",
                        "aid": "230407"
                    },

                    {
                        "id": 6,
                        "name": "萝北县",
                        "aid": "230421"
                    },

                    {
                        "id": 7,
                        "name": "绥滨县",
                        "aid": "230422"
                    },

                ]
            },

            {
                "id": 4,
                "name": "双鸭山市",
                "aid": "230500",
                "sub": [

                    {
                        "id": 0,
                        "name": "尖山区",
                        "aid": "230502"
                    },

                    {
                        "id": 1,
                        "name": "岭东区",
                        "aid": "230503"
                    },

                    {
                        "id": 2,
                        "name": "四方台区",
                        "aid": "230505"
                    },

                    {
                        "id": 3,
                        "name": "宝山区",
                        "aid": "230506"
                    },

                    {
                        "id": 4,
                        "name": "集贤县",
                        "aid": "230521"
                    },

                    {
                        "id": 5,
                        "name": "友谊县",
                        "aid": "230522"
                    },

                    {
                        "id": 6,
                        "name": "宝清县",
                        "aid": "230523"
                    },

                    {
                        "id": 7,
                        "name": "饶河县",
                        "aid": "230524"
                    },

                ]
            },

            {
                "id": 5,
                "name": "大庆市",
                "aid": "230600",
                "sub": [

                    {
                        "id": 0,
                        "name": "萨尔图区",
                        "aid": "230602"
                    },

                    {
                        "id": 1,
                        "name": "龙凤区",
                        "aid": "230603"
                    },

                    {
                        "id": 2,
                        "name": "让胡路区",
                        "aid": "230604"
                    },

                    {
                        "id": 3,
                        "name": "红岗区",
                        "aid": "230605"
                    },

                    {
                        "id": 4,
                        "name": "大同区",
                        "aid": "230606"
                    },

                    {
                        "id": 5,
                        "name": "肇州县",
                        "aid": "230621"
                    },

                    {
                        "id": 6,
                        "name": "肇源县",
                        "aid": "230622"
                    },

                    {
                        "id": 7,
                        "name": "林甸县",
                        "aid": "230623"
                    },

                    {
                        "id": 8,
                        "name": "杜尔伯特蒙古族自治县",
                        "aid": "230624"
                    },

                    {
                        "id": 9,
                        "name": "高新区",
                        "aid": "230625"
                    },

                ]
            },

            {
                "id": 6,
                "name": "伊春市",
                "aid": "230700",
                "sub": [

                    {
                        "id": 0,
                        "name": "伊春区",
                        "aid": "230702"
                    },

                    {
                        "id": 1,
                        "name": "南岔区",
                        "aid": "230703"
                    },

                    {
                        "id": 2,
                        "name": "友好区",
                        "aid": "230704"
                    },

                    {
                        "id": 3,
                        "name": "西林区",
                        "aid": "230705"
                    },

                    {
                        "id": 4,
                        "name": "翠峦区",
                        "aid": "230706"
                    },

                    {
                        "id": 5,
                        "name": "新青区",
                        "aid": "230707"
                    },

                    {
                        "id": 6,
                        "name": "美溪区",
                        "aid": "230708"
                    },

                    {
                        "id": 7,
                        "name": "金山屯区",
                        "aid": "230709"
                    },

                    {
                        "id": 8,
                        "name": "五营区",
                        "aid": "230710"
                    },

                    {
                        "id": 9,
                        "name": "乌马河区",
                        "aid": "230711"
                    },

                    {
                        "id": 10,
                        "name": "汤旺河区",
                        "aid": "230712"
                    },

                    {
                        "id": 11,
                        "name": "带岭区",
                        "aid": "230713"
                    },

                    {
                        "id": 12,
                        "name": "乌伊岭区",
                        "aid": "230714"
                    },

                    {
                        "id": 13,
                        "name": "红星区",
                        "aid": "230715"
                    },

                    {
                        "id": 14,
                        "name": "上甘岭区",
                        "aid": "230716"
                    },

                    {
                        "id": 15,
                        "name": "嘉荫县",
                        "aid": "230722"
                    },

                    {
                        "id": 16,
                        "name": "铁力市",
                        "aid": "230781"
                    },

                ]
            },

            {
                "id": 7,
                "name": "佳木斯市",
                "aid": "230800",
                "sub": [

                    {
                        "id": 0,
                        "name": "向阳区",
                        "aid": "230803"
                    },

                    {
                        "id": 1,
                        "name": "前进区",
                        "aid": "230804"
                    },

                    {
                        "id": 2,
                        "name": "东风区",
                        "aid": "230805"
                    },

                    {
                        "id": 3,
                        "name": "郊区",
                        "aid": "230811"
                    },

                    {
                        "id": 4,
                        "name": "桦南县",
                        "aid": "230822"
                    },

                    {
                        "id": 5,
                        "name": "桦川县",
                        "aid": "230826"
                    },

                    {
                        "id": 6,
                        "name": "汤原县",
                        "aid": "230828"
                    },

                    {
                        "id": 7,
                        "name": "同江市",
                        "aid": "230881"
                    },

                    {
                        "id": 8,
                        "name": "富锦市",
                        "aid": "230882"
                    },

                    {
                        "id": 9,
                        "name": "抚远市",
                        "aid": "230883"
                    },

                ]
            },

            {
                "id": 8,
                "name": "七台河市",
                "aid": "230900",
                "sub": [

                    {
                        "id": 0,
                        "name": "新兴区",
                        "aid": "230902"
                    },

                    {
                        "id": 1,
                        "name": "桃山区",
                        "aid": "230903"
                    },

                    {
                        "id": 2,
                        "name": "茄子河区",
                        "aid": "230904"
                    },

                    {
                        "id": 3,
                        "name": "勃利县",
                        "aid": "230921"
                    },

                ]
            },

            {
                "id": 9,
                "name": "牡丹江市",
                "aid": "231000",
                "sub": [

                    {
                        "id": 0,
                        "name": "东安区",
                        "aid": "231002"
                    },

                    {
                        "id": 1,
                        "name": "阳明区",
                        "aid": "231003"
                    },

                    {
                        "id": 2,
                        "name": "爱民区",
                        "aid": "231004"
                    },

                    {
                        "id": 3,
                        "name": "西安区",
                        "aid": "231005"
                    },

                    {
                        "id": 4,
                        "name": "林口县",
                        "aid": "231025"
                    },

                    {
                        "id": 5,
                        "name": "绥芬河市",
                        "aid": "231081"
                    },

                    {
                        "id": 6,
                        "name": "海林市",
                        "aid": "231083"
                    },

                    {
                        "id": 7,
                        "name": "宁安市",
                        "aid": "231084"
                    },

                    {
                        "id": 8,
                        "name": "穆棱市",
                        "aid": "231085"
                    },

                    {
                        "id": 9,
                        "name": "东宁市",
                        "aid": "231086"
                    },

                ]
            },

            {
                "id": 10,
                "name": "黑河市",
                "aid": "231100",
                "sub": [

                    {
                        "id": 0,
                        "name": "爱辉区",
                        "aid": "231102"
                    },

                    {
                        "id": 1,
                        "name": "嫩江县",
                        "aid": "231121"
                    },

                    {
                        "id": 2,
                        "name": "逊克县",
                        "aid": "231123"
                    },

                    {
                        "id": 3,
                        "name": "孙吴县",
                        "aid": "231124"
                    },

                    {
                        "id": 4,
                        "name": "北安市",
                        "aid": "231181"
                    },

                    {
                        "id": 5,
                        "name": "五大连池市",
                        "aid": "231182"
                    },

                ]
            },

            {
                "id": 11,
                "name": "绥化市",
                "aid": "231200",
                "sub": [

                    {
                        "id": 0,
                        "name": "北林区",
                        "aid": "231202"
                    },

                    {
                        "id": 1,
                        "name": "望奎县",
                        "aid": "231221"
                    },

                    {
                        "id": 2,
                        "name": "兰西县",
                        "aid": "231222"
                    },

                    {
                        "id": 3,
                        "name": "青冈县",
                        "aid": "231223"
                    },

                    {
                        "id": 4,
                        "name": "庆安县",
                        "aid": "231224"
                    },

                    {
                        "id": 5,
                        "name": "明水县",
                        "aid": "231225"
                    },

                    {
                        "id": 6,
                        "name": "绥棱县",
                        "aid": "231226"
                    },

                    {
                        "id": 7,
                        "name": "安达市",
                        "aid": "231281"
                    },

                    {
                        "id": 8,
                        "name": "肇东市",
                        "aid": "231282"
                    },

                    {
                        "id": 9,
                        "name": "海伦市",
                        "aid": "231283"
                    },

                ]
            },

            {
                "id": 12,
                "name": "大兴安岭地区",
                "aid": "232700",
                "sub": [

                    {
                        "id": 0,
                        "name": "加格达奇区",
                        "aid": "232701"
                    },

                    {
                        "id": 1,
                        "name": "新林区",
                        "aid": "232702"
                    },

                    {
                        "id": 2,
                        "name": "松岭区",
                        "aid": "232703"
                    },

                    {
                        "id": 3,
                        "name": "呼中区",
                        "aid": "232704"
                    },

                    {
                        "id": 4,
                        "name": "呼玛县",
                        "aid": "232721"
                    },

                    {
                        "id": 5,
                        "name": "塔河县",
                        "aid": "232722"
                    },

                    {
                        "id": 6,
                        "name": "漠河县",
                        "aid": "232723"
                    },

                ]
            },

        ]
    },

    {
        "id": 8,
        "name": "上海",
        "aid": "310000",
        "sub": [

            {
                "id": 0,
                "name": "上海市",
                "aid": "310100",
                "sub": [

                    {
                        "id": 0,
                        "name": "黄浦区",
                        "aid": "310101"
                    },

                    {
                        "id": 1,
                        "name": "徐汇区",
                        "aid": "310104"
                    },

                    {
                        "id": 2,
                        "name": "长宁区",
                        "aid": "310105"
                    },

                    {
                        "id": 3,
                        "name": "静安区",
                        "aid": "310106"
                    },

                    {
                        "id": 4,
                        "name": "普陀区",
                        "aid": "310107"
                    },

                    {
                        "id": 5,
                        "name": "虹口区",
                        "aid": "310109"
                    },

                    {
                        "id": 6,
                        "name": "杨浦区",
                        "aid": "310110"
                    },

                    {
                        "id": 7,
                        "name": "闵行区",
                        "aid": "310112"
                    },

                    {
                        "id": 8,
                        "name": "宝山区",
                        "aid": "310113"
                    },

                    {
                        "id": 9,
                        "name": "嘉定区",
                        "aid": "310114"
                    },

                    {
                        "id": 10,
                        "name": "浦东新区",
                        "aid": "310115"
                    },

                    {
                        "id": 11,
                        "name": "金山区",
                        "aid": "310116"
                    },

                    {
                        "id": 12,
                        "name": "松江区",
                        "aid": "310117"
                    },

                    {
                        "id": 13,
                        "name": "青浦区",
                        "aid": "310118"
                    },

                    {
                        "id": 14,
                        "name": "奉贤区",
                        "aid": "310120"
                    },

                    {
                        "id": 15,
                        "name": "崇明区",
                        "aid": "310151"
                    },

                    {
                        "id": 16,
                        "name": "张江高新区",
                        "aid": "310231"
                    },

                    {
                        "id": 17,
                        "name": "紫竹高新区",
                        "aid": "310232"
                    },

                    {
                        "id": 18,
                        "name": "漕河泾开发区",
                        "aid": "310233"
                    },

                ]
            },

        ]
    },

    {
        "id": 9,
        "name": "江苏省",
        "aid": "320000",
        "sub": [

            {
                "id": 0,
                "name": "南京市",
                "aid": "320100",
                "sub": [

                    {
                        "id": 0,
                        "name": "玄武区",
                        "aid": "320102"
                    },

                    {
                        "id": 1,
                        "name": "秦淮区",
                        "aid": "320104"
                    },

                    {
                        "id": 2,
                        "name": "建邺区",
                        "aid": "320105"
                    },

                    {
                        "id": 3,
                        "name": "鼓楼区",
                        "aid": "320106"
                    },

                    {
                        "id": 4,
                        "name": "浦口区",
                        "aid": "320111"
                    },

                    {
                        "id": 5,
                        "name": "栖霞区",
                        "aid": "320113"
                    },

                    {
                        "id": 6,
                        "name": "雨花台区",
                        "aid": "320114"
                    },

                    {
                        "id": 7,
                        "name": "江宁区",
                        "aid": "320115"
                    },

                    {
                        "id": 8,
                        "name": "六合区",
                        "aid": "320116"
                    },

                    {
                        "id": 9,
                        "name": "溧水区",
                        "aid": "320117"
                    },

                    {
                        "id": 10,
                        "name": "高淳区",
                        "aid": "320118"
                    },

                    {
                        "id": 11,
                        "name": "江北新区",
                        "aid": "320119"
                    },

                    {
                        "id": 12,
                        "name": "高新区",
                        "aid": "320120"
                    },

                ]
            },

            {
                "id": 1,
                "name": "无锡市",
                "aid": "320200",
                "sub": [

                    {
                        "id": 0,
                        "name": "锡山区",
                        "aid": "320205"
                    },

                    {
                        "id": 1,
                        "name": "惠山区",
                        "aid": "320206"
                    },

                    {
                        "id": 2,
                        "name": "滨湖区",
                        "aid": "320211"
                    },

                    {
                        "id": 3,
                        "name": "梁溪区",
                        "aid": "320213"
                    },

                    {
                        "id": 4,
                        "name": "新吴区",
                        "aid": "320214"
                    },

                    {
                        "id": 5,
                        "name": "江阴市",
                        "aid": "320281"
                    },

                    {
                        "id": 6,
                        "name": "宜兴市",
                        "aid": "320282"
                    },

                ]
            },

            {
                "id": 2,
                "name": "徐州市",
                "aid": "320300",
                "sub": [

                    {
                        "id": 0,
                        "name": "鼓楼区",
                        "aid": "320302"
                    },

                    {
                        "id": 1,
                        "name": "云龙区",
                        "aid": "320303"
                    },

                    {
                        "id": 2,
                        "name": "贾汪区",
                        "aid": "320305"
                    },

                    {
                        "id": 3,
                        "name": "泉山区",
                        "aid": "320311"
                    },

                    {
                        "id": 4,
                        "name": "铜山区",
                        "aid": "320312"
                    },

                    {
                        "id": 5,
                        "name": "丰县",
                        "aid": "320321"
                    },

                    {
                        "id": 6,
                        "name": "沛县",
                        "aid": "320322"
                    },

                    {
                        "id": 7,
                        "name": "睢宁县",
                        "aid": "320324"
                    },

                    {
                        "id": 8,
                        "name": "新沂市",
                        "aid": "320381"
                    },

                    {
                        "id": 9,
                        "name": "邳州市",
                        "aid": "320382"
                    },

                    {
                        "id": 10,
                        "name": "经济技术开发区",
                        "aid": "320383"
                    },

                    {
                        "id": 11,
                        "name": "高新技术产业开发区",
                        "aid": "320384"
                    },

                    {
                        "id": 12,
                        "name": "软件园",
                        "aid": "320385"
                    },

                ]
            },

            {
                "id": 3,
                "name": "常州市",
                "aid": "320400",
                "sub": [

                    {
                        "id": 0,
                        "name": "天宁区",
                        "aid": "320402"
                    },

                    {
                        "id": 1,
                        "name": "钟楼区",
                        "aid": "320404"
                    },

                    {
                        "id": 2,
                        "name": "新北区",
                        "aid": "320411"
                    },

                    {
                        "id": 3,
                        "name": "武进区",
                        "aid": "320412"
                    },

                    {
                        "id": 4,
                        "name": "金坛区",
                        "aid": "320413"
                    },

                    {
                        "id": 5,
                        "name": "溧阳市",
                        "aid": "320481"
                    },

                    {
                        "id": 6,
                        "name": "高新区",
                        "aid": "320482"
                    },

                ]
            },

            {
                "id": 4,
                "name": "苏州市",
                "aid": "320500",
                "sub": [

                    {
                        "id": 0,
                        "name": "虎丘区",
                        "aid": "320505"
                    },

                    {
                        "id": 1,
                        "name": "吴中区",
                        "aid": "320506"
                    },

                    {
                        "id": 2,
                        "name": "相城区",
                        "aid": "320507"
                    },

                    {
                        "id": 3,
                        "name": "姑苏区",
                        "aid": "320508"
                    },

                    {
                        "id": 4,
                        "name": "吴江区",
                        "aid": "320509"
                    },

                    {
                        "id": 5,
                        "name": "常熟市",
                        "aid": "320581"
                    },

                    {
                        "id": 6,
                        "name": "张家港市",
                        "aid": "320582"
                    },

                    {
                        "id": 7,
                        "name": "昆山市",
                        "aid": "320583"
                    },

                    {
                        "id": 8,
                        "name": "太仓市",
                        "aid": "320585"
                    },

                    {
                        "id": 9,
                        "name": "苏州新区",
                        "aid": "320586"
                    },

                    {
                        "id": 10,
                        "name": "工业园区",
                        "aid": "320587"
                    },

                    {
                        "id": 11,
                        "name": "高新区",
                        "aid": "320588"
                    },

                ]
            },

            {
                "id": 5,
                "name": "南通市",
                "aid": "320600",
                "sub": [

                    {
                        "id": 0,
                        "name": "崇川区",
                        "aid": "320602"
                    },

                    {
                        "id": 1,
                        "name": "港闸区",
                        "aid": "320611"
                    },

                    {
                        "id": 2,
                        "name": "通州区",
                        "aid": "320612"
                    },

                    {
                        "id": 3,
                        "name": "海安县",
                        "aid": "320621"
                    },

                    {
                        "id": 4,
                        "name": "如东县",
                        "aid": "320623"
                    },

                    {
                        "id": 5,
                        "name": "启东市",
                        "aid": "320681"
                    },

                    {
                        "id": 6,
                        "name": "如皋市",
                        "aid": "320682"
                    },

                    {
                        "id": 7,
                        "name": "海门市",
                        "aid": "320684"
                    },

                    {
                        "id": 8,
                        "name": "经济技术开发区",
                        "aid": "320685"
                    },

                ]
            },

            {
                "id": 6,
                "name": "连云港市",
                "aid": "320700",
                "sub": [

                    {
                        "id": 0,
                        "name": "连云区",
                        "aid": "320703"
                    },

                    {
                        "id": 1,
                        "name": "海州区",
                        "aid": "320706"
                    },

                    {
                        "id": 2,
                        "name": "赣榆区",
                        "aid": "320707"
                    },

                    {
                        "id": 3,
                        "name": "东海县",
                        "aid": "320722"
                    },

                    {
                        "id": 4,
                        "name": "灌云县",
                        "aid": "320723"
                    },

                    {
                        "id": 5,
                        "name": "灌南县",
                        "aid": "320724"
                    },

                    {
                        "id": 6,
                        "name": "新海新区",
                        "aid": "320725"
                    },

                    {
                        "id": 7,
                        "name": "连云新城",
                        "aid": "320726"
                    },

                    {
                        "id": 8,
                        "name": "徐圩新区",
                        "aid": "320727"
                    },

                    {
                        "id": 9,
                        "name": "济技术开发区",
                        "aid": "320728"
                    },

                ]
            },

            {
                "id": 7,
                "name": "淮安市",
                "aid": "320800",
                "sub": [

                    {
                        "id": 0,
                        "name": "淮安区",
                        "aid": "320803"
                    },

                    {
                        "id": 1,
                        "name": "淮阴区",
                        "aid": "320804"
                    },

                    {
                        "id": 2,
                        "name": "清江浦区",
                        "aid": "320812"
                    },

                    {
                        "id": 3,
                        "name": "洪泽区",
                        "aid": "320813"
                    },

                    {
                        "id": 4,
                        "name": "涟水县",
                        "aid": "320826"
                    },

                    {
                        "id": 5,
                        "name": "盱眙县",
                        "aid": "320830"
                    },

                    {
                        "id": 6,
                        "name": "金湖县",
                        "aid": "320831"
                    },

                    {
                        "id": 7,
                        "name": "经济开发区",
                        "aid": "320832"
                    },

                ]
            },

            {
                "id": 8,
                "name": "盐城市",
                "aid": "320900",
                "sub": [

                    {
                        "id": 0,
                        "name": "亭湖区",
                        "aid": "320902"
                    },

                    {
                        "id": 1,
                        "name": "盐都区",
                        "aid": "320903"
                    },

                    {
                        "id": 2,
                        "name": "大丰区",
                        "aid": "320904"
                    },

                    {
                        "id": 3,
                        "name": "响水县",
                        "aid": "320921"
                    },

                    {
                        "id": 4,
                        "name": "滨海县",
                        "aid": "320922"
                    },

                    {
                        "id": 5,
                        "name": "阜宁县",
                        "aid": "320923"
                    },

                    {
                        "id": 6,
                        "name": "射阳县",
                        "aid": "320924"
                    },

                    {
                        "id": 7,
                        "name": "建湖县",
                        "aid": "320925"
                    },

                    {
                        "id": 8,
                        "name": "东台市",
                        "aid": "320981"
                    },

                ]
            },

            {
                "id": 9,
                "name": "扬州市",
                "aid": "321000",
                "sub": [

                    {
                        "id": 0,
                        "name": "广陵区",
                        "aid": "321002"
                    },

                    {
                        "id": 1,
                        "name": "邗江区",
                        "aid": "321003"
                    },

                    {
                        "id": 2,
                        "name": "江都区",
                        "aid": "321012"
                    },

                    {
                        "id": 3,
                        "name": "宝应县",
                        "aid": "321023"
                    },

                    {
                        "id": 4,
                        "name": "仪征市",
                        "aid": "321081"
                    },

                    {
                        "id": 5,
                        "name": "高邮市",
                        "aid": "321084"
                    },

                ]
            },

            {
                "id": 10,
                "name": "镇江市",
                "aid": "321100",
                "sub": [

                    {
                        "id": 0,
                        "name": "京口区",
                        "aid": "321102"
                    },

                    {
                        "id": 1,
                        "name": "润州区",
                        "aid": "321111"
                    },

                    {
                        "id": 2,
                        "name": "丹徒区",
                        "aid": "321112"
                    },

                    {
                        "id": 3,
                        "name": "丹阳市",
                        "aid": "321181"
                    },

                    {
                        "id": 4,
                        "name": "扬中市",
                        "aid": "321182"
                    },

                    {
                        "id": 5,
                        "name": "句容市",
                        "aid": "321183"
                    },

                    {
                        "id": 6,
                        "name": "镇江新区",
                        "aid": "321184"
                    },

                    {
                        "id": 7,
                        "name": "镇江新区",
                        "aid": "321185"
                    },

                    {
                        "id": 8,
                        "name": "经济开发区",
                        "aid": "321186"
                    },

                ]
            },

            {
                "id": 11,
                "name": "泰州市",
                "aid": "321200",
                "sub": [

                    {
                        "id": 0,
                        "name": "海陵区",
                        "aid": "321202"
                    },

                    {
                        "id": 1,
                        "name": "高港区",
                        "aid": "321203"
                    },

                    {
                        "id": 2,
                        "name": "姜堰区",
                        "aid": "321204"
                    },

                    {
                        "id": 3,
                        "name": "兴化市",
                        "aid": "321281"
                    },

                    {
                        "id": 4,
                        "name": "靖江市",
                        "aid": "321282"
                    },

                    {
                        "id": 5,
                        "name": "泰兴市",
                        "aid": "321283"
                    },

                ]
            },

            {
                "id": 12,
                "name": "宿迁市",
                "aid": "321300",
                "sub": [

                    {
                        "id": 0,
                        "name": "宿城区",
                        "aid": "321302"
                    },

                    {
                        "id": 1,
                        "name": "宿豫区",
                        "aid": "321311"
                    },

                    {
                        "id": 2,
                        "name": "沭阳县",
                        "aid": "321322"
                    },

                    {
                        "id": 3,
                        "name": "泗阳县",
                        "aid": "321323"
                    },

                    {
                        "id": 4,
                        "name": "泗洪县",
                        "aid": "321324"
                    },

                    {
                        "id": 5,
                        "name": "高新区",
                        "aid": "321325"
                    },

                ]
            },

        ]
    },

    {
        "id": 10,
        "name": "浙江省",
        "aid": "330000",
        "sub": [

            {
                "id": 0,
                "name": "杭州市",
                "aid": "330100",
                "sub": [

                    {
                        "id": 0,
                        "name": "上城区",
                        "aid": "330102"
                    },

                    {
                        "id": 1,
                        "name": "下城区",
                        "aid": "330103"
                    },

                    {
                        "id": 2,
                        "name": "江干区",
                        "aid": "330104"
                    },

                    {
                        "id": 3,
                        "name": "拱墅区",
                        "aid": "330105"
                    },

                    {
                        "id": 4,
                        "name": "西湖区",
                        "aid": "330106"
                    },

                    {
                        "id": 5,
                        "name": "滨江区",
                        "aid": "330108"
                    },

                    {
                        "id": 6,
                        "name": "萧山区",
                        "aid": "330109"
                    },

                    {
                        "id": 7,
                        "name": "余杭区",
                        "aid": "330110"
                    },

                    {
                        "id": 8,
                        "name": "富阳区",
                        "aid": "330111"
                    },

                    {
                        "id": 9,
                        "name": "临安区",
                        "aid": "330112"
                    },

                    {
                        "id": 10,
                        "name": "桐庐县",
                        "aid": "330122"
                    },

                    {
                        "id": 11,
                        "name": "淳安县",
                        "aid": "330127"
                    },

                    {
                        "id": 12,
                        "name": "建德市",
                        "aid": "330182"
                    },

                    {
                        "id": 13,
                        "name": "高新区",
                        "aid": "330186"
                    },

                ]
            },

            {
                "id": 1,
                "name": "宁波市",
                "aid": "330200",
                "sub": [

                    {
                        "id": 0,
                        "name": "海曙区",
                        "aid": "330203"
                    },

                    {
                        "id": 1,
                        "name": "江北区",
                        "aid": "330205"
                    },

                    {
                        "id": 2,
                        "name": "北仑区",
                        "aid": "330206"
                    },

                    {
                        "id": 3,
                        "name": "镇海区",
                        "aid": "330211"
                    },

                    {
                        "id": 4,
                        "name": "鄞州区",
                        "aid": "330212"
                    },

                    {
                        "id": 5,
                        "name": "奉化区",
                        "aid": "330213"
                    },

                    {
                        "id": 6,
                        "name": "象山县",
                        "aid": "330225"
                    },

                    {
                        "id": 7,
                        "name": "宁海县",
                        "aid": "330226"
                    },

                    {
                        "id": 8,
                        "name": "余姚市",
                        "aid": "330281"
                    },

                    {
                        "id": 9,
                        "name": "慈溪市",
                        "aid": "330282"
                    },

                    {
                        "id": 10,
                        "name": "杭州湾新区",
                        "aid": "330284"
                    },

                    {
                        "id": 11,
                        "name": "高新区",
                        "aid": "330285"
                    },

                ]
            },

            {
                "id": 2,
                "name": "温州市",
                "aid": "330300",
                "sub": [

                    {
                        "id": 0,
                        "name": "鹿城区",
                        "aid": "330302"
                    },

                    {
                        "id": 1,
                        "name": "龙湾区",
                        "aid": "330303"
                    },

                    {
                        "id": 2,
                        "name": "瓯海区",
                        "aid": "330304"
                    },

                    {
                        "id": 3,
                        "name": "洞头区",
                        "aid": "330305"
                    },

                    {
                        "id": 4,
                        "name": "永嘉县",
                        "aid": "330324"
                    },

                    {
                        "id": 5,
                        "name": "平阳县",
                        "aid": "330326"
                    },

                    {
                        "id": 6,
                        "name": "苍南县",
                        "aid": "330327"
                    },

                    {
                        "id": 7,
                        "name": "文成县",
                        "aid": "330328"
                    },

                    {
                        "id": 8,
                        "name": "泰顺县",
                        "aid": "330329"
                    },

                    {
                        "id": 9,
                        "name": "瑞安市",
                        "aid": "330381"
                    },

                    {
                        "id": 10,
                        "name": "乐清市",
                        "aid": "330382"
                    },

                ]
            },

            {
                "id": 3,
                "name": "嘉兴市",
                "aid": "330400",
                "sub": [

                    {
                        "id": 0,
                        "name": "南湖区",
                        "aid": "330402"
                    },

                    {
                        "id": 1,
                        "name": "秀洲区",
                        "aid": "330411"
                    },

                    {
                        "id": 2,
                        "name": "嘉善县",
                        "aid": "330421"
                    },

                    {
                        "id": 3,
                        "name": "海盐县",
                        "aid": "330424"
                    },

                    {
                        "id": 4,
                        "name": "海宁市",
                        "aid": "330481"
                    },

                    {
                        "id": 5,
                        "name": "平湖市",
                        "aid": "330482"
                    },

                    {
                        "id": 6,
                        "name": "桐乡市",
                        "aid": "330483"
                    },

                ]
            },

            {
                "id": 4,
                "name": "湖州市",
                "aid": "330500",
                "sub": [

                    {
                        "id": 0,
                        "name": "吴兴区",
                        "aid": "330502"
                    },

                    {
                        "id": 1,
                        "name": "南浔区",
                        "aid": "330503"
                    },

                    {
                        "id": 2,
                        "name": "德清县",
                        "aid": "330521"
                    },

                    {
                        "id": 3,
                        "name": "长兴县",
                        "aid": "330522"
                    },

                    {
                        "id": 4,
                        "name": "安吉县",
                        "aid": "330523"
                    },

                ]
            },

            {
                "id": 5,
                "name": "绍兴市",
                "aid": "330600",
                "sub": [

                    {
                        "id": 0,
                        "name": "越城区",
                        "aid": "330602"
                    },

                    {
                        "id": 1,
                        "name": "柯桥区",
                        "aid": "330603"
                    },

                    {
                        "id": 2,
                        "name": "上虞区",
                        "aid": "330604"
                    },

                    {
                        "id": 3,
                        "name": "新昌县",
                        "aid": "330624"
                    },

                    {
                        "id": 4,
                        "name": "诸暨市",
                        "aid": "330681"
                    },

                    {
                        "id": 5,
                        "name": "嵊州市",
                        "aid": "330683"
                    },

                ]
            },

            {
                "id": 6,
                "name": "金华市",
                "aid": "330700",
                "sub": [

                    {
                        "id": 0,
                        "name": "婺城区",
                        "aid": "330702"
                    },

                    {
                        "id": 1,
                        "name": "金东区",
                        "aid": "330703"
                    },

                    {
                        "id": 2,
                        "name": "武义县",
                        "aid": "330723"
                    },

                    {
                        "id": 3,
                        "name": "浦江县",
                        "aid": "330726"
                    },

                    {
                        "id": 4,
                        "name": "磐安县",
                        "aid": "330727"
                    },

                    {
                        "id": 5,
                        "name": "兰溪市",
                        "aid": "330781"
                    },

                    {
                        "id": 6,
                        "name": "义乌市",
                        "aid": "330782"
                    },

                    {
                        "id": 7,
                        "name": "东阳市",
                        "aid": "330783"
                    },

                    {
                        "id": 8,
                        "name": "永康市",
                        "aid": "330784"
                    },

                ]
            },

            {
                "id": 7,
                "name": "衢州市",
                "aid": "330800",
                "sub": [

                    {
                        "id": 0,
                        "name": "柯城区",
                        "aid": "330802"
                    },

                    {
                        "id": 1,
                        "name": "衢江区",
                        "aid": "330803"
                    },

                    {
                        "id": 2,
                        "name": "常山县",
                        "aid": "330822"
                    },

                    {
                        "id": 3,
                        "name": "开化县",
                        "aid": "330824"
                    },

                    {
                        "id": 4,
                        "name": "龙游县",
                        "aid": "330825"
                    },

                    {
                        "id": 5,
                        "name": "江山市",
                        "aid": "330881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "舟山市",
                "aid": "330900",
                "sub": [

                    {
                        "id": 0,
                        "name": "定海区",
                        "aid": "330902"
                    },

                    {
                        "id": 1,
                        "name": "普陀区",
                        "aid": "330903"
                    },

                    {
                        "id": 2,
                        "name": "岱山县",
                        "aid": "330921"
                    },

                    {
                        "id": 3,
                        "name": "嵊泗县",
                        "aid": "330922"
                    },

                ]
            },

            {
                "id": 9,
                "name": "台州市",
                "aid": "331000",
                "sub": [

                    {
                        "id": 0,
                        "name": "椒江区",
                        "aid": "331002"
                    },

                    {
                        "id": 1,
                        "name": "黄岩区",
                        "aid": "331003"
                    },

                    {
                        "id": 2,
                        "name": "路桥区",
                        "aid": "331004"
                    },

                    {
                        "id": 3,
                        "name": "三门县",
                        "aid": "331022"
                    },

                    {
                        "id": 4,
                        "name": "天台县",
                        "aid": "331023"
                    },

                    {
                        "id": 5,
                        "name": "仙居县",
                        "aid": "331024"
                    },

                    {
                        "id": 6,
                        "name": "温岭市",
                        "aid": "331081"
                    },

                    {
                        "id": 7,
                        "name": "临海市",
                        "aid": "331082"
                    },

                    {
                        "id": 8,
                        "name": "玉环市",
                        "aid": "331083"
                    },

                ]
            },

            {
                "id": 10,
                "name": "丽水市",
                "aid": "331100",
                "sub": [

                    {
                        "id": 0,
                        "name": "莲都区",
                        "aid": "331102"
                    },

                    {
                        "id": 1,
                        "name": "青田县",
                        "aid": "331121"
                    },

                    {
                        "id": 2,
                        "name": "缙云县",
                        "aid": "331122"
                    },

                    {
                        "id": 3,
                        "name": "遂昌县",
                        "aid": "331123"
                    },

                    {
                        "id": 4,
                        "name": "松阳县",
                        "aid": "331124"
                    },

                    {
                        "id": 5,
                        "name": "云和县",
                        "aid": "331125"
                    },

                    {
                        "id": 6,
                        "name": "庆元县",
                        "aid": "331126"
                    },

                    {
                        "id": 7,
                        "name": "景宁畲族自治县",
                        "aid": "331127"
                    },

                    {
                        "id": 8,
                        "name": "龙泉市",
                        "aid": "331181"
                    },

                ]
            },

            {
                "id": 11,
                "name": "舟山群岛新区",
                "aid": "331200",
                "sub": [

                    {
                        "id": 0,
                        "name": "金塘岛",
                        "aid": "331201"
                    },

                    {
                        "id": 1,
                        "name": "六横岛",
                        "aid": "331202"
                    },

                    {
                        "id": 2,
                        "name": "衢山岛",
                        "aid": "331203"
                    },

                    {
                        "id": 3,
                        "name": "舟山本岛西北部",
                        "aid": "331204"
                    },

                    {
                        "id": 4,
                        "name": "岱山岛西南部",
                        "aid": "331205"
                    },

                    {
                        "id": 5,
                        "name": "泗礁岛",
                        "aid": "331206"
                    },

                    {
                        "id": 6,
                        "name": "朱家尖岛",
                        "aid": "331207"
                    },

                    {
                        "id": 7,
                        "name": "洋山岛",
                        "aid": "331208"
                    },

                    {
                        "id": 8,
                        "name": "长涂岛",
                        "aid": "331209"
                    },

                    {
                        "id": 9,
                        "name": "虾峙岛",
                        "aid": "331210"
                    },

                ]
            },

        ]
    },

    {
        "id": 11,
        "name": "安徽省",
        "aid": "340000",
        "sub": [

            {
                "id": 0,
                "name": "合肥市",
                "aid": "340100",
                "sub": [

                    {
                        "id": 0,
                        "name": "瑶海区",
                        "aid": "340102"
                    },

                    {
                        "id": 1,
                        "name": "庐阳区",
                        "aid": "340103"
                    },

                    {
                        "id": 2,
                        "name": "蜀山区",
                        "aid": "340104"
                    },

                    {
                        "id": 3,
                        "name": "包河区",
                        "aid": "340111"
                    },

                    {
                        "id": 4,
                        "name": "长丰县",
                        "aid": "340121"
                    },

                    {
                        "id": 5,
                        "name": "肥东县",
                        "aid": "340122"
                    },

                    {
                        "id": 6,
                        "name": "肥西县",
                        "aid": "340123"
                    },

                    {
                        "id": 7,
                        "name": "庐江县",
                        "aid": "340124"
                    },

                    {
                        "id": 8,
                        "name": "巢湖市",
                        "aid": "340181"
                    },

                    {
                        "id": 9,
                        "name": "经济技术开发区",
                        "aid": "340184"
                    },

                    {
                        "id": 10,
                        "name": "高新技术开发区",
                        "aid": "340185"
                    },

                    {
                        "id": 11,
                        "name": "北城新区",
                        "aid": "340186"
                    },

                    {
                        "id": 12,
                        "name": "滨湖新区",
                        "aid": "340187"
                    },

                    {
                        "id": 13,
                        "name": "政务文化新区",
                        "aid": "340188"
                    },

                    {
                        "id": 14,
                        "name": "新站综合开发试验区",
                        "aid": "340189"
                    },

                ]
            },

            {
                "id": 1,
                "name": "芜湖市",
                "aid": "340200",
                "sub": [

                    {
                        "id": 0,
                        "name": "镜湖区",
                        "aid": "340202"
                    },

                    {
                        "id": 1,
                        "name": "弋江区",
                        "aid": "340203"
                    },

                    {
                        "id": 2,
                        "name": "鸠江区",
                        "aid": "340207"
                    },

                    {
                        "id": 3,
                        "name": "三山区",
                        "aid": "340208"
                    },

                    {
                        "id": 4,
                        "name": "芜湖县",
                        "aid": "340221"
                    },

                    {
                        "id": 5,
                        "name": "繁昌县",
                        "aid": "340222"
                    },

                    {
                        "id": 6,
                        "name": "南陵县",
                        "aid": "340223"
                    },

                    {
                        "id": 7,
                        "name": "无为县",
                        "aid": "340225"
                    },

                    {
                        "id": 8,
                        "name": "经济技术开发区",
                        "aid": "340226"
                    },

                ]
            },

            {
                "id": 2,
                "name": "蚌埠市",
                "aid": "340300",
                "sub": [

                    {
                        "id": 0,
                        "name": "龙子湖区",
                        "aid": "340302"
                    },

                    {
                        "id": 1,
                        "name": "蚌山区",
                        "aid": "340303"
                    },

                    {
                        "id": 2,
                        "name": "禹会区",
                        "aid": "340304"
                    },

                    {
                        "id": 3,
                        "name": "淮上区",
                        "aid": "340311"
                    },

                    {
                        "id": 4,
                        "name": "怀远县",
                        "aid": "340321"
                    },

                    {
                        "id": 5,
                        "name": "五河县",
                        "aid": "340322"
                    },

                    {
                        "id": 6,
                        "name": "固镇县",
                        "aid": "340323"
                    },

                    {
                        "id": 7,
                        "name": "高新区",
                        "aid": "340324"
                    },

                ]
            },

            {
                "id": 3,
                "name": "淮南市",
                "aid": "340400",
                "sub": [

                    {
                        "id": 0,
                        "name": "大通区",
                        "aid": "340402"
                    },

                    {
                        "id": 1,
                        "name": "田家庵区",
                        "aid": "340403"
                    },

                    {
                        "id": 2,
                        "name": "谢家集区",
                        "aid": "340404"
                    },

                    {
                        "id": 3,
                        "name": "八公山区",
                        "aid": "340405"
                    },

                    {
                        "id": 4,
                        "name": "潘集区",
                        "aid": "340406"
                    },

                    {
                        "id": 5,
                        "name": "凤台县",
                        "aid": "340421"
                    },

                    {
                        "id": 6,
                        "name": "寿县",
                        "aid": "340422"
                    },

                    {
                        "id": 7,
                        "name": "山南新区",
                        "aid": "340423"
                    },

                    {
                        "id": 8,
                        "name": "毛集实验区",
                        "aid": "340424"
                    },

                    {
                        "id": 9,
                        "name": "经济开发区",
                        "aid": "340425"
                    },

                ]
            },

            {
                "id": 4,
                "name": "马鞍山市",
                "aid": "340500",
                "sub": [

                    {
                        "id": 0,
                        "name": "花山区",
                        "aid": "340503"
                    },

                    {
                        "id": 1,
                        "name": "雨山区",
                        "aid": "340504"
                    },

                    {
                        "id": 2,
                        "name": "博望区",
                        "aid": "340506"
                    },

                    {
                        "id": 3,
                        "name": "当涂县",
                        "aid": "340521"
                    },

                    {
                        "id": 4,
                        "name": "含山县",
                        "aid": "340522"
                    },

                    {
                        "id": 5,
                        "name": "和县",
                        "aid": "340523"
                    },

                ]
            },

            {
                "id": 5,
                "name": "淮北市",
                "aid": "340600",
                "sub": [

                    {
                        "id": 0,
                        "name": "杜集区",
                        "aid": "340602"
                    },

                    {
                        "id": 1,
                        "name": "相山区",
                        "aid": "340603"
                    },

                    {
                        "id": 2,
                        "name": "烈山区",
                        "aid": "340604"
                    },

                    {
                        "id": 3,
                        "name": "濉溪县",
                        "aid": "340621"
                    },

                ]
            },

            {
                "id": 6,
                "name": "铜陵市",
                "aid": "340700",
                "sub": [

                    {
                        "id": 0,
                        "name": "铜官区",
                        "aid": "340705"
                    },

                    {
                        "id": 1,
                        "name": "义安区",
                        "aid": "340706"
                    },

                    {
                        "id": 2,
                        "name": "郊区",
                        "aid": "340711"
                    },

                    {
                        "id": 3,
                        "name": "枞阳县",
                        "aid": "340722"
                    },

                ]
            },

            {
                "id": 7,
                "name": "安庆市",
                "aid": "340800",
                "sub": [

                    {
                        "id": 0,
                        "name": "迎江区",
                        "aid": "340802"
                    },

                    {
                        "id": 1,
                        "name": "大观区",
                        "aid": "340803"
                    },

                    {
                        "id": 2,
                        "name": "宜秀区",
                        "aid": "340811"
                    },

                    {
                        "id": 3,
                        "name": "怀宁县",
                        "aid": "340822"
                    },

                    {
                        "id": 4,
                        "name": "潜山县",
                        "aid": "340824"
                    },

                    {
                        "id": 5,
                        "name": "太湖县",
                        "aid": "340825"
                    },

                    {
                        "id": 6,
                        "name": "宿松县",
                        "aid": "340826"
                    },

                    {
                        "id": 7,
                        "name": "望江县",
                        "aid": "340827"
                    },

                    {
                        "id": 8,
                        "name": "岳西县",
                        "aid": "340828"
                    },

                    {
                        "id": 9,
                        "name": "桐城市",
                        "aid": "340881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "黄山市",
                "aid": "341000",
                "sub": [

                    {
                        "id": 0,
                        "name": "屯溪区",
                        "aid": "341002"
                    },

                    {
                        "id": 1,
                        "name": "黄山区",
                        "aid": "341003"
                    },

                    {
                        "id": 2,
                        "name": "徽州区",
                        "aid": "341004"
                    },

                    {
                        "id": 3,
                        "name": "歙县",
                        "aid": "341021"
                    },

                    {
                        "id": 4,
                        "name": "休宁县",
                        "aid": "341022"
                    },

                    {
                        "id": 5,
                        "name": "黟县",
                        "aid": "341023"
                    },

                    {
                        "id": 6,
                        "name": "祁门县",
                        "aid": "341024"
                    },

                ]
            },

            {
                "id": 9,
                "name": "滁州市",
                "aid": "341100",
                "sub": [

                    {
                        "id": 0,
                        "name": "琅琊区",
                        "aid": "341102"
                    },

                    {
                        "id": 1,
                        "name": "南谯区",
                        "aid": "341103"
                    },

                    {
                        "id": 2,
                        "name": "来安县",
                        "aid": "341122"
                    },

                    {
                        "id": 3,
                        "name": "全椒县",
                        "aid": "341124"
                    },

                    {
                        "id": 4,
                        "name": "定远县",
                        "aid": "341125"
                    },

                    {
                        "id": 5,
                        "name": "凤阳县",
                        "aid": "341126"
                    },

                    {
                        "id": 6,
                        "name": "天长市",
                        "aid": "341181"
                    },

                    {
                        "id": 7,
                        "name": "明光市",
                        "aid": "341182"
                    },

                ]
            },

            {
                "id": 10,
                "name": "阜阳市",
                "aid": "341200",
                "sub": [

                    {
                        "id": 0,
                        "name": "颍州区",
                        "aid": "341202"
                    },

                    {
                        "id": 1,
                        "name": "颍东区",
                        "aid": "341203"
                    },

                    {
                        "id": 2,
                        "name": "颍泉区",
                        "aid": "341204"
                    },

                    {
                        "id": 3,
                        "name": "临泉县",
                        "aid": "341221"
                    },

                    {
                        "id": 4,
                        "name": "太和县",
                        "aid": "341222"
                    },

                    {
                        "id": 5,
                        "name": "阜南县",
                        "aid": "341225"
                    },

                    {
                        "id": 6,
                        "name": "颍上县",
                        "aid": "341226"
                    },

                    {
                        "id": 7,
                        "name": "界首市",
                        "aid": "341282"
                    },

                    {
                        "id": 8,
                        "name": "经济开发区",
                        "aid": "341283"
                    },

                ]
            },

            {
                "id": 11,
                "name": "宿州市",
                "aid": "341300",
                "sub": [

                    {
                        "id": 0,
                        "name": "埇桥区",
                        "aid": "341302"
                    },

                    {
                        "id": 1,
                        "name": "砀山县",
                        "aid": "341321"
                    },

                    {
                        "id": 2,
                        "name": "萧县",
                        "aid": "341322"
                    },

                    {
                        "id": 3,
                        "name": "灵璧县",
                        "aid": "341323"
                    },

                    {
                        "id": 4,
                        "name": "泗县",
                        "aid": "341324"
                    },

                    {
                        "id": 5,
                        "name": "经济开发区",
                        "aid": "341325"
                    },

                ]
            },

            {
                "id": 12,
                "name": "六安市",
                "aid": "341500",
                "sub": [

                    {
                        "id": 0,
                        "name": "金安区",
                        "aid": "341502"
                    },

                    {
                        "id": 1,
                        "name": "裕安区",
                        "aid": "341503"
                    },

                    {
                        "id": 2,
                        "name": "叶集区",
                        "aid": "341504"
                    },

                    {
                        "id": 3,
                        "name": "霍邱县",
                        "aid": "341522"
                    },

                    {
                        "id": 4,
                        "name": "舒城县",
                        "aid": "341523"
                    },

                    {
                        "id": 5,
                        "name": "金寨县",
                        "aid": "341524"
                    },

                    {
                        "id": 6,
                        "name": "霍山县",
                        "aid": "341525"
                    },

                ]
            },

            {
                "id": 13,
                "name": "亳州市",
                "aid": "341600",
                "sub": [

                    {
                        "id": 0,
                        "name": "谯城区",
                        "aid": "341602"
                    },

                    {
                        "id": 1,
                        "name": "涡阳县",
                        "aid": "341621"
                    },

                    {
                        "id": 2,
                        "name": "蒙城县",
                        "aid": "341622"
                    },

                    {
                        "id": 3,
                        "name": "利辛县",
                        "aid": "341623"
                    },

                ]
            },

            {
                "id": 14,
                "name": "池州市",
                "aid": "341700",
                "sub": [

                    {
                        "id": 0,
                        "name": "贵池区",
                        "aid": "341702"
                    },

                    {
                        "id": 1,
                        "name": "东至县",
                        "aid": "341721"
                    },

                    {
                        "id": 2,
                        "name": "石台县",
                        "aid": "341722"
                    },

                    {
                        "id": 3,
                        "name": "青阳县",
                        "aid": "341723"
                    },

                ]
            },

            {
                "id": 15,
                "name": "宣城市",
                "aid": "341800",
                "sub": [

                    {
                        "id": 0,
                        "name": "宣州区",
                        "aid": "341802"
                    },

                    {
                        "id": 1,
                        "name": "郎溪县",
                        "aid": "341821"
                    },

                    {
                        "id": 2,
                        "name": "广德县",
                        "aid": "341822"
                    },

                    {
                        "id": 3,
                        "name": "泾县",
                        "aid": "341823"
                    },

                    {
                        "id": 4,
                        "name": "绩溪县",
                        "aid": "341824"
                    },

                    {
                        "id": 5,
                        "name": "旌德县",
                        "aid": "341825"
                    },

                    {
                        "id": 6,
                        "name": "宁国市",
                        "aid": "341881"
                    },

                ]
            },

        ]
    },

    {
        "id": 12,
        "name": "福建省",
        "aid": "350000",
        "sub": [

            {
                "id": 0,
                "name": "福州市",
                "aid": "350100",
                "sub": [

                    {
                        "id": 0,
                        "name": "鼓楼区",
                        "aid": "350102"
                    },

                    {
                        "id": 1,
                        "name": "台江区",
                        "aid": "350103"
                    },

                    {
                        "id": 2,
                        "name": "仓山区",
                        "aid": "350104"
                    },

                    {
                        "id": 3,
                        "name": "马尾区",
                        "aid": "350105"
                    },

                    {
                        "id": 4,
                        "name": "晋安区",
                        "aid": "350111"
                    },

                    {
                        "id": 5,
                        "name": "长乐区",
                        "aid": "350112"
                    },

                    {
                        "id": 6,
                        "name": "闽侯县",
                        "aid": "350121"
                    },

                    {
                        "id": 7,
                        "name": "连江县",
                        "aid": "350122"
                    },

                    {
                        "id": 8,
                        "name": "罗源县",
                        "aid": "350123"
                    },

                    {
                        "id": 9,
                        "name": "闽清县",
                        "aid": "350124"
                    },

                    {
                        "id": 10,
                        "name": "永泰县",
                        "aid": "350125"
                    },

                    {
                        "id": 11,
                        "name": "平潭县",
                        "aid": "350128"
                    },

                    {
                        "id": 12,
                        "name": "福清市",
                        "aid": "350181"
                    },

                    {
                        "id": 13,
                        "name": "福州新区",
                        "aid": "350183"
                    },

                ]
            },

            {
                "id": 3,
                "name": "三明市",
                "aid": "350400",
                "sub": [

                    {
                        "id": 0,
                        "name": "梅列区",
                        "aid": "350402"
                    },

                    {
                        "id": 1,
                        "name": "三元区",
                        "aid": "350403"
                    },

                    {
                        "id": 2,
                        "name": "明溪县",
                        "aid": "350421"
                    },

                    {
                        "id": 3,
                        "name": "清流县",
                        "aid": "350423"
                    },

                    {
                        "id": 4,
                        "name": "宁化县",
                        "aid": "350424"
                    },

                    {
                        "id": 5,
                        "name": "大田县",
                        "aid": "350425"
                    },

                    {
                        "id": 6,
                        "name": "尤溪县",
                        "aid": "350426"
                    },

                    {
                        "id": 7,
                        "name": "沙县",
                        "aid": "350427"
                    },

                    {
                        "id": 8,
                        "name": "将乐县",
                        "aid": "350428"
                    },

                    {
                        "id": 9,
                        "name": "泰宁县",
                        "aid": "350429"
                    },

                    {
                        "id": 10,
                        "name": "建宁县",
                        "aid": "350430"
                    },

                    {
                        "id": 11,
                        "name": "永安市",
                        "aid": "350481"
                    },

                ]
            },

            {
                "id": 6,
                "name": "南平市",
                "aid": "350700",
                "sub": [

                    {
                        "id": 0,
                        "name": "延平区",
                        "aid": "350702"
                    },

                    {
                        "id": 1,
                        "name": "建阳区",
                        "aid": "350703"
                    },

                    {
                        "id": 2,
                        "name": "顺昌县",
                        "aid": "350721"
                    },

                    {
                        "id": 3,
                        "name": "浦城县",
                        "aid": "350722"
                    },

                    {
                        "id": 4,
                        "name": "光泽县",
                        "aid": "350723"
                    },

                    {
                        "id": 5,
                        "name": "松溪县",
                        "aid": "350724"
                    },

                    {
                        "id": 6,
                        "name": "政和县",
                        "aid": "350725"
                    },

                    {
                        "id": 7,
                        "name": "邵武市",
                        "aid": "350781"
                    },

                    {
                        "id": 8,
                        "name": "武夷山市",
                        "aid": "350782"
                    },

                    {
                        "id": 9,
                        "name": "建瓯市",
                        "aid": "350783"
                    },

                ]
            },

            {
                "id": 1,
                "name": "厦门市",
                "aid": "350200",
                "sub": [

                    {
                        "id": 0,
                        "name": "思明区",
                        "aid": "350203"
                    },

                    {
                        "id": 1,
                        "name": "海沧区",
                        "aid": "350205"
                    },

                    {
                        "id": 2,
                        "name": "湖里区",
                        "aid": "350206"
                    },

                    {
                        "id": 3,
                        "name": "集美区",
                        "aid": "350211"
                    },

                    {
                        "id": 4,
                        "name": "同安区",
                        "aid": "350212"
                    },

                    {
                        "id": 5,
                        "name": "翔安区",
                        "aid": "350213"
                    },

                ]
            },

            {
                "id": 2,
                "name": "莆田市",
                "aid": "350300",
                "sub": [

                    {
                        "id": 0,
                        "name": "城厢区",
                        "aid": "350302"
                    },

                    {
                        "id": 1,
                        "name": "涵江区",
                        "aid": "350303"
                    },

                    {
                        "id": 2,
                        "name": "荔城区",
                        "aid": "350304"
                    },

                    {
                        "id": 3,
                        "name": "秀屿区",
                        "aid": "350305"
                    },

                    {
                        "id": 4,
                        "name": "仙游县",
                        "aid": "350322"
                    },

                ]
            },

            {
                "id": 4,
                "name": "泉州市",
                "aid": "350500",
                "sub": [

                    {
                        "id": 0,
                        "name": "鲤城区",
                        "aid": "350502"
                    },

                    {
                        "id": 1,
                        "name": "丰泽区",
                        "aid": "350503"
                    },

                    {
                        "id": 2,
                        "name": "洛江区",
                        "aid": "350504"
                    },

                    {
                        "id": 3,
                        "name": "泉港区",
                        "aid": "350505"
                    },

                    {
                        "id": 4,
                        "name": "惠安县",
                        "aid": "350521"
                    },

                    {
                        "id": 5,
                        "name": "安溪县",
                        "aid": "350524"
                    },

                    {
                        "id": 6,
                        "name": "永春县",
                        "aid": "350525"
                    },

                    {
                        "id": 7,
                        "name": "德化县",
                        "aid": "350526"
                    },

                    {
                        "id": 8,
                        "name": "金门县",
                        "aid": "350527"
                    },

                    {
                        "id": 9,
                        "name": "石狮市",
                        "aid": "350581"
                    },

                    {
                        "id": 10,
                        "name": "晋江市",
                        "aid": "350582"
                    },

                    {
                        "id": 11,
                        "name": "南安市",
                        "aid": "350583"
                    },

                    {
                        "id": 12,
                        "name": "台商投资区",
                        "aid": "350584"
                    },

                    {
                        "id": 13,
                        "name": "经济技术开发区",
                        "aid": "350585"
                    },

                    {
                        "id": 14,
                        "name": "高新技术开发区",
                        "aid": "350586"
                    },

                    {
                        "id": 15,
                        "name": "综合保税区",
                        "aid": "350587"
                    },

                ]
            },

            {
                "id": 5,
                "name": "漳州市",
                "aid": "350600",
                "sub": [

                    {
                        "id": 0,
                        "name": "芗城区",
                        "aid": "350602"
                    },

                    {
                        "id": 1,
                        "name": "龙文区",
                        "aid": "350603"
                    },

                    {
                        "id": 2,
                        "name": "云霄县",
                        "aid": "350622"
                    },

                    {
                        "id": 3,
                        "name": "漳浦县",
                        "aid": "350623"
                    },

                    {
                        "id": 4,
                        "name": "诏安县",
                        "aid": "350624"
                    },

                    {
                        "id": 5,
                        "name": "长泰县",
                        "aid": "350625"
                    },

                    {
                        "id": 6,
                        "name": "东山县",
                        "aid": "350626"
                    },

                    {
                        "id": 7,
                        "name": "南靖县",
                        "aid": "350627"
                    },

                    {
                        "id": 8,
                        "name": "平和县",
                        "aid": "350628"
                    },

                    {
                        "id": 9,
                        "name": "华安县",
                        "aid": "350629"
                    },

                    {
                        "id": 10,
                        "name": "龙海市",
                        "aid": "350681"
                    },

                ]
            },

            {
                "id": 7,
                "name": "龙岩市",
                "aid": "350800",
                "sub": [

                    {
                        "id": 0,
                        "name": "新罗区",
                        "aid": "350802"
                    },

                    {
                        "id": 1,
                        "name": "永定区",
                        "aid": "350803"
                    },

                    {
                        "id": 2,
                        "name": "长汀县",
                        "aid": "350821"
                    },

                    {
                        "id": 3,
                        "name": "上杭县",
                        "aid": "350823"
                    },

                    {
                        "id": 4,
                        "name": "武平县",
                        "aid": "350824"
                    },

                    {
                        "id": 5,
                        "name": "连城县",
                        "aid": "350825"
                    },

                    {
                        "id": 6,
                        "name": "漳平市",
                        "aid": "350881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "宁德市",
                "aid": "350900",
                "sub": [

                    {
                        "id": 0,
                        "name": "蕉城区",
                        "aid": "350902"
                    },

                    {
                        "id": 1,
                        "name": "霞浦县",
                        "aid": "350921"
                    },

                    {
                        "id": 2,
                        "name": "古田县",
                        "aid": "350922"
                    },

                    {
                        "id": 3,
                        "name": "屏南县",
                        "aid": "350923"
                    },

                    {
                        "id": 4,
                        "name": "寿宁县",
                        "aid": "350924"
                    },

                    {
                        "id": 5,
                        "name": "周宁县",
                        "aid": "350925"
                    },

                    {
                        "id": 6,
                        "name": "柘荣县",
                        "aid": "350926"
                    },

                    {
                        "id": 7,
                        "name": "福安市",
                        "aid": "350981"
                    },

                    {
                        "id": 8,
                        "name": "福鼎市",
                        "aid": "350982"
                    },

                    {
                        "id": 9,
                        "name": "东侨开发区",
                        "aid": "350983"
                    },

                ]
            },

        ]
    },

    {
        "id": 13,
        "name": "江西省",
        "aid": "360000",
        "sub": [

            {
                "id": 0,
                "name": "赣州市",
                "aid": "360700",
                "sub": [

                    {
                        "id": 0,
                        "name": "章贡区",
                        "aid": "360702"
                    },

                    {
                        "id": 1,
                        "name": "南康区",
                        "aid": "360703"
                    },

                    {
                        "id": 2,
                        "name": "赣县区",
                        "aid": "360704"
                    },

                    {
                        "id": 3,
                        "name": "信丰县",
                        "aid": "360722"
                    },

                    {
                        "id": 4,
                        "name": "大余县",
                        "aid": "360723"
                    },

                    {
                        "id": 5,
                        "name": "上犹县",
                        "aid": "360724"
                    },

                    {
                        "id": 6,
                        "name": "崇义县",
                        "aid": "360725"
                    },

                    {
                        "id": 7,
                        "name": "安远县",
                        "aid": "360726"
                    },

                    {
                        "id": 8,
                        "name": "龙南县",
                        "aid": "360727"
                    },

                    {
                        "id": 9,
                        "name": "定南县",
                        "aid": "360728"
                    },

                    {
                        "id": 10,
                        "name": "全南县",
                        "aid": "360729"
                    },

                    {
                        "id": 11,
                        "name": "宁都县",
                        "aid": "360730"
                    },

                    {
                        "id": 12,
                        "name": "于都县",
                        "aid": "360731"
                    },

                    {
                        "id": 13,
                        "name": "兴国县",
                        "aid": "360732"
                    },

                    {
                        "id": 14,
                        "name": "会昌县",
                        "aid": "360733"
                    },

                    {
                        "id": 15,
                        "name": "寻乌县",
                        "aid": "360734"
                    },

                    {
                        "id": 16,
                        "name": "石城县",
                        "aid": "360735"
                    },

                    {
                        "id": 17,
                        "name": "瑞金市",
                        "aid": "360781"
                    },

                    {
                        "id": 18,
                        "name": "章康新区",
                        "aid": "360782"
                    },

                ]
            },

            {
                "id": 1,
                "name": "南昌市",
                "aid": "360100",
                "sub": [

                    {
                        "id": 0,
                        "name": "东湖区",
                        "aid": "360102"
                    },

                    {
                        "id": 1,
                        "name": "西湖区",
                        "aid": "360103"
                    },

                    {
                        "id": 2,
                        "name": "青云谱区",
                        "aid": "360104"
                    },

                    {
                        "id": 3,
                        "name": "湾里区",
                        "aid": "360105"
                    },

                    {
                        "id": 4,
                        "name": "青山湖区",
                        "aid": "360111"
                    },

                    {
                        "id": 5,
                        "name": "新建区",
                        "aid": "360112"
                    },

                    {
                        "id": 6,
                        "name": "南昌县",
                        "aid": "360121"
                    },

                    {
                        "id": 7,
                        "name": "安义县",
                        "aid": "360123"
                    },

                    {
                        "id": 8,
                        "name": "进贤县",
                        "aid": "360124"
                    },

                    {
                        "id": 9,
                        "name": "红谷滩新区",
                        "aid": "360125"
                    },

                    {
                        "id": 10,
                        "name": "高新区",
                        "aid": "360126"
                    },

                    {
                        "id": 11,
                        "name": "经济开发区",
                        "aid": "360127"
                    },

                    {
                        "id": 12,
                        "name": "小蓝开发区",
                        "aid": "360128"
                    },

                    {
                        "id": 13,
                        "name": "桑海开发区",
                        "aid": "360129"
                    },

                    {
                        "id": 14,
                        "name": "望城新区",
                        "aid": "360130"
                    },

                    {
                        "id": 15,
                        "name": "赣江新区",
                        "aid": "360131"
                    },

                ]
            },

            {
                "id": 2,
                "name": "景德镇市",
                "aid": "360200",
                "sub": [

                    {
                        "id": 0,
                        "name": "昌江区",
                        "aid": "360202"
                    },

                    {
                        "id": 1,
                        "name": "珠山区",
                        "aid": "360203"
                    },

                    {
                        "id": 2,
                        "name": "浮梁县",
                        "aid": "360222"
                    },

                    {
                        "id": 3,
                        "name": "乐平市",
                        "aid": "360281"
                    },

                ]
            },

            {
                "id": 3,
                "name": "萍乡市",
                "aid": "360300",
                "sub": [

                    {
                        "id": 0,
                        "name": "安源区",
                        "aid": "360302"
                    },

                    {
                        "id": 1,
                        "name": "湘东区",
                        "aid": "360313"
                    },

                    {
                        "id": 2,
                        "name": "莲花县",
                        "aid": "360321"
                    },

                    {
                        "id": 3,
                        "name": "上栗县",
                        "aid": "360322"
                    },

                    {
                        "id": 4,
                        "name": "芦溪县",
                        "aid": "360323"
                    },

                ]
            },

            {
                "id": 4,
                "name": "九江市",
                "aid": "360400",
                "sub": [

                    {
                        "id": 0,
                        "name": "濂溪区",
                        "aid": "360402"
                    },

                    {
                        "id": 1,
                        "name": "浔阳区",
                        "aid": "360403"
                    },

                    {
                        "id": 2,
                        "name": "柴桑区",
                        "aid": "360404"
                    },

                    {
                        "id": 3,
                        "name": "武宁县",
                        "aid": "360423"
                    },

                    {
                        "id": 4,
                        "name": "修水县",
                        "aid": "360424"
                    },

                    {
                        "id": 5,
                        "name": "永修县",
                        "aid": "360425"
                    },

                    {
                        "id": 6,
                        "name": "德安县",
                        "aid": "360426"
                    },

                    {
                        "id": 7,
                        "name": "都昌县",
                        "aid": "360428"
                    },

                    {
                        "id": 8,
                        "name": "湖口县",
                        "aid": "360429"
                    },

                    {
                        "id": 9,
                        "name": "彭泽县",
                        "aid": "360430"
                    },

                    {
                        "id": 10,
                        "name": "瑞昌市",
                        "aid": "360481"
                    },

                    {
                        "id": 11,
                        "name": "共青城市",
                        "aid": "360482"
                    },

                    {
                        "id": 12,
                        "name": "庐山市",
                        "aid": "360483"
                    },

                    {
                        "id": 13,
                        "name": "经济技术开发区",
                        "aid": "360484"
                    },

                    {
                        "id": 14,
                        "name": "八里湖新区",
                        "aid": "360485"
                    },

                    {
                        "id": 15,
                        "name": "庐山风景名胜区",
                        "aid": "360486"
                    },

                ]
            },

            {
                "id": 5,
                "name": "新余市",
                "aid": "360500",
                "sub": [

                    {
                        "id": 0,
                        "name": "渝水区",
                        "aid": "360502"
                    },

                    {
                        "id": 1,
                        "name": "分宜县",
                        "aid": "360521"
                    },

                ]
            },

            {
                "id": 6,
                "name": "鹰潭市",
                "aid": "360600",
                "sub": [

                    {
                        "id": 0,
                        "name": "月湖区",
                        "aid": "360602"
                    },

                    {
                        "id": 1,
                        "name": "余江县",
                        "aid": "360622"
                    },

                    {
                        "id": 2,
                        "name": "贵溪市",
                        "aid": "360681"
                    },

                    {
                        "id": 3,
                        "name": "高新区",
                        "aid": "360682"
                    },

                ]
            },

            {
                "id": 7,
                "name": "吉安市",
                "aid": "360800",
                "sub": [

                    {
                        "id": 0,
                        "name": "吉州区",
                        "aid": "360802"
                    },

                    {
                        "id": 1,
                        "name": "青原区",
                        "aid": "360803"
                    },

                    {
                        "id": 2,
                        "name": "吉安县",
                        "aid": "360821"
                    },

                    {
                        "id": 3,
                        "name": "吉水县",
                        "aid": "360822"
                    },

                    {
                        "id": 4,
                        "name": "峡江县",
                        "aid": "360823"
                    },

                    {
                        "id": 5,
                        "name": "新干县",
                        "aid": "360824"
                    },

                    {
                        "id": 6,
                        "name": "永丰县",
                        "aid": "360825"
                    },

                    {
                        "id": 7,
                        "name": "泰和县",
                        "aid": "360826"
                    },

                    {
                        "id": 8,
                        "name": "遂川县",
                        "aid": "360827"
                    },

                    {
                        "id": 9,
                        "name": "万安县",
                        "aid": "360828"
                    },

                    {
                        "id": 10,
                        "name": "安福县",
                        "aid": "360829"
                    },

                    {
                        "id": 11,
                        "name": "永新县",
                        "aid": "360830"
                    },

                    {
                        "id": 12,
                        "name": "井冈山市",
                        "aid": "360881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "宜春市",
                "aid": "360900",
                "sub": [

                    {
                        "id": 0,
                        "name": "袁州区",
                        "aid": "360902"
                    },

                    {
                        "id": 1,
                        "name": "奉新县",
                        "aid": "360921"
                    },

                    {
                        "id": 2,
                        "name": "万载县",
                        "aid": "360922"
                    },

                    {
                        "id": 3,
                        "name": "上高县",
                        "aid": "360923"
                    },

                    {
                        "id": 4,
                        "name": "宜丰县",
                        "aid": "360924"
                    },

                    {
                        "id": 5,
                        "name": "靖安县",
                        "aid": "360925"
                    },

                    {
                        "id": 6,
                        "name": "铜鼓县",
                        "aid": "360926"
                    },

                    {
                        "id": 7,
                        "name": "丰城市",
                        "aid": "360981"
                    },

                    {
                        "id": 8,
                        "name": "樟树市",
                        "aid": "360982"
                    },

                    {
                        "id": 9,
                        "name": "高安市",
                        "aid": "360983"
                    },

                ]
            },

            {
                "id": 9,
                "name": "抚州市",
                "aid": "361000",
                "sub": [

                    {
                        "id": 0,
                        "name": "临川区",
                        "aid": "361002"
                    },

                    {
                        "id": 1,
                        "name": "东乡区",
                        "aid": "361003"
                    },

                    {
                        "id": 2,
                        "name": "南城县",
                        "aid": "361021"
                    },

                    {
                        "id": 3,
                        "name": "黎川县",
                        "aid": "361022"
                    },

                    {
                        "id": 4,
                        "name": "南丰县",
                        "aid": "361023"
                    },

                    {
                        "id": 5,
                        "name": "崇仁县",
                        "aid": "361024"
                    },

                    {
                        "id": 6,
                        "name": "乐安县",
                        "aid": "361025"
                    },

                    {
                        "id": 7,
                        "name": "宜黄县",
                        "aid": "361026"
                    },

                    {
                        "id": 8,
                        "name": "金溪县",
                        "aid": "361027"
                    },

                    {
                        "id": 9,
                        "name": "资溪县",
                        "aid": "361028"
                    },

                    {
                        "id": 10,
                        "name": "广昌县",
                        "aid": "361030"
                    },

                ]
            },

            {
                "id": 10,
                "name": "上饶市",
                "aid": "361100",
                "sub": [

                    {
                        "id": 0,
                        "name": "信州区",
                        "aid": "361102"
                    },

                    {
                        "id": 1,
                        "name": "广丰区",
                        "aid": "361103"
                    },

                    {
                        "id": 2,
                        "name": "上饶县",
                        "aid": "361121"
                    },

                    {
                        "id": 3,
                        "name": "玉山县",
                        "aid": "361123"
                    },

                    {
                        "id": 4,
                        "name": "铅山县",
                        "aid": "361124"
                    },

                    {
                        "id": 5,
                        "name": "横峰县",
                        "aid": "361125"
                    },

                    {
                        "id": 6,
                        "name": "弋阳县",
                        "aid": "361126"
                    },

                    {
                        "id": 7,
                        "name": "余干县",
                        "aid": "361127"
                    },

                    {
                        "id": 8,
                        "name": "鄱阳县",
                        "aid": "361128"
                    },

                    {
                        "id": 9,
                        "name": "万年县",
                        "aid": "361129"
                    },

                    {
                        "id": 10,
                        "name": "婺源县",
                        "aid": "361130"
                    },

                    {
                        "id": 11,
                        "name": "德兴市",
                        "aid": "361181"
                    },

                ]
            },

        ]
    },

    {
        "id": 14,
        "name": "山东省",
        "aid": "370000",
        "sub": [

            {
                "id": 0,
                "name": "潍坊市",
                "aid": "370700",
                "sub": [

                    {
                        "id": 0,
                        "name": "潍城区",
                        "aid": "370702"
                    },

                    {
                        "id": 1,
                        "name": "寒亭区",
                        "aid": "370703"
                    },

                    {
                        "id": 2,
                        "name": "坊子区",
                        "aid": "370704"
                    },

                    {
                        "id": 3,
                        "name": "奎文区",
                        "aid": "370705"
                    },

                    {
                        "id": 4,
                        "name": "临朐县",
                        "aid": "370724"
                    },

                    {
                        "id": 5,
                        "name": "昌乐县",
                        "aid": "370725"
                    },

                    {
                        "id": 6,
                        "name": "青州市",
                        "aid": "370781"
                    },

                    {
                        "id": 7,
                        "name": "诸城市",
                        "aid": "370782"
                    },

                    {
                        "id": 8,
                        "name": "寿光市",
                        "aid": "370783"
                    },

                    {
                        "id": 9,
                        "name": "安丘市",
                        "aid": "370784"
                    },

                    {
                        "id": 10,
                        "name": "高密市",
                        "aid": "370785"
                    },

                    {
                        "id": 11,
                        "name": "昌邑市",
                        "aid": "370786"
                    },

                    {
                        "id": 12,
                        "name": "高新区",
                        "aid": "370787"
                    },

                ]
            },

            {
                "id": 1,
                "name": "济南市",
                "aid": "370100",
                "sub": [

                    {
                        "id": 0,
                        "name": "历下区",
                        "aid": "370102"
                    },

                    {
                        "id": 1,
                        "name": "市中区",
                        "aid": "370103"
                    },

                    {
                        "id": 2,
                        "name": "槐荫区",
                        "aid": "370104"
                    },

                    {
                        "id": 3,
                        "name": "天桥区",
                        "aid": "370105"
                    },

                    {
                        "id": 4,
                        "name": "历城区",
                        "aid": "370112"
                    },

                    {
                        "id": 5,
                        "name": "长清区",
                        "aid": "370113"
                    },

                    {
                        "id": 6,
                        "name": "章丘区",
                        "aid": "370114"
                    },

                    {
                        "id": 7,
                        "name": "平阴县",
                        "aid": "370124"
                    },

                    {
                        "id": 8,
                        "name": "济阳县",
                        "aid": "370125"
                    },

                    {
                        "id": 9,
                        "name": "商河县",
                        "aid": "370126"
                    },

                    {
                        "id": 10,
                        "name": "高新区",
                        "aid": "370182"
                    },

                ]
            },

            {
                "id": 2,
                "name": "青岛市",
                "aid": "370200",
                "sub": [

                    {
                        "id": 0,
                        "name": "市南区",
                        "aid": "370202"
                    },

                    {
                        "id": 1,
                        "name": "市北区",
                        "aid": "370203"
                    },

                    {
                        "id": 2,
                        "name": "黄岛区",
                        "aid": "370211"
                    },

                    {
                        "id": 3,
                        "name": "崂山区",
                        "aid": "370212"
                    },

                    {
                        "id": 4,
                        "name": "李沧区",
                        "aid": "370213"
                    },

                    {
                        "id": 5,
                        "name": "城阳区",
                        "aid": "370214"
                    },

                    {
                        "id": 6,
                        "name": "胶州市",
                        "aid": "370281"
                    },

                    {
                        "id": 7,
                        "name": "即墨区",
                        "aid": "370282"
                    },

                    {
                        "id": 8,
                        "name": "平度市",
                        "aid": "370283"
                    },

                    {
                        "id": 9,
                        "name": "莱西市",
                        "aid": "370285"
                    },

                    {
                        "id": 10,
                        "name": "西海岸新区",
                        "aid": "370286"
                    },

                    {
                        "id": 11,
                        "name": "高新区",
                        "aid": "370287"
                    },

                ]
            },

            {
                "id": 3,
                "name": "淄博市",
                "aid": "370300",
                "sub": [

                    {
                        "id": 0,
                        "name": "淄川区",
                        "aid": "370302"
                    },

                    {
                        "id": 1,
                        "name": "张店区",
                        "aid": "370303"
                    },

                    {
                        "id": 2,
                        "name": "博山区",
                        "aid": "370304"
                    },

                    {
                        "id": 3,
                        "name": "临淄区",
                        "aid": "370305"
                    },

                    {
                        "id": 4,
                        "name": "周村区",
                        "aid": "370306"
                    },

                    {
                        "id": 5,
                        "name": "桓台县",
                        "aid": "370321"
                    },

                    {
                        "id": 6,
                        "name": "高青县",
                        "aid": "370322"
                    },

                    {
                        "id": 7,
                        "name": "沂源县",
                        "aid": "370323"
                    },

                    {
                        "id": 8,
                        "name": "高新区",
                        "aid": "370324"
                    },

                ]
            },

            {
                "id": 4,
                "name": "枣庄市",
                "aid": "370400",
                "sub": [

                    {
                        "id": 0,
                        "name": "市中区",
                        "aid": "370402"
                    },

                    {
                        "id": 1,
                        "name": "薛城区",
                        "aid": "370403"
                    },

                    {
                        "id": 2,
                        "name": "峄城区",
                        "aid": "370404"
                    },

                    {
                        "id": 3,
                        "name": "台儿庄区",
                        "aid": "370405"
                    },

                    {
                        "id": 4,
                        "name": "山亭区",
                        "aid": "370406"
                    },

                    {
                        "id": 5,
                        "name": "滕州市",
                        "aid": "370481"
                    },

                    {
                        "id": 6,
                        "name": "高新区",
                        "aid": "370482"
                    },

                ]
            },

            {
                "id": 5,
                "name": "东营市",
                "aid": "370500",
                "sub": [

                    {
                        "id": 0,
                        "name": "东营区",
                        "aid": "370502"
                    },

                    {
                        "id": 1,
                        "name": "河口区",
                        "aid": "370503"
                    },

                    {
                        "id": 2,
                        "name": "垦利区",
                        "aid": "370505"
                    },

                    {
                        "id": 3,
                        "name": "利津县",
                        "aid": "370522"
                    },

                    {
                        "id": 4,
                        "name": "广饶县",
                        "aid": "370523"
                    },

                ]
            },

            {
                "id": 6,
                "name": "烟台市",
                "aid": "370600",
                "sub": [

                    {
                        "id": 0,
                        "name": "芝罘区",
                        "aid": "370602"
                    },

                    {
                        "id": 1,
                        "name": "福山区",
                        "aid": "370611"
                    },

                    {
                        "id": 2,
                        "name": "牟平区",
                        "aid": "370612"
                    },

                    {
                        "id": 3,
                        "name": "莱山区",
                        "aid": "370613"
                    },

                    {
                        "id": 4,
                        "name": "长岛县",
                        "aid": "370634"
                    },

                    {
                        "id": 5,
                        "name": "龙口市",
                        "aid": "370681"
                    },

                    {
                        "id": 6,
                        "name": "莱阳市",
                        "aid": "370682"
                    },

                    {
                        "id": 7,
                        "name": "莱州市",
                        "aid": "370683"
                    },

                    {
                        "id": 8,
                        "name": "蓬莱市",
                        "aid": "370684"
                    },

                    {
                        "id": 9,
                        "name": "招远市",
                        "aid": "370685"
                    },

                    {
                        "id": 10,
                        "name": "栖霞市",
                        "aid": "370686"
                    },

                    {
                        "id": 11,
                        "name": "海阳市",
                        "aid": "370687"
                    },

                    {
                        "id": 12,
                        "name": "高新区",
                        "aid": "370688"
                    },

                    {
                        "id": 13,
                        "name": "经济开发区",
                        "aid": "370689"
                    },

                ]
            },

            {
                "id": 7,
                "name": "济宁市",
                "aid": "370800",
                "sub": [

                    {
                        "id": 0,
                        "name": "任城区",
                        "aid": "370811"
                    },

                    {
                        "id": 1,
                        "name": "兖州区",
                        "aid": "370812"
                    },

                    {
                        "id": 2,
                        "name": "微山县",
                        "aid": "370826"
                    },

                    {
                        "id": 3,
                        "name": "鱼台县",
                        "aid": "370827"
                    },

                    {
                        "id": 4,
                        "name": "金乡县",
                        "aid": "370828"
                    },

                    {
                        "id": 5,
                        "name": "嘉祥县",
                        "aid": "370829"
                    },

                    {
                        "id": 6,
                        "name": "汶上县",
                        "aid": "370830"
                    },

                    {
                        "id": 7,
                        "name": "泗水县",
                        "aid": "370831"
                    },

                    {
                        "id": 8,
                        "name": "梁山县",
                        "aid": "370832"
                    },

                    {
                        "id": 9,
                        "name": "曲阜市",
                        "aid": "370881"
                    },

                    {
                        "id": 10,
                        "name": "邹城市",
                        "aid": "370883"
                    },

                    {
                        "id": 11,
                        "name": "高新区",
                        "aid": "370884"
                    },

                ]
            },

            {
                "id": 8,
                "name": "泰安市",
                "aid": "370900",
                "sub": [

                    {
                        "id": 0,
                        "name": "泰山区",
                        "aid": "370902"
                    },

                    {
                        "id": 1,
                        "name": "岱岳区",
                        "aid": "370911"
                    },

                    {
                        "id": 2,
                        "name": "宁阳县",
                        "aid": "370921"
                    },

                    {
                        "id": 3,
                        "name": "东平县",
                        "aid": "370923"
                    },

                    {
                        "id": 4,
                        "name": "新泰市",
                        "aid": "370982"
                    },

                    {
                        "id": 5,
                        "name": "肥城市",
                        "aid": "370983"
                    },

                ]
            },

            {
                "id": 9,
                "name": "威海市",
                "aid": "371000",
                "sub": [

                    {
                        "id": 0,
                        "name": "环翠区",
                        "aid": "371002"
                    },

                    {
                        "id": 1,
                        "name": "文登区",
                        "aid": "371003"
                    },

                    {
                        "id": 2,
                        "name": "荣成市",
                        "aid": "371082"
                    },

                    {
                        "id": 3,
                        "name": "乳山市",
                        "aid": "371083"
                    },

                ]
            },

            {
                "id": 10,
                "name": "日照市",
                "aid": "371100",
                "sub": [

                    {
                        "id": 0,
                        "name": "东港区",
                        "aid": "371102"
                    },

                    {
                        "id": 1,
                        "name": "岚山区",
                        "aid": "371103"
                    },

                    {
                        "id": 2,
                        "name": "五莲县",
                        "aid": "371121"
                    },

                    {
                        "id": 3,
                        "name": "莒县",
                        "aid": "371122"
                    },

                ]
            },

            {
                "id": 11,
                "name": "莱芜市",
                "aid": "371200",
                "sub": [

                    {
                        "id": 0,
                        "name": "莱城区",
                        "aid": "371202"
                    },

                    {
                        "id": 1,
                        "name": "钢城区",
                        "aid": "371203"
                    },

                ]
            },

            {
                "id": 12,
                "name": "临沂市",
                "aid": "371300",
                "sub": [

                    {
                        "id": 0,
                        "name": "兰山区",
                        "aid": "371302"
                    },

                    {
                        "id": 1,
                        "name": "罗庄区",
                        "aid": "371311"
                    },

                    {
                        "id": 2,
                        "name": "河东区",
                        "aid": "371312"
                    },

                    {
                        "id": 3,
                        "name": "沂南县",
                        "aid": "371321"
                    },

                    {
                        "id": 4,
                        "name": "郯城县",
                        "aid": "371322"
                    },

                    {
                        "id": 5,
                        "name": "沂水县",
                        "aid": "371323"
                    },

                    {
                        "id": 6,
                        "name": "兰陵县",
                        "aid": "371324"
                    },

                    {
                        "id": 7,
                        "name": "费县",
                        "aid": "371325"
                    },

                    {
                        "id": 8,
                        "name": "平邑县",
                        "aid": "371326"
                    },

                    {
                        "id": 9,
                        "name": "莒南县",
                        "aid": "371327"
                    },

                    {
                        "id": 10,
                        "name": "蒙阴县",
                        "aid": "371328"
                    },

                    {
                        "id": 11,
                        "name": "临沭县",
                        "aid": "371329"
                    },

                ]
            },

            {
                "id": 13,
                "name": "德州市",
                "aid": "371400",
                "sub": [

                    {
                        "id": 0,
                        "name": "德城区",
                        "aid": "371402"
                    },

                    {
                        "id": 1,
                        "name": "陵城区",
                        "aid": "371403"
                    },

                    {
                        "id": 2,
                        "name": "宁津县",
                        "aid": "371422"
                    },

                    {
                        "id": 3,
                        "name": "庆云县",
                        "aid": "371423"
                    },

                    {
                        "id": 4,
                        "name": "临邑县",
                        "aid": "371424"
                    },

                    {
                        "id": 5,
                        "name": "齐河县",
                        "aid": "371425"
                    },

                    {
                        "id": 6,
                        "name": "平原县",
                        "aid": "371426"
                    },

                    {
                        "id": 7,
                        "name": "夏津县",
                        "aid": "371427"
                    },

                    {
                        "id": 8,
                        "name": "武城县",
                        "aid": "371428"
                    },

                    {
                        "id": 9,
                        "name": "乐陵市",
                        "aid": "371481"
                    },

                    {
                        "id": 10,
                        "name": "禹城市",
                        "aid": "371482"
                    },

                ]
            },

            {
                "id": 14,
                "name": "聊城市",
                "aid": "371500",
                "sub": [

                    {
                        "id": 0,
                        "name": "东昌府区",
                        "aid": "371502"
                    },

                    {
                        "id": 1,
                        "name": "阳谷县",
                        "aid": "371521"
                    },

                    {
                        "id": 2,
                        "name": "莘县",
                        "aid": "371522"
                    },

                    {
                        "id": 3,
                        "name": "茌平县",
                        "aid": "371523"
                    },

                    {
                        "id": 4,
                        "name": "东阿县",
                        "aid": "371524"
                    },

                    {
                        "id": 5,
                        "name": "冠县",
                        "aid": "371525"
                    },

                    {
                        "id": 6,
                        "name": "高唐县",
                        "aid": "371526"
                    },

                    {
                        "id": 7,
                        "name": "临清市",
                        "aid": "371581"
                    },

                ]
            },

            {
                "id": 15,
                "name": "滨州市",
                "aid": "371600",
                "sub": [

                    {
                        "id": 0,
                        "name": "滨城区",
                        "aid": "371602"
                    },

                    {
                        "id": 1,
                        "name": "沾化区",
                        "aid": "371603"
                    },

                    {
                        "id": 2,
                        "name": "惠民县",
                        "aid": "371621"
                    },

                    {
                        "id": 3,
                        "name": "阳信县",
                        "aid": "371622"
                    },

                    {
                        "id": 4,
                        "name": "无棣县",
                        "aid": "371623"
                    },

                    {
                        "id": 5,
                        "name": "博兴县",
                        "aid": "371625"
                    },

                    {
                        "id": 6,
                        "name": "邹平县",
                        "aid": "371626"
                    },

                    {
                        "id": 7,
                        "name": "北海新区",
                        "aid": "371627"
                    },

                ]
            },

            {
                "id": 16,
                "name": "菏泽市",
                "aid": "371700",
                "sub": [

                    {
                        "id": 0,
                        "name": "牡丹区",
                        "aid": "371702"
                    },

                    {
                        "id": 1,
                        "name": "定陶区",
                        "aid": "371703"
                    },

                    {
                        "id": 2,
                        "name": "曹县",
                        "aid": "371721"
                    },

                    {
                        "id": 3,
                        "name": "单县",
                        "aid": "371722"
                    },

                    {
                        "id": 4,
                        "name": "成武县",
                        "aid": "371723"
                    },

                    {
                        "id": 5,
                        "name": "巨野县",
                        "aid": "371724"
                    },

                    {
                        "id": 6,
                        "name": "郓城县",
                        "aid": "371725"
                    },

                    {
                        "id": 7,
                        "name": "鄄城县",
                        "aid": "371726"
                    },

                    {
                        "id": 8,
                        "name": "东明县",
                        "aid": "371728"
                    },

                ]
            },

        ]
    },

    {
        "id": 15,
        "name": "河南省",
        "aid": "410000",
        "sub": [

            {
                "id": 0,
                "name": "郑州市",
                "aid": "410100",
                "sub": [

                    {
                        "id": 0,
                        "name": "中原区",
                        "aid": "410102"
                    },

                    {
                        "id": 1,
                        "name": "二七区",
                        "aid": "410103"
                    },

                    {
                        "id": 2,
                        "name": "管城回族区",
                        "aid": "410104"
                    },

                    {
                        "id": 3,
                        "name": "金水区",
                        "aid": "410105"
                    },

                    {
                        "id": 4,
                        "name": "上街区",
                        "aid": "410106"
                    },

                    {
                        "id": 5,
                        "name": "惠济区",
                        "aid": "410108"
                    },

                    {
                        "id": 6,
                        "name": "中牟县",
                        "aid": "410122"
                    },

                    {
                        "id": 7,
                        "name": "巩义市",
                        "aid": "410181"
                    },

                    {
                        "id": 8,
                        "name": "荥阳市",
                        "aid": "410182"
                    },

                    {
                        "id": 9,
                        "name": "新密市",
                        "aid": "410183"
                    },

                    {
                        "id": 10,
                        "name": "新郑市",
                        "aid": "410184"
                    },

                    {
                        "id": 11,
                        "name": "登封市",
                        "aid": "410185"
                    },

                    {
                        "id": 12,
                        "name": "郑东新区",
                        "aid": "410186"
                    },

                    {
                        "id": 13,
                        "name": "郑汴新区",
                        "aid": "410187"
                    },

                    {
                        "id": 14,
                        "name": "高新开发区",
                        "aid": "410188"
                    },

                    {
                        "id": 15,
                        "name": "经济开发区",
                        "aid": "410189"
                    },

                ]
            },

            {
                "id": 1,
                "name": "开封市",
                "aid": "410200",
                "sub": [

                    {
                        "id": 0,
                        "name": "龙亭区",
                        "aid": "410202"
                    },

                    {
                        "id": 1,
                        "name": "顺河回族区",
                        "aid": "410203"
                    },

                    {
                        "id": 2,
                        "name": "鼓楼区",
                        "aid": "410204"
                    },

                    {
                        "id": 3,
                        "name": "禹王台区",
                        "aid": "410205"
                    },

                    {
                        "id": 4,
                        "name": "祥符区",
                        "aid": "410212"
                    },

                    {
                        "id": 5,
                        "name": "杞县",
                        "aid": "410221"
                    },

                    {
                        "id": 6,
                        "name": "通许县",
                        "aid": "410222"
                    },

                    {
                        "id": 7,
                        "name": "尉氏县",
                        "aid": "410223"
                    },

                    {
                        "id": 8,
                        "name": "兰考县",
                        "aid": "410225"
                    },

                    {
                        "id": 9,
                        "name": "经济技术开发区",
                        "aid": "410226"
                    },

                ]
            },

            {
                "id": 2,
                "name": "洛阳市",
                "aid": "410300",
                "sub": [

                    {
                        "id": 0,
                        "name": "老城区",
                        "aid": "410302"
                    },

                    {
                        "id": 1,
                        "name": "西工区",
                        "aid": "410303"
                    },

                    {
                        "id": 2,
                        "name": "瀍河回族区",
                        "aid": "410304"
                    },

                    {
                        "id": 3,
                        "name": "涧西区",
                        "aid": "410305"
                    },

                    {
                        "id": 4,
                        "name": "吉利区",
                        "aid": "410306"
                    },

                    {
                        "id": 5,
                        "name": "洛龙区",
                        "aid": "410311"
                    },

                    {
                        "id": 6,
                        "name": "孟津县",
                        "aid": "410322"
                    },

                    {
                        "id": 7,
                        "name": "新安县",
                        "aid": "410323"
                    },

                    {
                        "id": 8,
                        "name": "栾川县",
                        "aid": "410324"
                    },

                    {
                        "id": 9,
                        "name": "嵩县",
                        "aid": "410325"
                    },

                    {
                        "id": 10,
                        "name": "汝阳县",
                        "aid": "410326"
                    },

                    {
                        "id": 11,
                        "name": "宜阳县",
                        "aid": "410327"
                    },

                    {
                        "id": 12,
                        "name": "洛宁县",
                        "aid": "410328"
                    },

                    {
                        "id": 13,
                        "name": "伊川县",
                        "aid": "410329"
                    },

                    {
                        "id": 14,
                        "name": "偃师市",
                        "aid": "410381"
                    },

                    {
                        "id": 15,
                        "name": "洛阳新区",
                        "aid": "410382"
                    },

                    {
                        "id": 16,
                        "name": "高新区",
                        "aid": "410383"
                    },

                ]
            },

            {
                "id": 3,
                "name": "平顶山市",
                "aid": "410400",
                "sub": [

                    {
                        "id": 0,
                        "name": "新华区",
                        "aid": "410402"
                    },

                    {
                        "id": 1,
                        "name": "卫东区",
                        "aid": "410403"
                    },

                    {
                        "id": 2,
                        "name": "石龙区",
                        "aid": "410404"
                    },

                    {
                        "id": 3,
                        "name": "湛河区",
                        "aid": "410411"
                    },

                    {
                        "id": 4,
                        "name": "宝丰县",
                        "aid": "410421"
                    },

                    {
                        "id": 5,
                        "name": "叶县",
                        "aid": "410422"
                    },

                    {
                        "id": 6,
                        "name": "鲁山县",
                        "aid": "410423"
                    },

                    {
                        "id": 7,
                        "name": "郏县",
                        "aid": "410425"
                    },

                    {
                        "id": 8,
                        "name": "舞钢市",
                        "aid": "410481"
                    },

                    {
                        "id": 9,
                        "name": "汝州市",
                        "aid": "410482"
                    },

                ]
            },

            {
                "id": 4,
                "name": "安阳市",
                "aid": "410500",
                "sub": [

                    {
                        "id": 0,
                        "name": "文峰区",
                        "aid": "410502"
                    },

                    {
                        "id": 1,
                        "name": "北关区",
                        "aid": "410503"
                    },

                    {
                        "id": 2,
                        "name": "殷都区",
                        "aid": "410505"
                    },

                    {
                        "id": 3,
                        "name": "龙安区",
                        "aid": "410506"
                    },

                    {
                        "id": 4,
                        "name": "安阳县",
                        "aid": "410522"
                    },

                    {
                        "id": 5,
                        "name": "汤阴县",
                        "aid": "410523"
                    },

                    {
                        "id": 6,
                        "name": "滑县",
                        "aid": "410526"
                    },

                    {
                        "id": 7,
                        "name": "内黄县",
                        "aid": "410527"
                    },

                    {
                        "id": 8,
                        "name": "林州市",
                        "aid": "410581"
                    },

                    {
                        "id": 9,
                        "name": "安阳新区",
                        "aid": "410582"
                    },

                ]
            },

            {
                "id": 5,
                "name": "鹤壁市",
                "aid": "410600",
                "sub": [

                    {
                        "id": 0,
                        "name": "鹤山区",
                        "aid": "410602"
                    },

                    {
                        "id": 1,
                        "name": "山城区",
                        "aid": "410603"
                    },

                    {
                        "id": 2,
                        "name": "淇滨区",
                        "aid": "410611"
                    },

                    {
                        "id": 3,
                        "name": "浚县",
                        "aid": "410621"
                    },

                    {
                        "id": 4,
                        "name": "淇县",
                        "aid": "410622"
                    },

                ]
            },

            {
                "id": 6,
                "name": "新乡市",
                "aid": "410700",
                "sub": [

                    {
                        "id": 0,
                        "name": "红旗区",
                        "aid": "410702"
                    },

                    {
                        "id": 1,
                        "name": "卫滨区",
                        "aid": "410703"
                    },

                    {
                        "id": 2,
                        "name": "凤泉区",
                        "aid": "410704"
                    },

                    {
                        "id": 3,
                        "name": "牧野区",
                        "aid": "410711"
                    },

                    {
                        "id": 4,
                        "name": "新乡县",
                        "aid": "410721"
                    },

                    {
                        "id": 5,
                        "name": "获嘉县",
                        "aid": "410724"
                    },

                    {
                        "id": 6,
                        "name": "原阳县",
                        "aid": "410725"
                    },

                    {
                        "id": 7,
                        "name": "延津县",
                        "aid": "410726"
                    },

                    {
                        "id": 8,
                        "name": "封丘县",
                        "aid": "410727"
                    },

                    {
                        "id": 9,
                        "name": "长垣县",
                        "aid": "410728"
                    },

                    {
                        "id": 10,
                        "name": "卫辉市",
                        "aid": "410781"
                    },

                    {
                        "id": 11,
                        "name": "辉县市",
                        "aid": "410782"
                    },

                ]
            },

            {
                "id": 7,
                "name": "焦作市",
                "aid": "410800",
                "sub": [

                    {
                        "id": 0,
                        "name": "解放区",
                        "aid": "410802"
                    },

                    {
                        "id": 1,
                        "name": "中站区",
                        "aid": "410803"
                    },

                    {
                        "id": 2,
                        "name": "马村区",
                        "aid": "410804"
                    },

                    {
                        "id": 3,
                        "name": "山阳区",
                        "aid": "410811"
                    },

                    {
                        "id": 4,
                        "name": "修武县",
                        "aid": "410821"
                    },

                    {
                        "id": 5,
                        "name": "博爱县",
                        "aid": "410822"
                    },

                    {
                        "id": 6,
                        "name": "武陟县",
                        "aid": "410823"
                    },

                    {
                        "id": 7,
                        "name": "温县",
                        "aid": "410825"
                    },

                    {
                        "id": 8,
                        "name": "沁阳市",
                        "aid": "410882"
                    },

                    {
                        "id": 9,
                        "name": "孟州市",
                        "aid": "410883"
                    },

                ]
            },

            {
                "id": 8,
                "name": "濮阳市",
                "aid": "410900",
                "sub": [

                    {
                        "id": 0,
                        "name": "华龙区",
                        "aid": "410902"
                    },

                    {
                        "id": 1,
                        "name": "清丰县",
                        "aid": "410922"
                    },

                    {
                        "id": 2,
                        "name": "南乐县",
                        "aid": "410923"
                    },

                    {
                        "id": 3,
                        "name": "范县",
                        "aid": "410926"
                    },

                    {
                        "id": 4,
                        "name": "台前县",
                        "aid": "410927"
                    },

                    {
                        "id": 5,
                        "name": "濮阳县",
                        "aid": "410928"
                    },

                ]
            },

            {
                "id": 9,
                "name": "许昌市",
                "aid": "411000",
                "sub": [

                    {
                        "id": 0,
                        "name": "魏都区",
                        "aid": "411002"
                    },

                    {
                        "id": 1,
                        "name": "建安区",
                        "aid": "411003"
                    },

                    {
                        "id": 2,
                        "name": "鄢陵县",
                        "aid": "411024"
                    },

                    {
                        "id": 3,
                        "name": "襄城县",
                        "aid": "411025"
                    },

                    {
                        "id": 4,
                        "name": "禹州市",
                        "aid": "411081"
                    },

                    {
                        "id": 5,
                        "name": "长葛市",
                        "aid": "411082"
                    },

                ]
            },

            {
                "id": 10,
                "name": "漯河市",
                "aid": "411100",
                "sub": [

                    {
                        "id": 0,
                        "name": "源汇区",
                        "aid": "411102"
                    },

                    {
                        "id": 1,
                        "name": "郾城区",
                        "aid": "411103"
                    },

                    {
                        "id": 2,
                        "name": "召陵区",
                        "aid": "411104"
                    },

                    {
                        "id": 3,
                        "name": "舞阳县",
                        "aid": "411121"
                    },

                    {
                        "id": 4,
                        "name": "临颍县",
                        "aid": "411122"
                    },

                ]
            },

            {
                "id": 11,
                "name": "三门峡市",
                "aid": "411200",
                "sub": [

                    {
                        "id": 0,
                        "name": "湖滨区",
                        "aid": "411202"
                    },

                    {
                        "id": 1,
                        "name": "陕州区",
                        "aid": "411203"
                    },

                    {
                        "id": 2,
                        "name": "渑池县",
                        "aid": "411221"
                    },

                    {
                        "id": 3,
                        "name": "卢氏县",
                        "aid": "411224"
                    },

                    {
                        "id": 4,
                        "name": "义马市",
                        "aid": "411281"
                    },

                    {
                        "id": 5,
                        "name": "灵宝市",
                        "aid": "411282"
                    },

                ]
            },

            {
                "id": 12,
                "name": "南阳市",
                "aid": "411300",
                "sub": [

                    {
                        "id": 0,
                        "name": "宛城区",
                        "aid": "411302"
                    },

                    {
                        "id": 1,
                        "name": "卧龙区",
                        "aid": "411303"
                    },

                    {
                        "id": 2,
                        "name": "南召县",
                        "aid": "411321"
                    },

                    {
                        "id": 3,
                        "name": "方城县",
                        "aid": "411322"
                    },

                    {
                        "id": 4,
                        "name": "西峡县",
                        "aid": "411323"
                    },

                    {
                        "id": 5,
                        "name": "镇平县",
                        "aid": "411324"
                    },

                    {
                        "id": 6,
                        "name": "内乡县",
                        "aid": "411325"
                    },

                    {
                        "id": 7,
                        "name": "淅川县",
                        "aid": "411326"
                    },

                    {
                        "id": 8,
                        "name": "社旗县",
                        "aid": "411327"
                    },

                    {
                        "id": 9,
                        "name": "唐河县",
                        "aid": "411328"
                    },

                    {
                        "id": 10,
                        "name": "新野县",
                        "aid": "411329"
                    },

                    {
                        "id": 11,
                        "name": "桐柏县",
                        "aid": "411330"
                    },

                    {
                        "id": 12,
                        "name": "邓州市",
                        "aid": "411381"
                    },

                ]
            },

            {
                "id": 13,
                "name": "商丘市",
                "aid": "411400",
                "sub": [

                    {
                        "id": 0,
                        "name": "梁园区",
                        "aid": "411402"
                    },

                    {
                        "id": 1,
                        "name": "睢阳区",
                        "aid": "411403"
                    },

                    {
                        "id": 2,
                        "name": "民权县",
                        "aid": "411421"
                    },

                    {
                        "id": 3,
                        "name": "睢县",
                        "aid": "411422"
                    },

                    {
                        "id": 4,
                        "name": "宁陵县",
                        "aid": "411423"
                    },

                    {
                        "id": 5,
                        "name": "柘城县",
                        "aid": "411424"
                    },

                    {
                        "id": 6,
                        "name": "虞城县",
                        "aid": "411425"
                    },

                    {
                        "id": 7,
                        "name": "夏邑县",
                        "aid": "411426"
                    },

                    {
                        "id": 8,
                        "name": "永城市",
                        "aid": "411481"
                    },

                ]
            },

            {
                "id": 14,
                "name": "信阳市",
                "aid": "411500",
                "sub": [

                    {
                        "id": 0,
                        "name": "浉河区",
                        "aid": "411502"
                    },

                    {
                        "id": 1,
                        "name": "平桥区",
                        "aid": "411503"
                    },

                    {
                        "id": 2,
                        "name": "罗山县",
                        "aid": "411521"
                    },

                    {
                        "id": 3,
                        "name": "光山县",
                        "aid": "411522"
                    },

                    {
                        "id": 4,
                        "name": "新县",
                        "aid": "411523"
                    },

                    {
                        "id": 5,
                        "name": "商城县",
                        "aid": "411524"
                    },

                    {
                        "id": 6,
                        "name": "固始县",
                        "aid": "411525"
                    },

                    {
                        "id": 7,
                        "name": "潢川县",
                        "aid": "411526"
                    },

                    {
                        "id": 8,
                        "name": "淮滨县",
                        "aid": "411527"
                    },

                    {
                        "id": 9,
                        "name": "息县",
                        "aid": "411528"
                    },

                ]
            },

            {
                "id": 15,
                "name": "周口市",
                "aid": "411600",
                "sub": [

                    {
                        "id": 0,
                        "name": "川汇区",
                        "aid": "411602"
                    },

                    {
                        "id": 1,
                        "name": "扶沟县",
                        "aid": "411621"
                    },

                    {
                        "id": 2,
                        "name": "西华县",
                        "aid": "411622"
                    },

                    {
                        "id": 3,
                        "name": "商水县",
                        "aid": "411623"
                    },

                    {
                        "id": 4,
                        "name": "沈丘县",
                        "aid": "411624"
                    },

                    {
                        "id": 5,
                        "name": "郸城县",
                        "aid": "411625"
                    },

                    {
                        "id": 6,
                        "name": "淮阳县",
                        "aid": "411626"
                    },

                    {
                        "id": 7,
                        "name": "太康县",
                        "aid": "411627"
                    },

                    {
                        "id": 8,
                        "name": "鹿邑县",
                        "aid": "411628"
                    },

                    {
                        "id": 9,
                        "name": "项城市",
                        "aid": "411681"
                    },

                    {
                        "id": 10,
                        "name": "东新区",
                        "aid": "411682"
                    },

                    {
                        "id": 11,
                        "name": "经济开发区",
                        "aid": "411683"
                    },

                ]
            },

            {
                "id": 16,
                "name": "驻马店市",
                "aid": "411700",
                "sub": [

                    {
                        "id": 0,
                        "name": "驿城区",
                        "aid": "411702"
                    },

                    {
                        "id": 1,
                        "name": "西平县",
                        "aid": "411721"
                    },

                    {
                        "id": 2,
                        "name": "上蔡县",
                        "aid": "411722"
                    },

                    {
                        "id": 3,
                        "name": "平舆县",
                        "aid": "411723"
                    },

                    {
                        "id": 4,
                        "name": "正阳县",
                        "aid": "411724"
                    },

                    {
                        "id": 5,
                        "name": "确山县",
                        "aid": "411725"
                    },

                    {
                        "id": 6,
                        "name": "泌阳县",
                        "aid": "411726"
                    },

                    {
                        "id": 7,
                        "name": "汝南县",
                        "aid": "411727"
                    },

                    {
                        "id": 8,
                        "name": "遂平县",
                        "aid": "411728"
                    },

                    {
                        "id": 9,
                        "name": "新蔡县",
                        "aid": "411729"
                    },

                ]
            },

            {
                "id": 17,
                "name": "济源市",
                "aid": "419001",
                "sub": [

                    {
                        "id": 0,
                        "name": "沁园街道",
                        "aid": "419011"
                    },

                    {
                        "id": 1,
                        "name": "济水街道",
                        "aid": "419012"
                    },

                    {
                        "id": 2,
                        "name": "北海街道",
                        "aid": "419013"
                    },

                    {
                        "id": 3,
                        "name": "天坛街道",
                        "aid": "419014"
                    },

                    {
                        "id": 4,
                        "name": "玉泉街道",
                        "aid": "419015"
                    },

                    {
                        "id": 5,
                        "name": "克井镇",
                        "aid": "419016"
                    },

                    {
                        "id": 6,
                        "name": "五龙口镇",
                        "aid": "419017"
                    },

                    {
                        "id": 7,
                        "name": "梨林镇",
                        "aid": "419018"
                    },

                    {
                        "id": 8,
                        "name": "轵城镇",
                        "aid": "419019"
                    },

                    {
                        "id": 9,
                        "name": "承留镇",
                        "aid": "419020"
                    },

                    {
                        "id": 10,
                        "name": "坡头镇",
                        "aid": "419021"
                    },

                    {
                        "id": 11,
                        "name": "大峪镇",
                        "aid": "419022"
                    },

                    {
                        "id": 12,
                        "name": "邵原镇",
                        "aid": "419023"
                    },

                    {
                        "id": 13,
                        "name": "思礼镇",
                        "aid": "419024"
                    },

                    {
                        "id": 14,
                        "name": "王屋镇",
                        "aid": "419025"
                    },

                    {
                        "id": 15,
                        "name": "下冶镇",
                        "aid": "419026"
                    },

                ]
            },

        ]
    },

    {
        "id": 16,
        "name": "湖北省",
        "aid": "420000",
        "sub": [

            {
                "id": 0,
                "name": "武汉市",
                "aid": "420100",
                "sub": [

                    {
                        "id": 0,
                        "name": "江岸区",
                        "aid": "420102"
                    },

                    {
                        "id": 1,
                        "name": "江汉区",
                        "aid": "420103"
                    },

                    {
                        "id": 2,
                        "name": "硚口区",
                        "aid": "420104"
                    },

                    {
                        "id": 3,
                        "name": "汉阳区",
                        "aid": "420105"
                    },

                    {
                        "id": 4,
                        "name": "武昌区",
                        "aid": "420106"
                    },

                    {
                        "id": 5,
                        "name": "青山区",
                        "aid": "420107"
                    },

                    {
                        "id": 6,
                        "name": "洪山区",
                        "aid": "420111"
                    },

                    {
                        "id": 7,
                        "name": "东西湖区",
                        "aid": "420112"
                    },

                    {
                        "id": 8,
                        "name": "汉南区",
                        "aid": "420113"
                    },

                    {
                        "id": 9,
                        "name": "蔡甸区",
                        "aid": "420114"
                    },

                    {
                        "id": 10,
                        "name": "江夏区",
                        "aid": "420115"
                    },

                    {
                        "id": 11,
                        "name": "黄陂区",
                        "aid": "420116"
                    },

                    {
                        "id": 12,
                        "name": "新洲区",
                        "aid": "420117"
                    },

                    {
                        "id": 13,
                        "name": "经济技术开发区",
                        "aid": "420118"
                    },

                ]
            },

            {
                "id": 1,
                "name": "黄石市",
                "aid": "420200",
                "sub": [

                    {
                        "id": 0,
                        "name": "黄石港区",
                        "aid": "420202"
                    },

                    {
                        "id": 1,
                        "name": "西塞山区",
                        "aid": "420203"
                    },

                    {
                        "id": 2,
                        "name": "下陆区",
                        "aid": "420204"
                    },

                    {
                        "id": 3,
                        "name": "铁山区",
                        "aid": "420205"
                    },

                    {
                        "id": 4,
                        "name": "阳新县",
                        "aid": "420222"
                    },

                    {
                        "id": 5,
                        "name": "大冶市",
                        "aid": "420281"
                    },

                    {
                        "id": 6,
                        "name": "经济开发区",
                        "aid": "420282"
                    },

                ]
            },

            {
                "id": 2,
                "name": "十堰市",
                "aid": "420300",
                "sub": [

                    {
                        "id": 0,
                        "name": "茅箭区",
                        "aid": "420302"
                    },

                    {
                        "id": 1,
                        "name": "张湾区",
                        "aid": "420303"
                    },

                    {
                        "id": 2,
                        "name": "郧阳区",
                        "aid": "420304"
                    },

                    {
                        "id": 3,
                        "name": "郧西县",
                        "aid": "420322"
                    },

                    {
                        "id": 4,
                        "name": "竹山县",
                        "aid": "420323"
                    },

                    {
                        "id": 5,
                        "name": "竹溪县",
                        "aid": "420324"
                    },

                    {
                        "id": 6,
                        "name": "房县",
                        "aid": "420325"
                    },

                    {
                        "id": 7,
                        "name": "丹江口市",
                        "aid": "420381"
                    },

                ]
            },

            {
                "id": 3,
                "name": "宜昌市",
                "aid": "420500",
                "sub": [

                    {
                        "id": 0,
                        "name": "西陵区",
                        "aid": "420502"
                    },

                    {
                        "id": 1,
                        "name": "伍家岗区",
                        "aid": "420503"
                    },

                    {
                        "id": 2,
                        "name": "点军区",
                        "aid": "420504"
                    },

                    {
                        "id": 3,
                        "name": "猇亭区",
                        "aid": "420505"
                    },

                    {
                        "id": 4,
                        "name": "夷陵区",
                        "aid": "420506"
                    },

                    {
                        "id": 5,
                        "name": "远安县",
                        "aid": "420525"
                    },

                    {
                        "id": 6,
                        "name": "兴山县",
                        "aid": "420526"
                    },

                    {
                        "id": 7,
                        "name": "秭归县",
                        "aid": "420527"
                    },

                    {
                        "id": 8,
                        "name": "长阳土家族自治县",
                        "aid": "420528"
                    },

                    {
                        "id": 9,
                        "name": "五峰土家族自治县",
                        "aid": "420529"
                    },

                    {
                        "id": 10,
                        "name": "宜都市",
                        "aid": "420581"
                    },

                    {
                        "id": 11,
                        "name": "当阳市",
                        "aid": "420582"
                    },

                    {
                        "id": 12,
                        "name": "枝江市",
                        "aid": "420583"
                    },

                    {
                        "id": 13,
                        "name": "宜昌新区",
                        "aid": "420584"
                    },

                ]
            },

            {
                "id": 4,
                "name": "襄阳市",
                "aid": "420600",
                "sub": [

                    {
                        "id": 0,
                        "name": "襄城区",
                        "aid": "420602"
                    },

                    {
                        "id": 1,
                        "name": "樊城区",
                        "aid": "420606"
                    },

                    {
                        "id": 2,
                        "name": "襄州区",
                        "aid": "420607"
                    },

                    {
                        "id": 3,
                        "name": "南漳县",
                        "aid": "420624"
                    },

                    {
                        "id": 4,
                        "name": "谷城县",
                        "aid": "420625"
                    },

                    {
                        "id": 5,
                        "name": "保康县",
                        "aid": "420626"
                    },

                    {
                        "id": 6,
                        "name": "老河口市",
                        "aid": "420682"
                    },

                    {
                        "id": 7,
                        "name": "枣阳市",
                        "aid": "420683"
                    },

                    {
                        "id": 8,
                        "name": "宜城市",
                        "aid": "420684"
                    },

                    {
                        "id": 9,
                        "name": "高新区",
                        "aid": "420685"
                    },

                    {
                        "id": 10,
                        "name": "经济开发区",
                        "aid": "420686"
                    },

                ]
            },

            {
                "id": 5,
                "name": "鄂州市",
                "aid": "420700",
                "sub": [

                    {
                        "id": 0,
                        "name": "梁子湖区",
                        "aid": "420702"
                    },

                    {
                        "id": 1,
                        "name": "华容区",
                        "aid": "420703"
                    },

                    {
                        "id": 2,
                        "name": "鄂城区",
                        "aid": "420704"
                    },

                ]
            },

            {
                "id": 6,
                "name": "荆门市",
                "aid": "420800",
                "sub": [

                    {
                        "id": 0,
                        "name": "东宝区",
                        "aid": "420802"
                    },

                    {
                        "id": 1,
                        "name": "掇刀区",
                        "aid": "420804"
                    },

                    {
                        "id": 2,
                        "name": "京山县",
                        "aid": "420821"
                    },

                    {
                        "id": 3,
                        "name": "沙洋县",
                        "aid": "420822"
                    },

                    {
                        "id": 4,
                        "name": "钟祥市",
                        "aid": "420881"
                    },

                ]
            },

            {
                "id": 7,
                "name": "孝感市",
                "aid": "420900",
                "sub": [

                    {
                        "id": 0,
                        "name": "孝南区",
                        "aid": "420902"
                    },

                    {
                        "id": 1,
                        "name": "孝昌县",
                        "aid": "420921"
                    },

                    {
                        "id": 2,
                        "name": "大悟县",
                        "aid": "420922"
                    },

                    {
                        "id": 3,
                        "name": "云梦县",
                        "aid": "420923"
                    },

                    {
                        "id": 4,
                        "name": "应城市",
                        "aid": "420981"
                    },

                    {
                        "id": 5,
                        "name": "安陆市",
                        "aid": "420982"
                    },

                    {
                        "id": 6,
                        "name": "汉川市",
                        "aid": "420984"
                    },

                ]
            },

            {
                "id": 8,
                "name": "荆州市",
                "aid": "421000",
                "sub": [

                    {
                        "id": 0,
                        "name": "沙市区",
                        "aid": "421002"
                    },

                    {
                        "id": 1,
                        "name": "荆州区",
                        "aid": "421003"
                    },

                    {
                        "id": 2,
                        "name": "公安县",
                        "aid": "421022"
                    },

                    {
                        "id": 3,
                        "name": "监利县",
                        "aid": "421023"
                    },

                    {
                        "id": 4,
                        "name": "江陵县",
                        "aid": "421024"
                    },

                    {
                        "id": 5,
                        "name": "石首市",
                        "aid": "421081"
                    },

                    {
                        "id": 6,
                        "name": "洪湖市",
                        "aid": "421083"
                    },

                    {
                        "id": 7,
                        "name": "松滋市",
                        "aid": "421087"
                    },

                ]
            },

            {
                "id": 9,
                "name": "黄冈市",
                "aid": "421100",
                "sub": [

                    {
                        "id": 0,
                        "name": "黄州区",
                        "aid": "421102"
                    },

                    {
                        "id": 1,
                        "name": "团风县",
                        "aid": "421121"
                    },

                    {
                        "id": 2,
                        "name": "红安县",
                        "aid": "421122"
                    },

                    {
                        "id": 3,
                        "name": "罗田县",
                        "aid": "421123"
                    },

                    {
                        "id": 4,
                        "name": "英山县",
                        "aid": "421124"
                    },

                    {
                        "id": 5,
                        "name": "浠水县",
                        "aid": "421125"
                    },

                    {
                        "id": 6,
                        "name": "蕲春县",
                        "aid": "421126"
                    },

                    {
                        "id": 7,
                        "name": "黄梅县",
                        "aid": "421127"
                    },

                    {
                        "id": 8,
                        "name": "麻城市",
                        "aid": "421181"
                    },

                    {
                        "id": 9,
                        "name": "武穴市",
                        "aid": "421182"
                    },

                ]
            },

            {
                "id": 10,
                "name": "咸宁市",
                "aid": "421200",
                "sub": [

                    {
                        "id": 0,
                        "name": "咸安区",
                        "aid": "421202"
                    },

                    {
                        "id": 1,
                        "name": "嘉鱼县",
                        "aid": "421221"
                    },

                    {
                        "id": 2,
                        "name": "通城县",
                        "aid": "421222"
                    },

                    {
                        "id": 3,
                        "name": "崇阳县",
                        "aid": "421223"
                    },

                    {
                        "id": 4,
                        "name": "通山县",
                        "aid": "421224"
                    },

                    {
                        "id": 5,
                        "name": "赤壁市",
                        "aid": "421281"
                    },

                ]
            },

            {
                "id": 11,
                "name": "随州市",
                "aid": "421300",
                "sub": [

                    {
                        "id": 0,
                        "name": "曾都区",
                        "aid": "421303"
                    },

                    {
                        "id": 1,
                        "name": "随县",
                        "aid": "421321"
                    },

                    {
                        "id": 2,
                        "name": "广水市",
                        "aid": "421381"
                    },

                ]
            },

            {
                "id": 12,
                "name": "恩施土家族苗族自治州",
                "aid": "422800",
                "sub": [

                    {
                        "id": 0,
                        "name": "恩施市",
                        "aid": "422801"
                    },

                    {
                        "id": 1,
                        "name": "利川市",
                        "aid": "422802"
                    },

                    {
                        "id": 2,
                        "name": "建始县",
                        "aid": "422822"
                    },

                    {
                        "id": 3,
                        "name": "巴东县",
                        "aid": "422823"
                    },

                    {
                        "id": 4,
                        "name": "宣恩县",
                        "aid": "422825"
                    },

                    {
                        "id": 5,
                        "name": "咸丰县",
                        "aid": "422826"
                    },

                    {
                        "id": 6,
                        "name": "来凤县",
                        "aid": "422827"
                    },

                    {
                        "id": 7,
                        "name": "鹤峰县",
                        "aid": "422828"
                    },

                ]
            },

            {
                "id": 13,
                "name": "仙桃市",
                "aid": "429004",
                "sub": [

                    {
                        "id": 0,
                        "name": "沙嘴街道",
                        "aid": "429401"
                    },

                    {
                        "id": 1,
                        "name": "干河街道",
                        "aid": "429402"
                    },

                    {
                        "id": 2,
                        "name": "龙华山街道",
                        "aid": "429403"
                    },

                    {
                        "id": 3,
                        "name": "郑场镇",
                        "aid": "429404"
                    },

                    {
                        "id": 4,
                        "name": "毛嘴镇",
                        "aid": "429405"
                    },

                    {
                        "id": 5,
                        "name": "豆河镇",
                        "aid": "429406"
                    },

                    {
                        "id": 6,
                        "name": "三伏潭镇",
                        "aid": "429407"
                    },

                    {
                        "id": 7,
                        "name": "胡场镇",
                        "aid": "429408"
                    },

                    {
                        "id": 8,
                        "name": "长埫口镇",
                        "aid": "429409"
                    },

                    {
                        "id": 9,
                        "name": "西流河镇",
                        "aid": "429410"
                    },

                    {
                        "id": 10,
                        "name": "沙湖镇",
                        "aid": "429411"
                    },

                    {
                        "id": 11,
                        "name": "杨林尾镇",
                        "aid": "429412"
                    },

                    {
                        "id": 12,
                        "name": "彭场镇",
                        "aid": "429413"
                    },

                    {
                        "id": 13,
                        "name": "张沟镇",
                        "aid": "429414"
                    },

                    {
                        "id": 14,
                        "name": "郭河镇",
                        "aid": "429415"
                    },

                    {
                        "id": 15,
                        "name": "沔城镇",
                        "aid": "429416"
                    },

                    {
                        "id": 16,
                        "name": "通海口镇",
                        "aid": "429417"
                    },

                    {
                        "id": 17,
                        "name": "陈场镇",
                        "aid": "429418"
                    },

                    {
                        "id": 18,
                        "name": "高新区",
                        "aid": "429419"
                    },

                    {
                        "id": 19,
                        "name": "经济开发区",
                        "aid": "429420"
                    },

                    {
                        "id": 20,
                        "name": "工业园区",
                        "aid": "429421"
                    },

                    {
                        "id": 21,
                        "name": "九合垸原种场",
                        "aid": "429422"
                    },

                    {
                        "id": 22,
                        "name": "沙湖原种场",
                        "aid": "429423"
                    },

                    {
                        "id": 23,
                        "name": "排湖渔场",
                        "aid": "429424"
                    },

                    {
                        "id": 24,
                        "name": "五湖渔场",
                        "aid": "429425"
                    },

                    {
                        "id": 25,
                        "name": "赵西垸林场",
                        "aid": "429426"
                    },

                    {
                        "id": 26,
                        "name": "刘家垸林场",
                        "aid": "429427"
                    },

                    {
                        "id": 27,
                        "name": "畜禽良种场",
                        "aid": "429428"
                    },

                ]
            },

            {
                "id": 14,
                "name": "潜江市",
                "aid": "429005",
                "sub": [

                    {
                        "id": 0,
                        "name": "园林",
                        "aid": "429501"
                    },

                    {
                        "id": 1,
                        "name": "广华",
                        "aid": "429502"
                    },

                    {
                        "id": 2,
                        "name": "杨市",
                        "aid": "429503"
                    },

                    {
                        "id": 3,
                        "name": "周矶",
                        "aid": "429504"
                    },

                    {
                        "id": 4,
                        "name": "泽口",
                        "aid": "429505"
                    },

                    {
                        "id": 5,
                        "name": "泰丰",
                        "aid": "429506"
                    },

                    {
                        "id": 6,
                        "name": "高场",
                        "aid": "429507"
                    },

                    {
                        "id": 7,
                        "name": "熊口镇",
                        "aid": "429508"
                    },

                    {
                        "id": 8,
                        "name": "竹根滩镇",
                        "aid": "429509"
                    },

                    {
                        "id": 9,
                        "name": "高石碑镇",
                        "aid": "429510"
                    },

                    {
                        "id": 10,
                        "name": "老新镇",
                        "aid": "429511"
                    },

                    {
                        "id": 11,
                        "name": "王场镇",
                        "aid": "429512"
                    },

                    {
                        "id": 12,
                        "name": "渔洋镇",
                        "aid": "429513"
                    },

                    {
                        "id": 13,
                        "name": "龙湾镇",
                        "aid": "429514"
                    },

                    {
                        "id": 14,
                        "name": "浩口镇",
                        "aid": "429515"
                    },

                    {
                        "id": 15,
                        "name": "积玉口镇",
                        "aid": "429516"
                    },

                    {
                        "id": 16,
                        "name": "张金镇",
                        "aid": "429517"
                    },

                    {
                        "id": 17,
                        "name": "白鹭湖管理区",
                        "aid": "429518"
                    },

                    {
                        "id": 18,
                        "name": "总口管理区",
                        "aid": "429519"
                    },

                    {
                        "id": 19,
                        "name": "熊口农场管理区",
                        "aid": "429520"
                    },

                    {
                        "id": 20,
                        "name": "运粮湖管理区",
                        "aid": "429521"
                    },

                    {
                        "id": 21,
                        "name": "后湖管理区",
                        "aid": "429522"
                    },

                    {
                        "id": 22,
                        "name": "周矶管理区",
                        "aid": "429523"
                    },

                    {
                        "id": 23,
                        "name": "经济开发区",
                        "aid": "429524"
                    },

                ]
            },

            {
                "id": 15,
                "name": "天门市",
                "aid": "429006",
                "sub": [

                    {
                        "id": 0,
                        "name": "竟陵街道",
                        "aid": "429601"
                    },

                    {
                        "id": 1,
                        "name": "杨林街道",
                        "aid": "429602"
                    },

                    {
                        "id": 2,
                        "name": "佛子山镇",
                        "aid": "429603"
                    },

                    {
                        "id": 3,
                        "name": "多宝镇",
                        "aid": "429604"
                    },

                    {
                        "id": 4,
                        "name": "拖市镇",
                        "aid": "429605"
                    },

                    {
                        "id": 5,
                        "name": "张港镇",
                        "aid": "429606"
                    },

                    {
                        "id": 6,
                        "name": "蒋场镇",
                        "aid": "429607"
                    },

                    {
                        "id": 7,
                        "name": "汪场镇",
                        "aid": "429608"
                    },

                    {
                        "id": 8,
                        "name": "渔薪镇",
                        "aid": "429609"
                    },

                    {
                        "id": 9,
                        "name": "黄潭镇",
                        "aid": "429610"
                    },

                    {
                        "id": 10,
                        "name": "岳口镇",
                        "aid": "429611"
                    },

                    {
                        "id": 11,
                        "name": "横林镇",
                        "aid": "429612"
                    },

                    {
                        "id": 12,
                        "name": "彭市镇",
                        "aid": "429613"
                    },

                    {
                        "id": 13,
                        "name": "麻洋镇",
                        "aid": "429614"
                    },

                    {
                        "id": 14,
                        "name": "多祥镇",
                        "aid": "429615"
                    },

                    {
                        "id": 15,
                        "name": "干驿镇",
                        "aid": "429616"
                    },

                    {
                        "id": 16,
                        "name": "马湾镇",
                        "aid": "429617"
                    },

                    {
                        "id": 17,
                        "name": "卢市镇",
                        "aid": "429618"
                    },

                    {
                        "id": 18,
                        "name": "小板镇",
                        "aid": "429619"
                    },

                    {
                        "id": 19,
                        "name": "九真镇",
                        "aid": "429620"
                    },

                    {
                        "id": 20,
                        "name": "皂市镇",
                        "aid": "429621"
                    },

                    {
                        "id": 21,
                        "name": "胡市镇",
                        "aid": "429622"
                    },

                    {
                        "id": 22,
                        "name": "石河镇",
                        "aid": "429623"
                    },

                    {
                        "id": 23,
                        "name": "净潭乡",
                        "aid": "429624"
                    },

                    {
                        "id": 24,
                        "name": "蒋湖农场",
                        "aid": "429625"
                    },

                    {
                        "id": 25,
                        "name": "白茅湖农场",
                        "aid": "429626"
                    },

                    {
                        "id": 26,
                        "name": "沉湖林业科技示范区",
                        "aid": "429627"
                    },

                    {
                        "id": 27,
                        "name": "天门工业园",
                        "aid": "429628"
                    },

                    {
                        "id": 28,
                        "name": "侨乡街道开发区",
                        "aid": "429629"
                    },

                ]
            },

            {
                "id": 16,
                "name": "神农架林区",
                "aid": "429021",
                "sub": [

                    {
                        "id": 0,
                        "name": "松柏镇",
                        "aid": "429022"
                    },

                    {
                        "id": 1,
                        "name": "阳日镇",
                        "aid": "429023"
                    },

                    {
                        "id": 2,
                        "name": "木鱼镇",
                        "aid": "429024"
                    },

                    {
                        "id": 3,
                        "name": "红坪镇",
                        "aid": "429025"
                    },

                    {
                        "id": 4,
                        "name": "新华镇",
                        "aid": "429026"
                    },

                    {
                        "id": 5,
                        "name": "大九湖",
                        "aid": "429027"
                    },

                    {
                        "id": 6,
                        "name": "宋洛",
                        "aid": "429028"
                    },

                    {
                        "id": 7,
                        "name": "下谷坪乡",
                        "aid": "429029"
                    },

                ]
            },

        ]
    },

    {
        "id": 17,
        "name": "湖南省",
        "aid": "430000",
        "sub": [

            {
                "id": 0,
                "name": "株洲市",
                "aid": "430200",
                "sub": [

                    {
                        "id": 0,
                        "name": "荷塘区",
                        "aid": "430202"
                    },

                    {
                        "id": 1,
                        "name": "芦淞区",
                        "aid": "430203"
                    },

                    {
                        "id": 2,
                        "name": "石峰区",
                        "aid": "430204"
                    },

                    {
                        "id": 3,
                        "name": "天元区",
                        "aid": "430211"
                    },

                    {
                        "id": 4,
                        "name": "株洲县",
                        "aid": "430221"
                    },

                    {
                        "id": 5,
                        "name": "攸县",
                        "aid": "430223"
                    },

                    {
                        "id": 6,
                        "name": "茶陵县",
                        "aid": "430224"
                    },

                    {
                        "id": 7,
                        "name": "炎陵县",
                        "aid": "430225"
                    },

                    {
                        "id": 8,
                        "name": "醴陵市",
                        "aid": "430281"
                    },

                ]
            },

            {
                "id": 1,
                "name": "长沙市",
                "aid": "430100",
                "sub": [

                    {
                        "id": 0,
                        "name": "芙蓉区",
                        "aid": "430102"
                    },

                    {
                        "id": 1,
                        "name": "天心区",
                        "aid": "430103"
                    },

                    {
                        "id": 2,
                        "name": "岳麓区",
                        "aid": "430104"
                    },

                    {
                        "id": 3,
                        "name": "开福区",
                        "aid": "430105"
                    },

                    {
                        "id": 4,
                        "name": "雨花区",
                        "aid": "430111"
                    },

                    {
                        "id": 5,
                        "name": "望城区",
                        "aid": "430112"
                    },

                    {
                        "id": 6,
                        "name": "长沙县",
                        "aid": "430121"
                    },

                    {
                        "id": 7,
                        "name": "宁乡市",
                        "aid": "430124"
                    },

                    {
                        "id": 8,
                        "name": "浏阳市",
                        "aid": "430181"
                    },

                    {
                        "id": 9,
                        "name": "湘江新区",
                        "aid": "430182"
                    },

                ]
            },

            {
                "id": 2,
                "name": "湘潭市",
                "aid": "430300",
                "sub": [

                    {
                        "id": 0,
                        "name": "雨湖区",
                        "aid": "430302"
                    },

                    {
                        "id": 1,
                        "name": "岳塘区",
                        "aid": "430304"
                    },

                    {
                        "id": 2,
                        "name": "湘潭县",
                        "aid": "430321"
                    },

                    {
                        "id": 3,
                        "name": "湘乡市",
                        "aid": "430381"
                    },

                    {
                        "id": 4,
                        "name": "韶山市",
                        "aid": "430382"
                    },

                    {
                        "id": 5,
                        "name": "高新区",
                        "aid": "430383"
                    },

                ]
            },

            {
                "id": 3,
                "name": "衡阳市",
                "aid": "430400",
                "sub": [

                    {
                        "id": 0,
                        "name": "珠晖区",
                        "aid": "430405"
                    },

                    {
                        "id": 1,
                        "name": "雁峰区",
                        "aid": "430406"
                    },

                    {
                        "id": 2,
                        "name": "石鼓区",
                        "aid": "430407"
                    },

                    {
                        "id": 3,
                        "name": "蒸湘区",
                        "aid": "430408"
                    },

                    {
                        "id": 4,
                        "name": "南岳区",
                        "aid": "430412"
                    },

                    {
                        "id": 5,
                        "name": "衡阳县",
                        "aid": "430421"
                    },

                    {
                        "id": 6,
                        "name": "衡南县",
                        "aid": "430422"
                    },

                    {
                        "id": 7,
                        "name": "衡山县",
                        "aid": "430423"
                    },

                    {
                        "id": 8,
                        "name": "衡东县",
                        "aid": "430424"
                    },

                    {
                        "id": 9,
                        "name": "祁东县",
                        "aid": "430426"
                    },

                    {
                        "id": 10,
                        "name": "耒阳市",
                        "aid": "430481"
                    },

                    {
                        "id": 11,
                        "name": "常宁市",
                        "aid": "430482"
                    },

                    {
                        "id": 12,
                        "name": "高新区",
                        "aid": "430483"
                    },

                ]
            },

            {
                "id": 4,
                "name": "邵阳市",
                "aid": "430500",
                "sub": [

                    {
                        "id": 0,
                        "name": "双清区",
                        "aid": "430502"
                    },

                    {
                        "id": 1,
                        "name": "大祥区",
                        "aid": "430503"
                    },

                    {
                        "id": 2,
                        "name": "北塔区",
                        "aid": "430511"
                    },

                    {
                        "id": 3,
                        "name": "邵东县",
                        "aid": "430521"
                    },

                    {
                        "id": 4,
                        "name": "新邵县",
                        "aid": "430522"
                    },

                    {
                        "id": 5,
                        "name": "邵阳县",
                        "aid": "430523"
                    },

                    {
                        "id": 6,
                        "name": "隆回县",
                        "aid": "430524"
                    },

                    {
                        "id": 7,
                        "name": "洞口县",
                        "aid": "430525"
                    },

                    {
                        "id": 8,
                        "name": "绥宁县",
                        "aid": "430527"
                    },

                    {
                        "id": 9,
                        "name": "新宁县",
                        "aid": "430528"
                    },

                    {
                        "id": 10,
                        "name": "城步苗族自治县",
                        "aid": "430529"
                    },

                    {
                        "id": 11,
                        "name": "武冈市",
                        "aid": "430581"
                    },

                ]
            },

            {
                "id": 5,
                "name": "岳阳市",
                "aid": "430600",
                "sub": [

                    {
                        "id": 0,
                        "name": "岳阳楼区",
                        "aid": "430602"
                    },

                    {
                        "id": 1,
                        "name": "云溪区",
                        "aid": "430603"
                    },

                    {
                        "id": 2,
                        "name": "君山区",
                        "aid": "430611"
                    },

                    {
                        "id": 3,
                        "name": "岳阳县",
                        "aid": "430621"
                    },

                    {
                        "id": 4,
                        "name": "华容县",
                        "aid": "430623"
                    },

                    {
                        "id": 5,
                        "name": "湘阴县",
                        "aid": "430624"
                    },

                    {
                        "id": 6,
                        "name": "平江县",
                        "aid": "430626"
                    },

                    {
                        "id": 7,
                        "name": "汨罗市",
                        "aid": "430681"
                    },

                    {
                        "id": 8,
                        "name": "临湘市",
                        "aid": "430682"
                    },

                ]
            },

            {
                "id": 6,
                "name": "常德市",
                "aid": "430700",
                "sub": [

                    {
                        "id": 0,
                        "name": "武陵区",
                        "aid": "430702"
                    },

                    {
                        "id": 1,
                        "name": "鼎城区",
                        "aid": "430703"
                    },

                    {
                        "id": 2,
                        "name": "安乡县",
                        "aid": "430721"
                    },

                    {
                        "id": 3,
                        "name": "汉寿县",
                        "aid": "430722"
                    },

                    {
                        "id": 4,
                        "name": "澧县",
                        "aid": "430723"
                    },

                    {
                        "id": 5,
                        "name": "临澧县",
                        "aid": "430724"
                    },

                    {
                        "id": 6,
                        "name": "桃源县",
                        "aid": "430725"
                    },

                    {
                        "id": 7,
                        "name": "石门县",
                        "aid": "430726"
                    },

                    {
                        "id": 8,
                        "name": "津市市",
                        "aid": "430781"
                    },

                ]
            },

            {
                "id": 7,
                "name": "张家界市",
                "aid": "430800",
                "sub": [

                    {
                        "id": 0,
                        "name": "永定区",
                        "aid": "430802"
                    },

                    {
                        "id": 1,
                        "name": "武陵源区",
                        "aid": "430811"
                    },

                    {
                        "id": 2,
                        "name": "慈利县",
                        "aid": "430821"
                    },

                    {
                        "id": 3,
                        "name": "桑植县",
                        "aid": "430822"
                    },

                ]
            },

            {
                "id": 8,
                "name": "益阳市",
                "aid": "430900",
                "sub": [

                    {
                        "id": 0,
                        "name": "资阳区",
                        "aid": "430902"
                    },

                    {
                        "id": 1,
                        "name": "赫山区",
                        "aid": "430903"
                    },

                    {
                        "id": 2,
                        "name": "南县",
                        "aid": "430921"
                    },

                    {
                        "id": 3,
                        "name": "桃江县",
                        "aid": "430922"
                    },

                    {
                        "id": 4,
                        "name": "安化县",
                        "aid": "430923"
                    },

                    {
                        "id": 5,
                        "name": "沅江市",
                        "aid": "430981"
                    },

                ]
            },

            {
                "id": 9,
                "name": "郴州市",
                "aid": "431000",
                "sub": [

                    {
                        "id": 0,
                        "name": "北湖区",
                        "aid": "431002"
                    },

                    {
                        "id": 1,
                        "name": "苏仙区",
                        "aid": "431003"
                    },

                    {
                        "id": 2,
                        "name": "桂阳县",
                        "aid": "431021"
                    },

                    {
                        "id": 3,
                        "name": "宜章县",
                        "aid": "431022"
                    },

                    {
                        "id": 4,
                        "name": "永兴县",
                        "aid": "431023"
                    },

                    {
                        "id": 5,
                        "name": "嘉禾县",
                        "aid": "431024"
                    },

                    {
                        "id": 6,
                        "name": "临武县",
                        "aid": "431025"
                    },

                    {
                        "id": 7,
                        "name": "汝城县",
                        "aid": "431026"
                    },

                    {
                        "id": 8,
                        "name": "桂东县",
                        "aid": "431027"
                    },

                    {
                        "id": 9,
                        "name": "安仁县",
                        "aid": "431028"
                    },

                    {
                        "id": 10,
                        "name": "资兴市",
                        "aid": "431081"
                    },

                ]
            },

            {
                "id": 10,
                "name": "永州市",
                "aid": "431100",
                "sub": [

                    {
                        "id": 0,
                        "name": "零陵区",
                        "aid": "431102"
                    },

                    {
                        "id": 1,
                        "name": "冷水滩区",
                        "aid": "431103"
                    },

                    {
                        "id": 2,
                        "name": "祁阳县",
                        "aid": "431121"
                    },

                    {
                        "id": 3,
                        "name": "东安县",
                        "aid": "431122"
                    },

                    {
                        "id": 4,
                        "name": "双牌县",
                        "aid": "431123"
                    },

                    {
                        "id": 5,
                        "name": "道县",
                        "aid": "431124"
                    },

                    {
                        "id": 6,
                        "name": "江永县",
                        "aid": "431125"
                    },

                    {
                        "id": 7,
                        "name": "宁远县",
                        "aid": "431126"
                    },

                    {
                        "id": 8,
                        "name": "蓝山县",
                        "aid": "431127"
                    },

                    {
                        "id": 9,
                        "name": "新田县",
                        "aid": "431128"
                    },

                    {
                        "id": 10,
                        "name": "江华瑶族自治县",
                        "aid": "431129"
                    },

                ]
            },

            {
                "id": 11,
                "name": "怀化市",
                "aid": "431200",
                "sub": [

                    {
                        "id": 0,
                        "name": "鹤城区",
                        "aid": "431202"
                    },

                    {
                        "id": 1,
                        "name": "中方县",
                        "aid": "431221"
                    },

                    {
                        "id": 2,
                        "name": "沅陵县",
                        "aid": "431222"
                    },

                    {
                        "id": 3,
                        "name": "辰溪县",
                        "aid": "431223"
                    },

                    {
                        "id": 4,
                        "name": "溆浦县",
                        "aid": "431224"
                    },

                    {
                        "id": 5,
                        "name": "会同县",
                        "aid": "431225"
                    },

                    {
                        "id": 6,
                        "name": "麻阳苗族自治县",
                        "aid": "431226"
                    },

                    {
                        "id": 7,
                        "name": "新晃侗族自治县",
                        "aid": "431227"
                    },

                    {
                        "id": 8,
                        "name": "芷江侗族自治县",
                        "aid": "431228"
                    },

                    {
                        "id": 9,
                        "name": "靖州苗族侗族自治县",
                        "aid": "431229"
                    },

                    {
                        "id": 10,
                        "name": "通道侗族自治县",
                        "aid": "431230"
                    },

                    {
                        "id": 11,
                        "name": "洪江市",
                        "aid": "431281"
                    },

                ]
            },

            {
                "id": 12,
                "name": "娄底市",
                "aid": "431300",
                "sub": [

                    {
                        "id": 0,
                        "name": "娄星区",
                        "aid": "431302"
                    },

                    {
                        "id": 1,
                        "name": "双峰县",
                        "aid": "431321"
                    },

                    {
                        "id": 2,
                        "name": "新化县",
                        "aid": "431322"
                    },

                    {
                        "id": 3,
                        "name": "冷水江市",
                        "aid": "431381"
                    },

                    {
                        "id": 4,
                        "name": "涟源市",
                        "aid": "431382"
                    },

                ]
            },

            {
                "id": 13,
                "name": "湘西土家族苗族自治州",
                "aid": "433100",
                "sub": [

                    {
                        "id": 0,
                        "name": "吉首市",
                        "aid": "433101"
                    },

                    {
                        "id": 1,
                        "name": "泸溪县",
                        "aid": "433122"
                    },

                    {
                        "id": 2,
                        "name": "凤凰县",
                        "aid": "433123"
                    },

                    {
                        "id": 3,
                        "name": "花垣县",
                        "aid": "433124"
                    },

                    {
                        "id": 4,
                        "name": "保靖县",
                        "aid": "433125"
                    },

                    {
                        "id": 5,
                        "name": "古丈县",
                        "aid": "433126"
                    },

                    {
                        "id": 6,
                        "name": "永顺县",
                        "aid": "433127"
                    },

                    {
                        "id": 7,
                        "name": "龙山县",
                        "aid": "433130"
                    },

                ]
            },

        ]
    },

    {
        "id": 18,
        "name": "广东省",
        "aid": "440000",
        "sub": [

            {
                "id": 0,
                "name": "梅州市",
                "aid": "441400",
                "sub": [

                    {
                        "id": 0,
                        "name": "梅江区",
                        "aid": "441402"
                    },

                    {
                        "id": 1,
                        "name": "梅县区",
                        "aid": "441403"
                    },

                    {
                        "id": 2,
                        "name": "大埔县",
                        "aid": "441422"
                    },

                    {
                        "id": 3,
                        "name": "丰顺县",
                        "aid": "441423"
                    },

                    {
                        "id": 4,
                        "name": "五华县",
                        "aid": "441424"
                    },

                    {
                        "id": 5,
                        "name": "平远县",
                        "aid": "441426"
                    },

                    {
                        "id": 6,
                        "name": "蕉岭县",
                        "aid": "441427"
                    },

                    {
                        "id": 7,
                        "name": "兴宁市",
                        "aid": "441481"
                    },

                ]
            },

            {
                "id": 1,
                "name": "广州市",
                "aid": "440100",
                "sub": [

                    {
                        "id": 0,
                        "name": "荔湾区",
                        "aid": "440103"
                    },

                    {
                        "id": 1,
                        "name": "越秀区",
                        "aid": "440104"
                    },

                    {
                        "id": 2,
                        "name": "海珠区",
                        "aid": "440105"
                    },

                    {
                        "id": 3,
                        "name": "天河区",
                        "aid": "440106"
                    },

                    {
                        "id": 4,
                        "name": "白云区",
                        "aid": "440111"
                    },

                    {
                        "id": 5,
                        "name": "黄埔区",
                        "aid": "440112"
                    },

                    {
                        "id": 6,
                        "name": "番禺区",
                        "aid": "440113"
                    },

                    {
                        "id": 7,
                        "name": "花都区",
                        "aid": "440114"
                    },

                    {
                        "id": 8,
                        "name": "南沙区",
                        "aid": "440115"
                    },

                    {
                        "id": 9,
                        "name": "从化区",
                        "aid": "440117"
                    },

                    {
                        "id": 10,
                        "name": "增城区",
                        "aid": "440118"
                    },

                ]
            },

            {
                "id": 2,
                "name": "韶关市",
                "aid": "440200",
                "sub": [

                    {
                        "id": 0,
                        "name": "武江区",
                        "aid": "440203"
                    },

                    {
                        "id": 1,
                        "name": "浈江区",
                        "aid": "440204"
                    },

                    {
                        "id": 2,
                        "name": "曲江区",
                        "aid": "440205"
                    },

                    {
                        "id": 3,
                        "name": "始兴县",
                        "aid": "440222"
                    },

                    {
                        "id": 4,
                        "name": "仁化县",
                        "aid": "440224"
                    },

                    {
                        "id": 5,
                        "name": "翁源县",
                        "aid": "440229"
                    },

                    {
                        "id": 6,
                        "name": "乳源瑶族自治县",
                        "aid": "440232"
                    },

                    {
                        "id": 7,
                        "name": "新丰县",
                        "aid": "440233"
                    },

                    {
                        "id": 8,
                        "name": "乐昌市",
                        "aid": "440281"
                    },

                    {
                        "id": 9,
                        "name": "南雄市",
                        "aid": "440282"
                    },

                ]
            },

            {
                "id": 3,
                "name": "深圳市",
                "aid": "440300",
                "sub": [

                    {
                        "id": 0,
                        "name": "罗湖区",
                        "aid": "440303"
                    },

                    {
                        "id": 1,
                        "name": "福田区",
                        "aid": "440304"
                    },

                    {
                        "id": 2,
                        "name": "南山区",
                        "aid": "440305"
                    },

                    {
                        "id": 3,
                        "name": "宝安区",
                        "aid": "440306"
                    },

                    {
                        "id": 4,
                        "name": "龙岗区",
                        "aid": "440307"
                    },

                    {
                        "id": 5,
                        "name": "盐田区",
                        "aid": "440308"
                    },

                    {
                        "id": 6,
                        "name": "龙华区",
                        "aid": "440309"
                    },

                    {
                        "id": 7,
                        "name": "坪山区",
                        "aid": "440310"
                    },

                    {
                        "id": 8,
                        "name": "光明新区",
                        "aid": "440311"
                    },

                    {
                        "id": 9,
                        "name": "大鹏新区",
                        "aid": "440312"
                    },

                ]
            },

            {
                "id": 4,
                "name": "珠海市",
                "aid": "440400",
                "sub": [

                    {
                        "id": 0,
                        "name": "香洲区",
                        "aid": "440402"
                    },

                    {
                        "id": 1,
                        "name": "斗门区",
                        "aid": "440403"
                    },

                    {
                        "id": 2,
                        "name": "金湾区",
                        "aid": "440404"
                    },

                    {
                        "id": 3,
                        "name": "横琴新区",
                        "aid": "440405"
                    },

                    {
                        "id": 4,
                        "name": "经济开发区",
                        "aid": "440406"
                    },

                ]
            },

            {
                "id": 5,
                "name": "汕头市",
                "aid": "440500",
                "sub": [

                    {
                        "id": 0,
                        "name": "龙湖区",
                        "aid": "440507"
                    },

                    {
                        "id": 1,
                        "name": "金平区",
                        "aid": "440511"
                    },

                    {
                        "id": 2,
                        "name": "濠江区",
                        "aid": "440512"
                    },

                    {
                        "id": 3,
                        "name": "潮阳区",
                        "aid": "440513"
                    },

                    {
                        "id": 4,
                        "name": "潮南区",
                        "aid": "440514"
                    },

                    {
                        "id": 5,
                        "name": "澄海区",
                        "aid": "440515"
                    },

                    {
                        "id": 6,
                        "name": "南澳县",
                        "aid": "440523"
                    },

                ]
            },

            {
                "id": 6,
                "name": "佛山市",
                "aid": "440600",
                "sub": [

                    {
                        "id": 0,
                        "name": "禅城区",
                        "aid": "440604"
                    },

                    {
                        "id": 1,
                        "name": "南海区",
                        "aid": "440605"
                    },

                    {
                        "id": 2,
                        "name": "顺德区",
                        "aid": "440606"
                    },

                    {
                        "id": 3,
                        "name": "三水区",
                        "aid": "440607"
                    },

                    {
                        "id": 4,
                        "name": "高明区",
                        "aid": "440608"
                    },

                ]
            },

            {
                "id": 7,
                "name": "江门市",
                "aid": "440700",
                "sub": [

                    {
                        "id": 0,
                        "name": "蓬江区",
                        "aid": "440703"
                    },

                    {
                        "id": 1,
                        "name": "江海区",
                        "aid": "440704"
                    },

                    {
                        "id": 2,
                        "name": "新会区",
                        "aid": "440705"
                    },

                    {
                        "id": 3,
                        "name": "台山市",
                        "aid": "440781"
                    },

                    {
                        "id": 4,
                        "name": "开平市",
                        "aid": "440783"
                    },

                    {
                        "id": 5,
                        "name": "鹤山市",
                        "aid": "440784"
                    },

                    {
                        "id": 6,
                        "name": "恩平市",
                        "aid": "440785"
                    },

                ]
            },

            {
                "id": 8,
                "name": "湛江市",
                "aid": "440800",
                "sub": [

                    {
                        "id": 0,
                        "name": "赤坎区",
                        "aid": "440802"
                    },

                    {
                        "id": 1,
                        "name": "霞山区",
                        "aid": "440803"
                    },

                    {
                        "id": 2,
                        "name": "坡头区",
                        "aid": "440804"
                    },

                    {
                        "id": 3,
                        "name": "麻章区",
                        "aid": "440811"
                    },

                    {
                        "id": 4,
                        "name": "遂溪县",
                        "aid": "440823"
                    },

                    {
                        "id": 5,
                        "name": "徐闻县",
                        "aid": "440825"
                    },

                    {
                        "id": 6,
                        "name": "廉江市",
                        "aid": "440881"
                    },

                    {
                        "id": 7,
                        "name": "雷州市",
                        "aid": "440882"
                    },

                    {
                        "id": 8,
                        "name": "吴川市",
                        "aid": "440883"
                    },

                    {
                        "id": 9,
                        "name": "经济开发区",
                        "aid": "440884"
                    },

                ]
            },

            {
                "id": 9,
                "name": "茂名市",
                "aid": "440900",
                "sub": [

                    {
                        "id": 0,
                        "name": "茂南区",
                        "aid": "440902"
                    },

                    {
                        "id": 1,
                        "name": "电白区",
                        "aid": "440904"
                    },

                    {
                        "id": 2,
                        "name": "高州市",
                        "aid": "440981"
                    },

                    {
                        "id": 3,
                        "name": "化州市",
                        "aid": "440982"
                    },

                    {
                        "id": 4,
                        "name": "信宜市",
                        "aid": "440983"
                    },

                ]
            },

            {
                "id": 10,
                "name": "肇庆市",
                "aid": "441200",
                "sub": [

                    {
                        "id": 0,
                        "name": "端州区",
                        "aid": "441202"
                    },

                    {
                        "id": 1,
                        "name": "鼎湖区",
                        "aid": "441203"
                    },

                    {
                        "id": 2,
                        "name": "高要区",
                        "aid": "441204"
                    },

                    {
                        "id": 3,
                        "name": "广宁县",
                        "aid": "441223"
                    },

                    {
                        "id": 4,
                        "name": "怀集县",
                        "aid": "441224"
                    },

                    {
                        "id": 5,
                        "name": "封开县",
                        "aid": "441225"
                    },

                    {
                        "id": 6,
                        "name": "德庆县",
                        "aid": "441226"
                    },

                    {
                        "id": 7,
                        "name": "四会市",
                        "aid": "441284"
                    },

                ]
            },

            {
                "id": 11,
                "name": "惠州市",
                "aid": "441300",
                "sub": [

                    {
                        "id": 0,
                        "name": "惠城区",
                        "aid": "441302"
                    },

                    {
                        "id": 1,
                        "name": "惠阳区",
                        "aid": "441303"
                    },

                    {
                        "id": 2,
                        "name": "博罗县",
                        "aid": "441322"
                    },

                    {
                        "id": 3,
                        "name": "惠东县",
                        "aid": "441323"
                    },

                    {
                        "id": 4,
                        "name": "龙门县",
                        "aid": "441324"
                    },

                    {
                        "id": 5,
                        "name": "大亚湾区",
                        "aid": "441325"
                    },

                ]
            },

            {
                "id": 12,
                "name": "汕尾市",
                "aid": "441500",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "441502"
                    },

                    {
                        "id": 1,
                        "name": "海丰县",
                        "aid": "441521"
                    },

                    {
                        "id": 2,
                        "name": "陆河县",
                        "aid": "441523"
                    },

                    {
                        "id": 3,
                        "name": "陆丰市",
                        "aid": "441581"
                    },

                ]
            },

            {
                "id": 13,
                "name": "河源市",
                "aid": "441600",
                "sub": [

                    {
                        "id": 0,
                        "name": "源城区",
                        "aid": "441602"
                    },

                    {
                        "id": 1,
                        "name": "紫金县",
                        "aid": "441621"
                    },

                    {
                        "id": 2,
                        "name": "龙川县",
                        "aid": "441622"
                    },

                    {
                        "id": 3,
                        "name": "连平县",
                        "aid": "441623"
                    },

                    {
                        "id": 4,
                        "name": "和平县",
                        "aid": "441624"
                    },

                    {
                        "id": 5,
                        "name": "东源县",
                        "aid": "441625"
                    },

                ]
            },

            {
                "id": 14,
                "name": "阳江市",
                "aid": "441700",
                "sub": [

                    {
                        "id": 0,
                        "name": "江城区",
                        "aid": "441702"
                    },

                    {
                        "id": 1,
                        "name": "阳东区",
                        "aid": "441704"
                    },

                    {
                        "id": 2,
                        "name": "阳西县",
                        "aid": "441721"
                    },

                    {
                        "id": 3,
                        "name": "阳春市",
                        "aid": "441781"
                    },

                ]
            },

            {
                "id": 15,
                "name": "清远市",
                "aid": "441800",
                "sub": [

                    {
                        "id": 0,
                        "name": "清城区",
                        "aid": "441802"
                    },

                    {
                        "id": 1,
                        "name": "清新区",
                        "aid": "441803"
                    },

                    {
                        "id": 2,
                        "name": "佛冈县",
                        "aid": "441821"
                    },

                    {
                        "id": 3,
                        "name": "阳山县",
                        "aid": "441823"
                    },

                    {
                        "id": 4,
                        "name": "连山壮族瑶族自治县",
                        "aid": "441825"
                    },

                    {
                        "id": 5,
                        "name": "连南瑶族自治县",
                        "aid": "441826"
                    },

                    {
                        "id": 6,
                        "name": "英德市",
                        "aid": "441881"
                    },

                    {
                        "id": 7,
                        "name": "连州市",
                        "aid": "441882"
                    },

                ]
            },

            {
                "id": 16,
                "name": "东莞市",
                "aid": "441900",
                "sub": [

                    {
                        "id": 0,
                        "name": "莞城区",
                        "aid": "441901"
                    },

                    {
                        "id": 1,
                        "name": "南城区",
                        "aid": "441902"
                    },

                    {
                        "id": 2,
                        "name": "东城区",
                        "aid": "441903"
                    },

                    {
                        "id": 3,
                        "name": "万江区",
                        "aid": "441904"
                    },

                    {
                        "id": 4,
                        "name": "石碣镇",
                        "aid": "441905"
                    },

                    {
                        "id": 5,
                        "name": "石龙镇",
                        "aid": "441906"
                    },

                    {
                        "id": 6,
                        "name": "茶山镇",
                        "aid": "441907"
                    },

                    {
                        "id": 7,
                        "name": "石排镇",
                        "aid": "441908"
                    },

                    {
                        "id": 8,
                        "name": "企石镇",
                        "aid": "441909"
                    },

                    {
                        "id": 9,
                        "name": "横沥镇",
                        "aid": "441910"
                    },

                    {
                        "id": 10,
                        "name": "桥头镇",
                        "aid": "441911"
                    },

                    {
                        "id": 11,
                        "name": "谢岗镇",
                        "aid": "441912"
                    },

                    {
                        "id": 12,
                        "name": "东坑镇",
                        "aid": "441913"
                    },

                    {
                        "id": 13,
                        "name": "常平镇",
                        "aid": "441914"
                    },

                    {
                        "id": 14,
                        "name": "寮步镇",
                        "aid": "441915"
                    },

                    {
                        "id": 15,
                        "name": "大朗镇",
                        "aid": "441916"
                    },

                    {
                        "id": 16,
                        "name": "麻涌镇",
                        "aid": "441917"
                    },

                    {
                        "id": 17,
                        "name": "中堂镇",
                        "aid": "441918"
                    },

                    {
                        "id": 18,
                        "name": "高埗镇",
                        "aid": "441919"
                    },

                    {
                        "id": 19,
                        "name": "樟木头镇",
                        "aid": "441920"
                    },

                    {
                        "id": 20,
                        "name": "大岭山镇",
                        "aid": "441921"
                    },

                    {
                        "id": 21,
                        "name": "望牛墩镇",
                        "aid": "441922"
                    },

                    {
                        "id": 22,
                        "name": "黄江镇",
                        "aid": "441923"
                    },

                    {
                        "id": 23,
                        "name": "洪梅镇",
                        "aid": "441924"
                    },

                    {
                        "id": 24,
                        "name": "清溪镇",
                        "aid": "441925"
                    },

                    {
                        "id": 25,
                        "name": "沙田镇",
                        "aid": "441926"
                    },

                    {
                        "id": 26,
                        "name": "道滘镇",
                        "aid": "441927"
                    },

                    {
                        "id": 27,
                        "name": "塘厦镇",
                        "aid": "441928"
                    },

                    {
                        "id": 28,
                        "name": "虎门镇",
                        "aid": "441929"
                    },

                    {
                        "id": 29,
                        "name": "厚街镇",
                        "aid": "441930"
                    },

                    {
                        "id": 30,
                        "name": "凤岗镇",
                        "aid": "441931"
                    },

                    {
                        "id": 31,
                        "name": "长安镇",
                        "aid": "441932"
                    },

                    {
                        "id": 32,
                        "name": "松山湖高新区",
                        "aid": "441933"
                    },

                ]
            },

            {
                "id": 17,
                "name": "中山市",
                "aid": "442000",
                "sub": [

                    {
                        "id": 0,
                        "name": "石岐区",
                        "aid": "442001"
                    },

                    {
                        "id": 1,
                        "name": "东区",
                        "aid": "442002"
                    },

                    {
                        "id": 2,
                        "name": "西区",
                        "aid": "442003"
                    },

                    {
                        "id": 3,
                        "name": "南区",
                        "aid": "442004"
                    },

                    {
                        "id": 4,
                        "name": "五桂山区",
                        "aid": "442005"
                    },

                    {
                        "id": 5,
                        "name": "火炬开发区",
                        "aid": "442006"
                    },

                    {
                        "id": 6,
                        "name": "黄圃镇",
                        "aid": "442007"
                    },

                    {
                        "id": 7,
                        "name": "南头镇",
                        "aid": "442008"
                    },

                    {
                        "id": 8,
                        "name": "东凤镇",
                        "aid": "442009"
                    },

                    {
                        "id": 9,
                        "name": "阜沙镇",
                        "aid": "442010"
                    },

                    {
                        "id": 10,
                        "name": "小榄镇",
                        "aid": "442011"
                    },

                    {
                        "id": 11,
                        "name": "东升镇",
                        "aid": "442012"
                    },

                    {
                        "id": 12,
                        "name": "古镇镇",
                        "aid": "442013"
                    },

                    {
                        "id": 13,
                        "name": "横栏镇",
                        "aid": "442014"
                    },

                    {
                        "id": 14,
                        "name": "三角镇",
                        "aid": "442015"
                    },

                    {
                        "id": 15,
                        "name": "民众镇",
                        "aid": "442016"
                    },

                    {
                        "id": 16,
                        "name": "南朗镇",
                        "aid": "442017"
                    },

                    {
                        "id": 17,
                        "name": "港口镇",
                        "aid": "442018"
                    },

                    {
                        "id": 18,
                        "name": "大涌镇",
                        "aid": "442019"
                    },

                    {
                        "id": 19,
                        "name": "沙溪镇",
                        "aid": "442020"
                    },

                    {
                        "id": 20,
                        "name": "三乡镇",
                        "aid": "442021"
                    },

                    {
                        "id": 21,
                        "name": "板芙镇",
                        "aid": "442022"
                    },

                    {
                        "id": 22,
                        "name": "神湾镇",
                        "aid": "442023"
                    },

                    {
                        "id": 23,
                        "name": "坦洲镇",
                        "aid": "442024"
                    },

                ]
            },

            {
                "id": 18,
                "name": "潮州市",
                "aid": "445100",
                "sub": [

                    {
                        "id": 0,
                        "name": "湘桥区",
                        "aid": "445102"
                    },

                    {
                        "id": 1,
                        "name": "潮安区",
                        "aid": "445103"
                    },

                    {
                        "id": 2,
                        "name": "饶平县",
                        "aid": "445122"
                    },

                ]
            },

            {
                "id": 19,
                "name": "揭阳市",
                "aid": "445200",
                "sub": [

                    {
                        "id": 0,
                        "name": "榕城区",
                        "aid": "445202"
                    },

                    {
                        "id": 1,
                        "name": "揭东区",
                        "aid": "445203"
                    },

                    {
                        "id": 2,
                        "name": "揭西县",
                        "aid": "445222"
                    },

                    {
                        "id": 3,
                        "name": "惠来县",
                        "aid": "445224"
                    },

                    {
                        "id": 4,
                        "name": "普宁市",
                        "aid": "445281"
                    },

                ]
            },

            {
                "id": 20,
                "name": "云浮市",
                "aid": "445300",
                "sub": [

                    {
                        "id": 0,
                        "name": "云城区",
                        "aid": "445302"
                    },

                    {
                        "id": 1,
                        "name": "云安区",
                        "aid": "445303"
                    },

                    {
                        "id": 2,
                        "name": "新兴县",
                        "aid": "445321"
                    },

                    {
                        "id": 3,
                        "name": "郁南县",
                        "aid": "445322"
                    },

                    {
                        "id": 4,
                        "name": "罗定市",
                        "aid": "445381"
                    },

                ]
            },

        ]
    },

    {
        "id": 19,
        "name": "广西壮族自治区",
        "aid": "450000",
        "sub": [

            {
                "id": 0,
                "name": "南宁市",
                "aid": "450100",
                "sub": [

                    {
                        "id": 0,
                        "name": "兴宁区",
                        "aid": "450102"
                    },

                    {
                        "id": 1,
                        "name": "青秀区",
                        "aid": "450103"
                    },

                    {
                        "id": 2,
                        "name": "江南区",
                        "aid": "450105"
                    },

                    {
                        "id": 3,
                        "name": "西乡塘区",
                        "aid": "450107"
                    },

                    {
                        "id": 4,
                        "name": "良庆区",
                        "aid": "450108"
                    },

                    {
                        "id": 5,
                        "name": "邕宁区",
                        "aid": "450109"
                    },

                    {
                        "id": 6,
                        "name": "武鸣区",
                        "aid": "450110"
                    },

                    {
                        "id": 7,
                        "name": "隆安县",
                        "aid": "450123"
                    },

                    {
                        "id": 8,
                        "name": "马山县",
                        "aid": "450124"
                    },

                    {
                        "id": 9,
                        "name": "上林县",
                        "aid": "450125"
                    },

                    {
                        "id": 10,
                        "name": "宾阳县",
                        "aid": "450126"
                    },

                    {
                        "id": 11,
                        "name": "横县",
                        "aid": "450127"
                    },

                    {
                        "id": 12,
                        "name": "埌东新区",
                        "aid": "450128"
                    },

                ]
            },

            {
                "id": 1,
                "name": "柳州市",
                "aid": "450200",
                "sub": [

                    {
                        "id": 0,
                        "name": "城中区",
                        "aid": "450202"
                    },

                    {
                        "id": 1,
                        "name": "鱼峰区",
                        "aid": "450203"
                    },

                    {
                        "id": 2,
                        "name": "柳南区",
                        "aid": "450204"
                    },

                    {
                        "id": 3,
                        "name": "柳北区",
                        "aid": "450205"
                    },

                    {
                        "id": 4,
                        "name": "柳江区",
                        "aid": "450206"
                    },

                    {
                        "id": 5,
                        "name": "柳城县",
                        "aid": "450222"
                    },

                    {
                        "id": 6,
                        "name": "鹿寨县",
                        "aid": "450223"
                    },

                    {
                        "id": 7,
                        "name": "融安县",
                        "aid": "450224"
                    },

                    {
                        "id": 8,
                        "name": "融水苗族自治县",
                        "aid": "450225"
                    },

                    {
                        "id": 9,
                        "name": "三江侗族自治县",
                        "aid": "450226"
                    },

                    {
                        "id": 10,
                        "name": "柳东新区",
                        "aid": "450227"
                    },

                ]
            },

            {
                "id": 2,
                "name": "桂林市",
                "aid": "450300",
                "sub": [

                    {
                        "id": 0,
                        "name": "秀峰区",
                        "aid": "450302"
                    },

                    {
                        "id": 1,
                        "name": "叠彩区",
                        "aid": "450303"
                    },

                    {
                        "id": 2,
                        "name": "象山区",
                        "aid": "450304"
                    },

                    {
                        "id": 3,
                        "name": "七星区",
                        "aid": "450305"
                    },

                    {
                        "id": 4,
                        "name": "雁山区",
                        "aid": "450311"
                    },

                    {
                        "id": 5,
                        "name": "临桂区",
                        "aid": "450312"
                    },

                    {
                        "id": 6,
                        "name": "阳朔县",
                        "aid": "450321"
                    },

                    {
                        "id": 7,
                        "name": "灵川县",
                        "aid": "450323"
                    },

                    {
                        "id": 8,
                        "name": "全州县",
                        "aid": "450324"
                    },

                    {
                        "id": 9,
                        "name": "兴安县",
                        "aid": "450325"
                    },

                    {
                        "id": 10,
                        "name": "永福县",
                        "aid": "450326"
                    },

                    {
                        "id": 11,
                        "name": "灌阳县",
                        "aid": "450327"
                    },

                    {
                        "id": 12,
                        "name": "龙胜各族自治县",
                        "aid": "450328"
                    },

                    {
                        "id": 13,
                        "name": "资源县",
                        "aid": "450329"
                    },

                    {
                        "id": 14,
                        "name": "平乐县",
                        "aid": "450330"
                    },

                    {
                        "id": 15,
                        "name": "荔浦县",
                        "aid": "450331"
                    },

                    {
                        "id": 16,
                        "name": "恭城瑶族自治县",
                        "aid": "450332"
                    },

                ]
            },

            {
                "id": 3,
                "name": "梧州市",
                "aid": "450400",
                "sub": [

                    {
                        "id": 0,
                        "name": "万秀区",
                        "aid": "450403"
                    },

                    {
                        "id": 1,
                        "name": "长洲区",
                        "aid": "450405"
                    },

                    {
                        "id": 2,
                        "name": "龙圩区",
                        "aid": "450406"
                    },

                    {
                        "id": 3,
                        "name": "苍梧县",
                        "aid": "450421"
                    },

                    {
                        "id": 4,
                        "name": "藤县",
                        "aid": "450422"
                    },

                    {
                        "id": 5,
                        "name": "蒙山县",
                        "aid": "450423"
                    },

                    {
                        "id": 6,
                        "name": "岑溪市",
                        "aid": "450481"
                    },

                ]
            },

            {
                "id": 4,
                "name": "北海市",
                "aid": "450500",
                "sub": [

                    {
                        "id": 0,
                        "name": "海城区",
                        "aid": "450502"
                    },

                    {
                        "id": 1,
                        "name": "银海区",
                        "aid": "450503"
                    },

                    {
                        "id": 2,
                        "name": "铁山港区",
                        "aid": "450512"
                    },

                    {
                        "id": 3,
                        "name": "合浦县",
                        "aid": "450521"
                    },

                ]
            },

            {
                "id": 5,
                "name": "防城港市",
                "aid": "450600",
                "sub": [

                    {
                        "id": 0,
                        "name": "港口区",
                        "aid": "450602"
                    },

                    {
                        "id": 1,
                        "name": "防城区",
                        "aid": "450603"
                    },

                    {
                        "id": 2,
                        "name": "上思县",
                        "aid": "450621"
                    },

                    {
                        "id": 3,
                        "name": "东兴市",
                        "aid": "450681"
                    },

                ]
            },

            {
                "id": 6,
                "name": "钦州市",
                "aid": "450700",
                "sub": [

                    {
                        "id": 0,
                        "name": "钦南区",
                        "aid": "450702"
                    },

                    {
                        "id": 1,
                        "name": "钦北区",
                        "aid": "450703"
                    },

                    {
                        "id": 2,
                        "name": "灵山县",
                        "aid": "450721"
                    },

                    {
                        "id": 3,
                        "name": "浦北县",
                        "aid": "450722"
                    },

                ]
            },

            {
                "id": 7,
                "name": "贵港市",
                "aid": "450800",
                "sub": [

                    {
                        "id": 0,
                        "name": "港北区",
                        "aid": "450802"
                    },

                    {
                        "id": 1,
                        "name": "港南区",
                        "aid": "450803"
                    },

                    {
                        "id": 2,
                        "name": "覃塘区",
                        "aid": "450804"
                    },

                    {
                        "id": 3,
                        "name": "平南县",
                        "aid": "450821"
                    },

                    {
                        "id": 4,
                        "name": "桂平市",
                        "aid": "450881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "玉林市",
                "aid": "450900",
                "sub": [

                    {
                        "id": 0,
                        "name": "玉州区",
                        "aid": "450902"
                    },

                    {
                        "id": 1,
                        "name": "福绵区",
                        "aid": "450903"
                    },

                    {
                        "id": 2,
                        "name": "容县",
                        "aid": "450921"
                    },

                    {
                        "id": 3,
                        "name": "陆川县",
                        "aid": "450922"
                    },

                    {
                        "id": 4,
                        "name": "博白县",
                        "aid": "450923"
                    },

                    {
                        "id": 5,
                        "name": "兴业县",
                        "aid": "450924"
                    },

                    {
                        "id": 6,
                        "name": "北流市",
                        "aid": "450981"
                    },

                    {
                        "id": 7,
                        "name": "玉东新区",
                        "aid": "450982"
                    },

                    {
                        "id": 8,
                        "name": "高新区",
                        "aid": "450983"
                    },

                ]
            },

            {
                "id": 9,
                "name": "百色市",
                "aid": "451000",
                "sub": [

                    {
                        "id": 0,
                        "name": "右江区",
                        "aid": "451002"
                    },

                    {
                        "id": 1,
                        "name": "田阳县",
                        "aid": "451021"
                    },

                    {
                        "id": 2,
                        "name": "田东县",
                        "aid": "451022"
                    },

                    {
                        "id": 3,
                        "name": "平果县",
                        "aid": "451023"
                    },

                    {
                        "id": 4,
                        "name": "德保县",
                        "aid": "451024"
                    },

                    {
                        "id": 5,
                        "name": "那坡县",
                        "aid": "451026"
                    },

                    {
                        "id": 6,
                        "name": "凌云县",
                        "aid": "451027"
                    },

                    {
                        "id": 7,
                        "name": "乐业县",
                        "aid": "451028"
                    },

                    {
                        "id": 8,
                        "name": "田林县",
                        "aid": "451029"
                    },

                    {
                        "id": 9,
                        "name": "西林县",
                        "aid": "451030"
                    },

                    {
                        "id": 10,
                        "name": "隆林各族自治县",
                        "aid": "451031"
                    },

                    {
                        "id": 11,
                        "name": "靖西市",
                        "aid": "451081"
                    },

                ]
            },

            {
                "id": 10,
                "name": "贺州市",
                "aid": "451100",
                "sub": [

                    {
                        "id": 0,
                        "name": "八步区",
                        "aid": "451102"
                    },

                    {
                        "id": 1,
                        "name": "平桂区",
                        "aid": "451103"
                    },

                    {
                        "id": 2,
                        "name": "昭平县",
                        "aid": "451121"
                    },

                    {
                        "id": 3,
                        "name": "钟山县",
                        "aid": "451122"
                    },

                    {
                        "id": 4,
                        "name": "富川瑶族自治县",
                        "aid": "451123"
                    },

                ]
            },

            {
                "id": 11,
                "name": "河池市",
                "aid": "451200",
                "sub": [

                    {
                        "id": 0,
                        "name": "金城江区",
                        "aid": "451202"
                    },

                    {
                        "id": 1,
                        "name": "宜州区",
                        "aid": "451203"
                    },

                    {
                        "id": 2,
                        "name": "南丹县",
                        "aid": "451221"
                    },

                    {
                        "id": 3,
                        "name": "天峨县",
                        "aid": "451222"
                    },

                    {
                        "id": 4,
                        "name": "凤山县",
                        "aid": "451223"
                    },

                    {
                        "id": 5,
                        "name": "东兰县",
                        "aid": "451224"
                    },

                    {
                        "id": 6,
                        "name": "罗城仫佬族自治县",
                        "aid": "451225"
                    },

                    {
                        "id": 7,
                        "name": "环江毛南族自治县",
                        "aid": "451226"
                    },

                    {
                        "id": 8,
                        "name": "巴马瑶族自治县",
                        "aid": "451227"
                    },

                    {
                        "id": 9,
                        "name": "都安瑶族自治县",
                        "aid": "451228"
                    },

                    {
                        "id": 10,
                        "name": "大化瑶族自治县",
                        "aid": "451229"
                    },

                ]
            },

            {
                "id": 12,
                "name": "来宾市",
                "aid": "451300",
                "sub": [

                    {
                        "id": 0,
                        "name": "兴宾区",
                        "aid": "451302"
                    },

                    {
                        "id": 1,
                        "name": "忻城县",
                        "aid": "451321"
                    },

                    {
                        "id": 2,
                        "name": "象州县",
                        "aid": "451322"
                    },

                    {
                        "id": 3,
                        "name": "武宣县",
                        "aid": "451323"
                    },

                    {
                        "id": 4,
                        "name": "金秀瑶族自治县",
                        "aid": "451324"
                    },

                    {
                        "id": 5,
                        "name": "合山市",
                        "aid": "451381"
                    },

                ]
            },

            {
                "id": 13,
                "name": "崇左市",
                "aid": "451400",
                "sub": [

                    {
                        "id": 0,
                        "name": "江州区",
                        "aid": "451402"
                    },

                    {
                        "id": 1,
                        "name": "扶绥县",
                        "aid": "451421"
                    },

                    {
                        "id": 2,
                        "name": "宁明县",
                        "aid": "451422"
                    },

                    {
                        "id": 3,
                        "name": "龙州县",
                        "aid": "451423"
                    },

                    {
                        "id": 4,
                        "name": "大新县",
                        "aid": "451424"
                    },

                    {
                        "id": 5,
                        "name": "天等县",
                        "aid": "451425"
                    },

                    {
                        "id": 6,
                        "name": "凭祥市",
                        "aid": "451481"
                    },

                ]
            },

        ]
    },

    {
        "id": 20,
        "name": "海南省",
        "aid": "460000",
        "sub": [

            {
                "id": 0,
                "name": "海口市",
                "aid": "460100",
                "sub": [

                    {
                        "id": 0,
                        "name": "秀英区",
                        "aid": "460105"
                    },

                    {
                        "id": 1,
                        "name": "龙华区",
                        "aid": "460106"
                    },

                    {
                        "id": 2,
                        "name": "琼山区",
                        "aid": "460107"
                    },

                    {
                        "id": 3,
                        "name": "美兰区",
                        "aid": "460108"
                    },

                ]
            },

            {
                "id": 1,
                "name": "三亚市",
                "aid": "460200",
                "sub": [

                    {
                        "id": 0,
                        "name": "海棠区",
                        "aid": "460202"
                    },

                    {
                        "id": 1,
                        "name": "吉阳区",
                        "aid": "460203"
                    },

                    {
                        "id": 2,
                        "name": "天涯区",
                        "aid": "460204"
                    },

                    {
                        "id": 3,
                        "name": "崖州区",
                        "aid": "460205"
                    },

                ]
            },

            {
                "id": 2,
                "name": "三沙市",
                "aid": "460300",
                "sub": [

                    {
                        "id": 0,
                        "name": "西沙群岛",
                        "aid": "460321"
                    },

                    {
                        "id": 1,
                        "name": "南沙群岛",
                        "aid": "460322"
                    },

                    {
                        "id": 2,
                        "name": "中沙群岛",
                        "aid": "460323"
                    },

                ]
            },

            {
                "id": 3,
                "name": "儋州市",
                "aid": "460400",
                "sub": [

                    {
                        "id": 0,
                        "name": "洋浦经济开发区",
                        "aid": "460401"
                    },

                    {
                        "id": 1,
                        "name": "那大镇",
                        "aid": "460402"
                    },

                    {
                        "id": 2,
                        "name": "南丰镇",
                        "aid": "460403"
                    },

                    {
                        "id": 3,
                        "name": "雅星镇",
                        "aid": "460404"
                    },

                    {
                        "id": 4,
                        "name": "和庆镇",
                        "aid": "460405"
                    },

                    {
                        "id": 5,
                        "name": "大成镇",
                        "aid": "460406"
                    },

                    {
                        "id": 6,
                        "name": "新州镇",
                        "aid": "460407"
                    },

                    {
                        "id": 7,
                        "name": "光村镇",
                        "aid": "460408"
                    },

                    {
                        "id": 8,
                        "name": "东成镇",
                        "aid": "460409"
                    },

                    {
                        "id": 9,
                        "name": "中和镇",
                        "aid": "460410"
                    },

                    {
                        "id": 10,
                        "name": "峨蔓镇",
                        "aid": "460411"
                    },

                    {
                        "id": 11,
                        "name": "兰洋镇",
                        "aid": "460412"
                    },

                    {
                        "id": 12,
                        "name": "王五镇",
                        "aid": "460413"
                    },

                    {
                        "id": 13,
                        "name": "排浦镇",
                        "aid": "460414"
                    },

                    {
                        "id": 14,
                        "name": "海头镇",
                        "aid": "460415"
                    },

                    {
                        "id": 15,
                        "name": "木棠镇",
                        "aid": "460416"
                    },

                    {
                        "id": 16,
                        "name": "白马井镇",
                        "aid": "460417"
                    },

                    {
                        "id": 17,
                        "name": "三都镇",
                        "aid": "460418"
                    },

                    {
                        "id": 18,
                        "name": "西培农场",
                        "aid": "460419"
                    },

                    {
                        "id": 19,
                        "name": "西联农场",
                        "aid": "460420"
                    },

                    {
                        "id": 20,
                        "name": "蓝洋农场",
                        "aid": "460421"
                    },

                    {
                        "id": 21,
                        "name": "八一农场",
                        "aid": "460422"
                    },

                    {
                        "id": 22,
                        "name": "西华农场",
                        "aid": "460423"
                    },

                    {
                        "id": 23,
                        "name": "西庆农场",
                        "aid": "460424"
                    },

                    {
                        "id": 24,
                        "name": "西流农场",
                        "aid": "460425"
                    },

                    {
                        "id": 25,
                        "name": "新盈农场",
                        "aid": "460426"
                    },

                    {
                        "id": 26,
                        "name": "龙山农场",
                        "aid": "460427"
                    },

                    {
                        "id": 27,
                        "name": "红岭农场",
                        "aid": "460428"
                    },

                ]
            },

            {
                "id": 4,
                "name": "五指山市",
                "aid": "469001",
                "sub": [

                    {
                        "id": 0,
                        "name": "通什镇",
                        "aid": "469101"
                    },

                    {
                        "id": 1,
                        "name": "南圣镇",
                        "aid": "469102"
                    },

                    {
                        "id": 2,
                        "name": "毛阳镇",
                        "aid": "469103"
                    },

                    {
                        "id": 3,
                        "name": "番阳镇",
                        "aid": "469104"
                    },

                    {
                        "id": 4,
                        "name": "畅好乡",
                        "aid": "469105"
                    },

                    {
                        "id": 5,
                        "name": "毛道乡",
                        "aid": "469106"
                    },

                    {
                        "id": 6,
                        "name": "水满乡",
                        "aid": "469107"
                    },

                ]
            },

            {
                "id": 5,
                "name": "琼海市",
                "aid": "469002",
                "sub": [

                    {
                        "id": 0,
                        "name": "嘉积镇",
                        "aid": "469201"
                    },

                    {
                        "id": 1,
                        "name": "万泉镇",
                        "aid": "469202"
                    },

                    {
                        "id": 2,
                        "name": "石壁镇",
                        "aid": "469203"
                    },

                    {
                        "id": 3,
                        "name": "中原镇",
                        "aid": "469204"
                    },

                    {
                        "id": 4,
                        "name": "博鳌镇",
                        "aid": "469205"
                    },

                    {
                        "id": 5,
                        "name": "阳江镇",
                        "aid": "469206"
                    },

                    {
                        "id": 6,
                        "name": "龙江镇",
                        "aid": "469207"
                    },

                    {
                        "id": 7,
                        "name": "潭门镇",
                        "aid": "469208"
                    },

                    {
                        "id": 8,
                        "name": "塔洋镇",
                        "aid": "469209"
                    },

                    {
                        "id": 9,
                        "name": "长坡镇",
                        "aid": "469210"
                    },

                    {
                        "id": 10,
                        "name": "大路镇",
                        "aid": "469211"
                    },

                    {
                        "id": 11,
                        "name": "会山镇",
                        "aid": "469212"
                    },

                    {
                        "id": 12,
                        "name": "东太农场",
                        "aid": "469213"
                    },

                    {
                        "id": 13,
                        "name": "东红农场",
                        "aid": "469214"
                    },

                    {
                        "id": 14,
                        "name": "东升农场",
                        "aid": "469215"
                    },

                    {
                        "id": 15,
                        "name": "南俸农场",
                        "aid": "469216"
                    },

                    {
                        "id": 16,
                        "name": "彬村山华侨农场",
                        "aid": "469217"
                    },

                ]
            },

            {
                "id": 6,
                "name": "文昌市",
                "aid": "469005",
                "sub": [

                    {
                        "id": 0,
                        "name": "文城镇",
                        "aid": "469501"
                    },

                    {
                        "id": 1,
                        "name": "重兴镇",
                        "aid": "469502"
                    },

                    {
                        "id": 2,
                        "name": "蓬莱镇",
                        "aid": "469503"
                    },

                    {
                        "id": 3,
                        "name": "会文镇",
                        "aid": "469504"
                    },

                    {
                        "id": 4,
                        "name": "东路镇",
                        "aid": "469505"
                    },

                    {
                        "id": 5,
                        "name": "潭牛镇",
                        "aid": "469506"
                    },

                    {
                        "id": 6,
                        "name": "东阁镇",
                        "aid": "469507"
                    },

                    {
                        "id": 7,
                        "name": "文教镇",
                        "aid": "469508"
                    },

                    {
                        "id": 8,
                        "name": "东郊镇",
                        "aid": "469509"
                    },

                    {
                        "id": 9,
                        "name": "龙楼镇",
                        "aid": "469510"
                    },

                    {
                        "id": 10,
                        "name": "昌洒镇",
                        "aid": "469511"
                    },

                    {
                        "id": 11,
                        "name": "翁田镇",
                        "aid": "469512"
                    },

                    {
                        "id": 12,
                        "name": "抱罗镇",
                        "aid": "469513"
                    },

                    {
                        "id": 13,
                        "name": "冯坡镇",
                        "aid": "469514"
                    },

                    {
                        "id": 14,
                        "name": "锦山镇",
                        "aid": "469515"
                    },

                    {
                        "id": 15,
                        "name": "铺前镇",
                        "aid": "469516"
                    },

                    {
                        "id": 16,
                        "name": "公坡镇",
                        "aid": "469517"
                    },

                    {
                        "id": 17,
                        "name": "迈号镇",
                        "aid": "469518"
                    },

                    {
                        "id": 18,
                        "name": "清谰镇",
                        "aid": "469519"
                    },

                    {
                        "id": 19,
                        "name": "南阳镇",
                        "aid": "469520"
                    },

                    {
                        "id": 20,
                        "name": "新桥镇",
                        "aid": "469521"
                    },

                    {
                        "id": 21,
                        "name": "头苑镇",
                        "aid": "469522"
                    },

                    {
                        "id": 22,
                        "name": "宝芳乡",
                        "aid": "469523"
                    },

                    {
                        "id": 23,
                        "name": "龙马乡",
                        "aid": "469524"
                    },

                    {
                        "id": 24,
                        "name": "湖山乡",
                        "aid": "469525"
                    },

                    {
                        "id": 25,
                        "name": "东路农场",
                        "aid": "469526"
                    },

                    {
                        "id": 26,
                        "name": "南阳农场",
                        "aid": "469527"
                    },

                    {
                        "id": 27,
                        "name": "罗豆农场",
                        "aid": "469528"
                    },

                ]
            },

            {
                "id": 7,
                "name": "万宁市",
                "aid": "469006",
                "sub": [

                    {
                        "id": 0,
                        "name": "万城镇",
                        "aid": "469601"
                    },

                    {
                        "id": 1,
                        "name": "龙滚镇",
                        "aid": "469602"
                    },

                    {
                        "id": 2,
                        "name": "和乐镇",
                        "aid": "469603"
                    },

                    {
                        "id": 3,
                        "name": "后安镇",
                        "aid": "469604"
                    },

                    {
                        "id": 4,
                        "name": "大茂镇",
                        "aid": "469605"
                    },

                    {
                        "id": 5,
                        "name": "东澳镇",
                        "aid": "469606"
                    },

                    {
                        "id": 6,
                        "name": "礼纪镇",
                        "aid": "469607"
                    },

                    {
                        "id": 7,
                        "name": "长丰镇",
                        "aid": "469608"
                    },

                    {
                        "id": 8,
                        "name": "山根镇",
                        "aid": "469609"
                    },

                    {
                        "id": 9,
                        "name": "北大镇",
                        "aid": "469610"
                    },

                    {
                        "id": 10,
                        "name": "南桥镇",
                        "aid": "469611"
                    },

                    {
                        "id": 11,
                        "name": "三更罗镇",
                        "aid": "469612"
                    },

                    {
                        "id": 12,
                        "name": "东岭农场",
                        "aid": "469613"
                    },

                    {
                        "id": 13,
                        "name": "南林农场",
                        "aid": "469614"
                    },

                    {
                        "id": 14,
                        "name": "东兴农场",
                        "aid": "469615"
                    },

                    {
                        "id": 15,
                        "name": "东和农场",
                        "aid": "469616"
                    },

                    {
                        "id": 16,
                        "name": "新中农场",
                        "aid": "469617"
                    },

                    {
                        "id": 17,
                        "name": "兴隆华侨农场",
                        "aid": "469618"
                    },

                ]
            },

            {
                "id": 8,
                "name": "东方市",
                "aid": "469007",
                "sub": [

                    {
                        "id": 0,
                        "name": "八所镇",
                        "aid": "469701"
                    },

                    {
                        "id": 1,
                        "name": "东河镇",
                        "aid": "469702"
                    },

                    {
                        "id": 2,
                        "name": "大田镇",
                        "aid": "469703"
                    },

                    {
                        "id": 3,
                        "name": "感城镇",
                        "aid": "469704"
                    },

                    {
                        "id": 4,
                        "name": "板桥镇",
                        "aid": "469705"
                    },

                    {
                        "id": 5,
                        "name": "三家镇",
                        "aid": "469706"
                    },

                    {
                        "id": 6,
                        "name": "四更镇",
                        "aid": "469707"
                    },

                    {
                        "id": 7,
                        "name": "新龙镇",
                        "aid": "469708"
                    },

                    {
                        "id": 8,
                        "name": "天安乡",
                        "aid": "469709"
                    },

                    {
                        "id": 9,
                        "name": "江边乡",
                        "aid": "469710"
                    },

                    {
                        "id": 10,
                        "name": "广坝农场",
                        "aid": "469711"
                    },

                    {
                        "id": 11,
                        "name": "东方华侨农场",
                        "aid": "469712"
                    },

                ]
            },

            {
                "id": 9,
                "name": "定安县",
                "aid": "469021",
                "sub": [

                    {
                        "id": 0,
                        "name": "定城镇",
                        "aid": "469801"
                    },

                    {
                        "id": 1,
                        "name": "新竹镇",
                        "aid": "469802"
                    },

                    {
                        "id": 2,
                        "name": "龙湖镇",
                        "aid": "469803"
                    },

                    {
                        "id": 3,
                        "name": "雷鸣镇",
                        "aid": "469804"
                    },

                    {
                        "id": 4,
                        "name": "龙门镇",
                        "aid": "469805"
                    },

                    {
                        "id": 5,
                        "name": "龙河镇",
                        "aid": "469806"
                    },

                    {
                        "id": 6,
                        "name": "岭口镇",
                        "aid": "469807"
                    },

                    {
                        "id": 7,
                        "name": "翰林镇",
                        "aid": "469808"
                    },

                    {
                        "id": 8,
                        "name": "富文镇",
                        "aid": "469809"
                    },

                    {
                        "id": 9,
                        "name": "黄竹镇",
                        "aid": "469810"
                    },

                    {
                        "id": 10,
                        "name": "金鸡岭农场",
                        "aid": "469811"
                    },

                    {
                        "id": 11,
                        "name": "中瑞农场",
                        "aid": "469812"
                    },

                    {
                        "id": 12,
                        "name": "南海农场",
                        "aid": "469813"
                    },

                    {
                        "id": 13,
                        "name": "城区",
                        "aid": "469814"
                    },

                ]
            },

            {
                "id": 10,
                "name": "屯昌县",
                "aid": "469022",
                "sub": [

                    {
                        "id": 0,
                        "name": "屯城镇",
                        "aid": "469821"
                    },

                    {
                        "id": 1,
                        "name": "新兴镇",
                        "aid": "469822"
                    },

                    {
                        "id": 2,
                        "name": "枫木镇",
                        "aid": "469823"
                    },

                    {
                        "id": 3,
                        "name": "乌坡镇",
                        "aid": "469824"
                    },

                    {
                        "id": 4,
                        "name": "南吕镇",
                        "aid": "469825"
                    },

                    {
                        "id": 5,
                        "name": "南坤镇",
                        "aid": "469826"
                    },

                    {
                        "id": 6,
                        "name": "坡心镇",
                        "aid": "469827"
                    },

                    {
                        "id": 7,
                        "name": "西昌镇",
                        "aid": "469828"
                    },

                    {
                        "id": 8,
                        "name": "中建农场",
                        "aid": "469829"
                    },

                    {
                        "id": 9,
                        "name": "中坤农场",
                        "aid": "469830"
                    },

                    {
                        "id": 10,
                        "name": "县城内",
                        "aid": "469831"
                    },

                ]
            },

            {
                "id": 11,
                "name": "澄迈县",
                "aid": "469023",
                "sub": [

                    {
                        "id": 0,
                        "name": "金江镇",
                        "aid": "469841"
                    },

                    {
                        "id": 1,
                        "name": "老城镇",
                        "aid": "469842"
                    },

                    {
                        "id": 2,
                        "name": "瑞溪镇",
                        "aid": "469843"
                    },

                    {
                        "id": 3,
                        "name": "永发镇",
                        "aid": "469844"
                    },

                    {
                        "id": 4,
                        "name": "加乐镇",
                        "aid": "469845"
                    },

                    {
                        "id": 5,
                        "name": "文儒镇",
                        "aid": "469846"
                    },

                    {
                        "id": 6,
                        "name": "中兴镇",
                        "aid": "469847"
                    },

                    {
                        "id": 7,
                        "name": "仁兴镇",
                        "aid": "469848"
                    },

                    {
                        "id": 8,
                        "name": "福山镇",
                        "aid": "469849"
                    },

                    {
                        "id": 9,
                        "name": "桥头镇",
                        "aid": "469850"
                    },

                    {
                        "id": 10,
                        "name": "大丰镇",
                        "aid": "469851"
                    },

                    {
                        "id": 11,
                        "name": "红光农场",
                        "aid": "469852"
                    },

                    {
                        "id": 12,
                        "name": "西达农场",
                        "aid": "469853"
                    },

                    {
                        "id": 13,
                        "name": "金安农场",
                        "aid": "469854"
                    },

                    {
                        "id": 14,
                        "name": "城区",
                        "aid": "469855"
                    },

                ]
            },

            {
                "id": 12,
                "name": "临高县",
                "aid": "469024",
                "sub": [

                    {
                        "id": 0,
                        "name": "临城镇",
                        "aid": "469861"
                    },

                    {
                        "id": 1,
                        "name": "波莲镇",
                        "aid": "469862"
                    },

                    {
                        "id": 2,
                        "name": "东英镇",
                        "aid": "469863"
                    },

                    {
                        "id": 3,
                        "name": "博厚镇",
                        "aid": "469864"
                    },

                    {
                        "id": 4,
                        "name": "皇桐镇",
                        "aid": "469865"
                    },

                    {
                        "id": 5,
                        "name": "多文镇",
                        "aid": "469866"
                    },

                    {
                        "id": 6,
                        "name": "和舍镇",
                        "aid": "469867"
                    },

                    {
                        "id": 7,
                        "name": "南宝镇",
                        "aid": "469868"
                    },

                    {
                        "id": 8,
                        "name": "新盈镇",
                        "aid": "469869"
                    },

                    {
                        "id": 9,
                        "name": "调楼镇",
                        "aid": "469870"
                    },

                    {
                        "id": 10,
                        "name": "加来镇",
                        "aid": "469871"
                    },

                    {
                        "id": 11,
                        "name": "红华农场",
                        "aid": "469872"
                    },

                    {
                        "id": 12,
                        "name": "加来农场",
                        "aid": "469873"
                    },

                    {
                        "id": 13,
                        "name": "城区",
                        "aid": "469874"
                    },

                ]
            },

            {
                "id": 13,
                "name": "白沙黎族自治县",
                "aid": "469025",
                "sub": [

                    {
                        "id": 0,
                        "name": "牙叉镇",
                        "aid": "469881"
                    },

                    {
                        "id": 1,
                        "name": "七坊镇",
                        "aid": "469882"
                    },

                    {
                        "id": 2,
                        "name": "邦溪镇",
                        "aid": "469883"
                    },

                    {
                        "id": 3,
                        "name": "打安镇",
                        "aid": "469884"
                    },

                    {
                        "id": 4,
                        "name": "细水乡",
                        "aid": "469885"
                    },

                    {
                        "id": 5,
                        "name": "元门乡",
                        "aid": "469886"
                    },

                    {
                        "id": 6,
                        "name": "南开乡",
                        "aid": "469887"
                    },

                    {
                        "id": 7,
                        "name": "阜龙乡",
                        "aid": "469888"
                    },

                    {
                        "id": 8,
                        "name": "青松乡",
                        "aid": "469889"
                    },

                    {
                        "id": 9,
                        "name": "金波乡",
                        "aid": "469890"
                    },

                    {
                        "id": 10,
                        "name": "荣邦乡",
                        "aid": "469891"
                    },

                    {
                        "id": 11,
                        "name": "白沙农场",
                        "aid": "469892"
                    },

                    {
                        "id": 12,
                        "name": "龙江农场",
                        "aid": "469893"
                    },

                    {
                        "id": 13,
                        "name": "邦溪农场",
                        "aid": "469894"
                    },

                    {
                        "id": 14,
                        "name": "城区",
                        "aid": "469895"
                    },

                ]
            },

            {
                "id": 14,
                "name": "昌江黎族自治县",
                "aid": "469026",
                "sub": [

                    {
                        "id": 0,
                        "name": "石碌镇",
                        "aid": "469901"
                    },

                    {
                        "id": 1,
                        "name": "叉河镇",
                        "aid": "469902"
                    },

                    {
                        "id": 2,
                        "name": "十月田镇",
                        "aid": "469903"
                    },

                    {
                        "id": 3,
                        "name": "乌烈镇",
                        "aid": "469904"
                    },

                    {
                        "id": 4,
                        "name": "海尾镇",
                        "aid": "469905"
                    },

                    {
                        "id": 5,
                        "name": "南罗镇",
                        "aid": "469906"
                    },

                    {
                        "id": 6,
                        "name": "太坡镇",
                        "aid": "469907"
                    },

                    {
                        "id": 7,
                        "name": "昌化镇",
                        "aid": "469908"
                    },

                    {
                        "id": 8,
                        "name": "七叉镇",
                        "aid": "469909"
                    },

                    {
                        "id": 9,
                        "name": "保平乡",
                        "aid": "469910"
                    },

                    {
                        "id": 10,
                        "name": "昌城乡",
                        "aid": "469911"
                    },

                    {
                        "id": 11,
                        "name": "王下乡",
                        "aid": "469912"
                    },

                    {
                        "id": 12,
                        "name": "霸王岭林场",
                        "aid": "469913"
                    },

                    {
                        "id": 13,
                        "name": "红林农场",
                        "aid": "469914"
                    },

                    {
                        "id": 14,
                        "name": "城区",
                        "aid": "469915"
                    },

                ]
            },

            {
                "id": 15,
                "name": "乐东黎族自治县",
                "aid": "469027",
                "sub": [

                    {
                        "id": 0,
                        "name": "抱由镇",
                        "aid": "469920"
                    },

                    {
                        "id": 1,
                        "name": "万冲镇",
                        "aid": "469921"
                    },

                    {
                        "id": 2,
                        "name": "大安镇",
                        "aid": "469922"
                    },

                    {
                        "id": 3,
                        "name": "志仲镇",
                        "aid": "469923"
                    },

                    {
                        "id": 4,
                        "name": "千家镇",
                        "aid": "469924"
                    },

                    {
                        "id": 5,
                        "name": "九所镇",
                        "aid": "469925"
                    },

                    {
                        "id": 6,
                        "name": "利国镇",
                        "aid": "469926"
                    },

                    {
                        "id": 7,
                        "name": "黄流镇",
                        "aid": "469927"
                    },

                    {
                        "id": 8,
                        "name": "佛罗镇",
                        "aid": "469928"
                    },

                    {
                        "id": 9,
                        "name": "尖峰镇",
                        "aid": "469929"
                    },

                    {
                        "id": 10,
                        "name": "莺歌海镇",
                        "aid": "469930"
                    },

                    {
                        "id": 11,
                        "name": "乐中农场",
                        "aid": "469931"
                    },

                    {
                        "id": 12,
                        "name": "山荣农场",
                        "aid": "469932"
                    },

                    {
                        "id": 13,
                        "name": "乐光农场",
                        "aid": "469933"
                    },

                    {
                        "id": 14,
                        "name": "报伦农场",
                        "aid": "469934"
                    },

                    {
                        "id": 15,
                        "name": "福报农场",
                        "aid": "469935"
                    },

                    {
                        "id": 16,
                        "name": "保国农场",
                        "aid": "469936"
                    },

                    {
                        "id": 17,
                        "name": "保显农场",
                        "aid": "469937"
                    },

                    {
                        "id": 18,
                        "name": "尖峰岭林业",
                        "aid": "469938"
                    },

                    {
                        "id": 19,
                        "name": "莺歌海盐场",
                        "aid": "469939"
                    },

                    {
                        "id": 20,
                        "name": "城区",
                        "aid": "469940"
                    },

                ]
            },

            {
                "id": 16,
                "name": "陵水黎族自治县",
                "aid": "469028",
                "sub": [

                    {
                        "id": 0,
                        "name": "椰林镇",
                        "aid": "469941"
                    },

                    {
                        "id": 1,
                        "name": "光坡镇",
                        "aid": "469942"
                    },

                    {
                        "id": 2,
                        "name": "三才镇",
                        "aid": "469943"
                    },

                    {
                        "id": 3,
                        "name": "英州镇",
                        "aid": "469944"
                    },

                    {
                        "id": 4,
                        "name": "隆广镇",
                        "aid": "469945"
                    },

                    {
                        "id": 5,
                        "name": "文罗镇",
                        "aid": "469946"
                    },

                    {
                        "id": 6,
                        "name": "本号镇",
                        "aid": "469947"
                    },

                    {
                        "id": 7,
                        "name": "新村镇",
                        "aid": "469948"
                    },

                    {
                        "id": 8,
                        "name": "黎安镇",
                        "aid": "469949"
                    },

                    {
                        "id": 9,
                        "name": "提蒙乡",
                        "aid": "469950"
                    },

                    {
                        "id": 10,
                        "name": "群英乡",
                        "aid": "469951"
                    },

                    {
                        "id": 11,
                        "name": "岭门农场",
                        "aid": "469952"
                    },

                    {
                        "id": 12,
                        "name": "南平农场",
                        "aid": "469953"
                    },

                    {
                        "id": 13,
                        "name": "城区",
                        "aid": "469954"
                    },

                ]
            },

            {
                "id": 17,
                "name": "保亭黎族苗族自治县",
                "aid": "469029",
                "sub": [

                    {
                        "id": 0,
                        "name": "保城镇",
                        "aid": "469961"
                    },

                    {
                        "id": 1,
                        "name": "什玲镇",
                        "aid": "469962"
                    },

                    {
                        "id": 2,
                        "name": "加茂镇",
                        "aid": "469963"
                    },

                    {
                        "id": 3,
                        "name": "响水镇",
                        "aid": "469964"
                    },

                    {
                        "id": 4,
                        "name": "新政镇",
                        "aid": "469965"
                    },

                    {
                        "id": 5,
                        "name": "三道镇",
                        "aid": "469966"
                    },

                    {
                        "id": 6,
                        "name": "六弓乡",
                        "aid": "469967"
                    },

                    {
                        "id": 7,
                        "name": "南林乡",
                        "aid": "469968"
                    },

                    {
                        "id": 8,
                        "name": "毛感乡",
                        "aid": "469969"
                    },

                    {
                        "id": 9,
                        "name": "新星农场",
                        "aid": "469970"
                    },

                    {
                        "id": 10,
                        "name": "金江农场",
                        "aid": "469971"
                    },

                    {
                        "id": 11,
                        "name": "三道农场",
                        "aid": "469972"
                    },

                ]
            },

            {
                "id": 18,
                "name": "琼中黎族苗族自治县",
                "aid": "469030",
                "sub": [

                    {
                        "id": 0,
                        "name": "营根镇",
                        "aid": "469981"
                    },

                    {
                        "id": 1,
                        "name": "湾岭镇",
                        "aid": "469982"
                    },

                    {
                        "id": 2,
                        "name": "黎母山镇",
                        "aid": "469983"
                    },

                    {
                        "id": 3,
                        "name": "和平镇",
                        "aid": "469984"
                    },

                    {
                        "id": 4,
                        "name": "长征镇",
                        "aid": "469985"
                    },

                    {
                        "id": 5,
                        "name": "红毛镇",
                        "aid": "469986"
                    },

                    {
                        "id": 6,
                        "name": "中平镇",
                        "aid": "469987"
                    },

                    {
                        "id": 7,
                        "name": "上安乡",
                        "aid": "469988"
                    },

                    {
                        "id": 8,
                        "name": "什运乡",
                        "aid": "469989"
                    },

                    {
                        "id": 9,
                        "name": "吊罗山乡",
                        "aid": "469990"
                    },

                    {
                        "id": 10,
                        "name": "阳江农场",
                        "aid": "469991"
                    },

                    {
                        "id": 11,
                        "name": "乌石农场",
                        "aid": "469992"
                    },

                    {
                        "id": 12,
                        "name": "加钗农场",
                        "aid": "469993"
                    },

                    {
                        "id": 13,
                        "name": "长征农场",
                        "aid": "469994"
                    },

                    {
                        "id": 14,
                        "name": "城区",
                        "aid": "469995"
                    },

                ]
            },

        ]
    },

    {
        "id": 21,
        "name": "重庆",
        "aid": "500000",
        "sub": [

            {
                "id": 0,
                "name": "重庆市",
                "aid": "500100",
                "sub": [

                    {
                        "id": 0,
                        "name": "潼南区",
                        "aid": "500152"
                    },

                    {
                        "id": 1,
                        "name": "万州区",
                        "aid": "500101"
                    },

                    {
                        "id": 2,
                        "name": "涪陵区",
                        "aid": "500102"
                    },

                    {
                        "id": 3,
                        "name": "渝中区",
                        "aid": "500103"
                    },

                    {
                        "id": 4,
                        "name": "大渡口区",
                        "aid": "500104"
                    },

                    {
                        "id": 5,
                        "name": "江北区",
                        "aid": "500105"
                    },

                    {
                        "id": 6,
                        "name": "沙坪坝区",
                        "aid": "500106"
                    },

                    {
                        "id": 7,
                        "name": "九龙坡区",
                        "aid": "500107"
                    },

                    {
                        "id": 8,
                        "name": "南岸区",
                        "aid": "500108"
                    },

                    {
                        "id": 9,
                        "name": "北碚区",
                        "aid": "500109"
                    },

                    {
                        "id": 10,
                        "name": "綦江区",
                        "aid": "500110"
                    },

                    {
                        "id": 11,
                        "name": "大足区",
                        "aid": "500111"
                    },

                    {
                        "id": 12,
                        "name": "渝北区",
                        "aid": "500112"
                    },

                    {
                        "id": 13,
                        "name": "巴南区",
                        "aid": "500113"
                    },

                    {
                        "id": 14,
                        "name": "黔江区",
                        "aid": "500114"
                    },

                    {
                        "id": 15,
                        "name": "长寿区",
                        "aid": "500115"
                    },

                    {
                        "id": 16,
                        "name": "江津区",
                        "aid": "500116"
                    },

                    {
                        "id": 17,
                        "name": "合川区",
                        "aid": "500117"
                    },

                    {
                        "id": 18,
                        "name": "永川区",
                        "aid": "500118"
                    },

                    {
                        "id": 19,
                        "name": "南川区",
                        "aid": "500119"
                    },

                    {
                        "id": 20,
                        "name": "璧山区",
                        "aid": "500120"
                    },

                    {
                        "id": 21,
                        "name": "铜梁区",
                        "aid": "500151"
                    },

                    {
                        "id": 22,
                        "name": "荣昌区",
                        "aid": "500153"
                    },

                    {
                        "id": 23,
                        "name": "开州区",
                        "aid": "500154"
                    },

                    {
                        "id": 24,
                        "name": "梁平区",
                        "aid": "500155"
                    },

                    {
                        "id": 25,
                        "name": "武隆区",
                        "aid": "500156"
                    },

                    {
                        "id": 26,
                        "name": "城口县",
                        "aid": "500229"
                    },

                    {
                        "id": 27,
                        "name": "丰都县",
                        "aid": "500230"
                    },

                    {
                        "id": 28,
                        "name": "垫江县",
                        "aid": "500231"
                    },

                    {
                        "id": 29,
                        "name": "忠县",
                        "aid": "500233"
                    },

                    {
                        "id": 30,
                        "name": "云阳县",
                        "aid": "500235"
                    },

                    {
                        "id": 31,
                        "name": "奉节县",
                        "aid": "500236"
                    },

                    {
                        "id": 32,
                        "name": "巫山县",
                        "aid": "500237"
                    },

                    {
                        "id": 33,
                        "name": "巫溪县",
                        "aid": "500238"
                    },

                    {
                        "id": 34,
                        "name": "石柱土家族自治县",
                        "aid": "500240"
                    },

                    {
                        "id": 35,
                        "name": "秀山土家族苗族自治县",
                        "aid": "500241"
                    },

                    {
                        "id": 36,
                        "name": "酉阳土家族苗族自治县",
                        "aid": "500242"
                    },

                    {
                        "id": 37,
                        "name": "彭水苗族土家族自治县",
                        "aid": "500243"
                    },

                    {
                        "id": 38,
                        "name": "两江新区",
                        "aid": "500300"
                    },

                    {
                        "id": 39,
                        "name": "高新区",
                        "aid": "500301"
                    },

                    {
                        "id": 40,
                        "name": "璧山高新区",
                        "aid": "500302"
                    },

                ]
            },

        ]
    },

    {
        "id": 22,
        "name": "四川省",
        "aid": "510000",
        "sub": [

            {
                "id": 0,
                "name": "资阳市",
                "aid": "512000",
                "sub": [

                    {
                        "id": 0,
                        "name": "雁江区",
                        "aid": "512002"
                    },

                    {
                        "id": 1,
                        "name": "安岳县",
                        "aid": "512021"
                    },

                    {
                        "id": 2,
                        "name": "乐至县",
                        "aid": "512022"
                    },

                ]
            },

            {
                "id": 1,
                "name": "成都市",
                "aid": "510100",
                "sub": [

                    {
                        "id": 0,
                        "name": "锦江区",
                        "aid": "510104"
                    },

                    {
                        "id": 1,
                        "name": "青羊区",
                        "aid": "510105"
                    },

                    {
                        "id": 2,
                        "name": "金牛区",
                        "aid": "510106"
                    },

                    {
                        "id": 3,
                        "name": "武侯区",
                        "aid": "510107"
                    },

                    {
                        "id": 4,
                        "name": "成华区",
                        "aid": "510108"
                    },

                    {
                        "id": 5,
                        "name": "龙泉驿区",
                        "aid": "510112"
                    },

                    {
                        "id": 6,
                        "name": "青白江区",
                        "aid": "510113"
                    },

                    {
                        "id": 7,
                        "name": "新都区",
                        "aid": "510114"
                    },

                    {
                        "id": 8,
                        "name": "温江区",
                        "aid": "510115"
                    },

                    {
                        "id": 9,
                        "name": "双流区",
                        "aid": "510116"
                    },

                    {
                        "id": 10,
                        "name": "郫都区",
                        "aid": "510117"
                    },

                    {
                        "id": 11,
                        "name": "金堂县",
                        "aid": "510121"
                    },

                    {
                        "id": 12,
                        "name": "大邑县",
                        "aid": "510129"
                    },

                    {
                        "id": 13,
                        "name": "蒲江县",
                        "aid": "510131"
                    },

                    {
                        "id": 14,
                        "name": "新津县",
                        "aid": "510132"
                    },

                    {
                        "id": 15,
                        "name": "都江堰市",
                        "aid": "510181"
                    },

                    {
                        "id": 16,
                        "name": "彭州市",
                        "aid": "510182"
                    },

                    {
                        "id": 17,
                        "name": "邛崃市",
                        "aid": "510183"
                    },

                    {
                        "id": 18,
                        "name": "崇州市",
                        "aid": "510184"
                    },

                    {
                        "id": 19,
                        "name": "简阳市",
                        "aid": "510185"
                    },

                    {
                        "id": 20,
                        "name": "天府新区",
                        "aid": "510186"
                    },

                    {
                        "id": 21,
                        "name": "高新南区",
                        "aid": "510187"
                    },

                    {
                        "id": 22,
                        "name": "高新西区",
                        "aid": "510188"
                    },

                ]
            },

            {
                "id": 2,
                "name": "自贡市",
                "aid": "510300",
                "sub": [

                    {
                        "id": 0,
                        "name": "自流井区",
                        "aid": "510302"
                    },

                    {
                        "id": 1,
                        "name": "贡井区",
                        "aid": "510303"
                    },

                    {
                        "id": 2,
                        "name": "大安区",
                        "aid": "510304"
                    },

                    {
                        "id": 3,
                        "name": "沿滩区",
                        "aid": "510311"
                    },

                    {
                        "id": 4,
                        "name": "荣县",
                        "aid": "510321"
                    },

                    {
                        "id": 5,
                        "name": "富顺县",
                        "aid": "510322"
                    },

                    {
                        "id": 6,
                        "name": "高新区",
                        "aid": "510323"
                    },

                ]
            },

            {
                "id": 3,
                "name": "攀枝花市",
                "aid": "510400",
                "sub": [

                    {
                        "id": 0,
                        "name": "东区",
                        "aid": "510402"
                    },

                    {
                        "id": 1,
                        "name": "西区",
                        "aid": "510403"
                    },

                    {
                        "id": 2,
                        "name": "仁和区",
                        "aid": "510411"
                    },

                    {
                        "id": 3,
                        "name": "米易县",
                        "aid": "510421"
                    },

                    {
                        "id": 4,
                        "name": "盐边县",
                        "aid": "510422"
                    },

                ]
            },

            {
                "id": 4,
                "name": "泸州市",
                "aid": "510500",
                "sub": [

                    {
                        "id": 0,
                        "name": "江阳区",
                        "aid": "510502"
                    },

                    {
                        "id": 1,
                        "name": "纳溪区",
                        "aid": "510503"
                    },

                    {
                        "id": 2,
                        "name": "龙马潭区",
                        "aid": "510504"
                    },

                    {
                        "id": 3,
                        "name": "泸县",
                        "aid": "510521"
                    },

                    {
                        "id": 4,
                        "name": "合江县",
                        "aid": "510522"
                    },

                    {
                        "id": 5,
                        "name": "叙永县",
                        "aid": "510524"
                    },

                    {
                        "id": 6,
                        "name": "古蔺县",
                        "aid": "510525"
                    },

                ]
            },

            {
                "id": 5,
                "name": "德阳市",
                "aid": "510600",
                "sub": [

                    {
                        "id": 0,
                        "name": "旌阳区",
                        "aid": "510603"
                    },

                    {
                        "id": 1,
                        "name": "中江县",
                        "aid": "510623"
                    },

                    {
                        "id": 2,
                        "name": "罗江区",
                        "aid": "510626"
                    },

                    {
                        "id": 3,
                        "name": "广汉市",
                        "aid": "510681"
                    },

                    {
                        "id": 4,
                        "name": "什邡市",
                        "aid": "510682"
                    },

                    {
                        "id": 5,
                        "name": "绵竹市",
                        "aid": "510683"
                    },

                ]
            },

            {
                "id": 6,
                "name": "绵阳市",
                "aid": "510700",
                "sub": [

                    {
                        "id": 0,
                        "name": "涪城区",
                        "aid": "510703"
                    },

                    {
                        "id": 1,
                        "name": "游仙区",
                        "aid": "510704"
                    },

                    {
                        "id": 2,
                        "name": "安州区",
                        "aid": "510705"
                    },

                    {
                        "id": 3,
                        "name": "三台县",
                        "aid": "510722"
                    },

                    {
                        "id": 4,
                        "name": "盐亭县",
                        "aid": "510723"
                    },

                    {
                        "id": 5,
                        "name": "梓潼县",
                        "aid": "510725"
                    },

                    {
                        "id": 6,
                        "name": "北川羌族自治县",
                        "aid": "510726"
                    },

                    {
                        "id": 7,
                        "name": "平武县",
                        "aid": "510727"
                    },

                    {
                        "id": 8,
                        "name": "江油市",
                        "aid": "510781"
                    },

                    {
                        "id": 9,
                        "name": "高新区",
                        "aid": "510782"
                    },

                    {
                        "id": 10,
                        "name": "经开区",
                        "aid": "510783"
                    },

                ]
            },

            {
                "id": 7,
                "name": "广元市",
                "aid": "510800",
                "sub": [

                    {
                        "id": 0,
                        "name": "利州区",
                        "aid": "510802"
                    },

                    {
                        "id": 1,
                        "name": "昭化区",
                        "aid": "510811"
                    },

                    {
                        "id": 2,
                        "name": "朝天区",
                        "aid": "510812"
                    },

                    {
                        "id": 3,
                        "name": "旺苍县",
                        "aid": "510821"
                    },

                    {
                        "id": 4,
                        "name": "青川县",
                        "aid": "510822"
                    },

                    {
                        "id": 5,
                        "name": "剑阁县",
                        "aid": "510823"
                    },

                    {
                        "id": 6,
                        "name": "苍溪县",
                        "aid": "510824"
                    },

                ]
            },

            {
                "id": 8,
                "name": "遂宁市",
                "aid": "510900",
                "sub": [

                    {
                        "id": 0,
                        "name": "船山区",
                        "aid": "510903"
                    },

                    {
                        "id": 1,
                        "name": "安居区",
                        "aid": "510904"
                    },

                    {
                        "id": 2,
                        "name": "蓬溪县",
                        "aid": "510921"
                    },

                    {
                        "id": 3,
                        "name": "射洪县",
                        "aid": "510922"
                    },

                    {
                        "id": 4,
                        "name": "大英县",
                        "aid": "510923"
                    },

                    {
                        "id": 5,
                        "name": "经济技术开发区",
                        "aid": "510924"
                    },

                ]
            },

            {
                "id": 9,
                "name": "内江市",
                "aid": "511000",
                "sub": [

                    {
                        "id": 0,
                        "name": "市中区",
                        "aid": "511002"
                    },

                    {
                        "id": 1,
                        "name": "东兴区",
                        "aid": "511011"
                    },

                    {
                        "id": 2,
                        "name": "威远县",
                        "aid": "511024"
                    },

                    {
                        "id": 3,
                        "name": "资中县",
                        "aid": "511025"
                    },

                    {
                        "id": 4,
                        "name": "隆昌市",
                        "aid": "511083"
                    },

                ]
            },

            {
                "id": 10,
                "name": "乐山市",
                "aid": "511100",
                "sub": [

                    {
                        "id": 0,
                        "name": "市中区",
                        "aid": "511102"
                    },

                    {
                        "id": 1,
                        "name": "沙湾区",
                        "aid": "511111"
                    },

                    {
                        "id": 2,
                        "name": "五通桥区",
                        "aid": "511112"
                    },

                    {
                        "id": 3,
                        "name": "金口河区",
                        "aid": "511113"
                    },

                    {
                        "id": 4,
                        "name": "犍为县",
                        "aid": "511123"
                    },

                    {
                        "id": 5,
                        "name": "井研县",
                        "aid": "511124"
                    },

                    {
                        "id": 6,
                        "name": "夹江县",
                        "aid": "511126"
                    },

                    {
                        "id": 7,
                        "name": "沐川县",
                        "aid": "511129"
                    },

                    {
                        "id": 8,
                        "name": "峨边彝族自治县",
                        "aid": "511132"
                    },

                    {
                        "id": 9,
                        "name": "马边彝族自治县",
                        "aid": "511133"
                    },

                    {
                        "id": 10,
                        "name": "峨眉山市",
                        "aid": "511181"
                    },

                ]
            },

            {
                "id": 11,
                "name": "南充市",
                "aid": "511300",
                "sub": [

                    {
                        "id": 0,
                        "name": "顺庆区",
                        "aid": "511302"
                    },

                    {
                        "id": 1,
                        "name": "高坪区",
                        "aid": "511303"
                    },

                    {
                        "id": 2,
                        "name": "嘉陵区",
                        "aid": "511304"
                    },

                    {
                        "id": 3,
                        "name": "南部县",
                        "aid": "511321"
                    },

                    {
                        "id": 4,
                        "name": "营山县",
                        "aid": "511322"
                    },

                    {
                        "id": 5,
                        "name": "蓬安县",
                        "aid": "511323"
                    },

                    {
                        "id": 6,
                        "name": "仪陇县",
                        "aid": "511324"
                    },

                    {
                        "id": 7,
                        "name": "西充县",
                        "aid": "511325"
                    },

                    {
                        "id": 8,
                        "name": "阆中市",
                        "aid": "511381"
                    },

                ]
            },

            {
                "id": 12,
                "name": "眉山市",
                "aid": "511400",
                "sub": [

                    {
                        "id": 0,
                        "name": "东坡区",
                        "aid": "511402"
                    },

                    {
                        "id": 1,
                        "name": "彭山区",
                        "aid": "511403"
                    },

                    {
                        "id": 2,
                        "name": "仁寿县",
                        "aid": "511421"
                    },

                    {
                        "id": 3,
                        "name": "洪雅县",
                        "aid": "511423"
                    },

                    {
                        "id": 4,
                        "name": "丹棱县",
                        "aid": "511424"
                    },

                    {
                        "id": 5,
                        "name": "青神县",
                        "aid": "511425"
                    },

                ]
            },

            {
                "id": 13,
                "name": "宜宾市",
                "aid": "511500",
                "sub": [

                    {
                        "id": 0,
                        "name": "翠屏区",
                        "aid": "511502"
                    },

                    {
                        "id": 1,
                        "name": "南溪区",
                        "aid": "511503"
                    },

                    {
                        "id": 2,
                        "name": "宜宾县",
                        "aid": "511521"
                    },

                    {
                        "id": 3,
                        "name": "江安县",
                        "aid": "511523"
                    },

                    {
                        "id": 4,
                        "name": "长宁县",
                        "aid": "511524"
                    },

                    {
                        "id": 5,
                        "name": "高县",
                        "aid": "511525"
                    },

                    {
                        "id": 6,
                        "name": "珙县",
                        "aid": "511526"
                    },

                    {
                        "id": 7,
                        "name": "筠连县",
                        "aid": "511527"
                    },

                    {
                        "id": 8,
                        "name": "兴文县",
                        "aid": "511528"
                    },

                    {
                        "id": 9,
                        "name": "屏山县",
                        "aid": "511529"
                    },

                ]
            },

            {
                "id": 14,
                "name": "广安市",
                "aid": "511600",
                "sub": [

                    {
                        "id": 0,
                        "name": "广安区",
                        "aid": "511602"
                    },

                    {
                        "id": 1,
                        "name": "前锋区",
                        "aid": "511603"
                    },

                    {
                        "id": 2,
                        "name": "岳池县",
                        "aid": "511621"
                    },

                    {
                        "id": 3,
                        "name": "武胜县",
                        "aid": "511622"
                    },

                    {
                        "id": 4,
                        "name": "邻水县",
                        "aid": "511623"
                    },

                    {
                        "id": 5,
                        "name": "华蓥市",
                        "aid": "511681"
                    },

                ]
            },

            {
                "id": 15,
                "name": "达州市",
                "aid": "511700",
                "sub": [

                    {
                        "id": 0,
                        "name": "通川区",
                        "aid": "511702"
                    },

                    {
                        "id": 1,
                        "name": "达川区",
                        "aid": "511703"
                    },

                    {
                        "id": 2,
                        "name": "宣汉县",
                        "aid": "511722"
                    },

                    {
                        "id": 3,
                        "name": "开江县",
                        "aid": "511723"
                    },

                    {
                        "id": 4,
                        "name": "大竹县",
                        "aid": "511724"
                    },

                    {
                        "id": 5,
                        "name": "渠县",
                        "aid": "511725"
                    },

                    {
                        "id": 6,
                        "name": "万源市",
                        "aid": "511781"
                    },

                ]
            },

            {
                "id": 16,
                "name": "雅安市",
                "aid": "511800",
                "sub": [

                    {
                        "id": 0,
                        "name": "雨城区",
                        "aid": "511802"
                    },

                    {
                        "id": 1,
                        "name": "名山区",
                        "aid": "511803"
                    },

                    {
                        "id": 2,
                        "name": "荥经县",
                        "aid": "511822"
                    },

                    {
                        "id": 3,
                        "name": "汉源县",
                        "aid": "511823"
                    },

                    {
                        "id": 4,
                        "name": "石棉县",
                        "aid": "511824"
                    },

                    {
                        "id": 5,
                        "name": "天全县",
                        "aid": "511825"
                    },

                    {
                        "id": 6,
                        "name": "芦山县",
                        "aid": "511826"
                    },

                    {
                        "id": 7,
                        "name": "宝兴县",
                        "aid": "511827"
                    },

                ]
            },

            {
                "id": 17,
                "name": "巴中市",
                "aid": "511900",
                "sub": [

                    {
                        "id": 0,
                        "name": "巴州区",
                        "aid": "511902"
                    },

                    {
                        "id": 1,
                        "name": "恩阳区",
                        "aid": "511903"
                    },

                    {
                        "id": 2,
                        "name": "通江县",
                        "aid": "511921"
                    },

                    {
                        "id": 3,
                        "name": "南江县",
                        "aid": "511922"
                    },

                    {
                        "id": 4,
                        "name": "平昌县",
                        "aid": "511923"
                    },

                ]
            },

            {
                "id": 18,
                "name": "阿坝藏族羌族自治州",
                "aid": "513200",
                "sub": [

                    {
                        "id": 0,
                        "name": "马尔康市",
                        "aid": "513201"
                    },

                    {
                        "id": 1,
                        "name": "汶川县",
                        "aid": "513221"
                    },

                    {
                        "id": 2,
                        "name": "理县",
                        "aid": "513222"
                    },

                    {
                        "id": 3,
                        "name": "茂县",
                        "aid": "513223"
                    },

                    {
                        "id": 4,
                        "name": "松潘县",
                        "aid": "513224"
                    },

                    {
                        "id": 5,
                        "name": "九寨沟县",
                        "aid": "513225"
                    },

                    {
                        "id": 6,
                        "name": "金川县",
                        "aid": "513226"
                    },

                    {
                        "id": 7,
                        "name": "小金县",
                        "aid": "513227"
                    },

                    {
                        "id": 8,
                        "name": "黑水县",
                        "aid": "513228"
                    },

                    {
                        "id": 9,
                        "name": "壤塘县",
                        "aid": "513230"
                    },

                    {
                        "id": 10,
                        "name": "阿坝县",
                        "aid": "513231"
                    },

                    {
                        "id": 11,
                        "name": "若尔盖县",
                        "aid": "513232"
                    },

                    {
                        "id": 12,
                        "name": "红原县",
                        "aid": "513233"
                    },

                ]
            },

            {
                "id": 19,
                "name": "甘孜藏族自治州",
                "aid": "513300",
                "sub": [

                    {
                        "id": 0,
                        "name": "康定市",
                        "aid": "513301"
                    },

                    {
                        "id": 1,
                        "name": "泸定县",
                        "aid": "513322"
                    },

                    {
                        "id": 2,
                        "name": "丹巴县",
                        "aid": "513323"
                    },

                    {
                        "id": 3,
                        "name": "九龙县",
                        "aid": "513324"
                    },

                    {
                        "id": 4,
                        "name": "雅江县",
                        "aid": "513325"
                    },

                    {
                        "id": 5,
                        "name": "道孚县",
                        "aid": "513326"
                    },

                    {
                        "id": 6,
                        "name": "炉霍县",
                        "aid": "513327"
                    },

                    {
                        "id": 7,
                        "name": "甘孜县",
                        "aid": "513328"
                    },

                    {
                        "id": 8,
                        "name": "新龙县",
                        "aid": "513329"
                    },

                    {
                        "id": 9,
                        "name": "德格县",
                        "aid": "513330"
                    },

                    {
                        "id": 10,
                        "name": "白玉县",
                        "aid": "513331"
                    },

                    {
                        "id": 11,
                        "name": "石渠县",
                        "aid": "513332"
                    },

                    {
                        "id": 12,
                        "name": "色达县",
                        "aid": "513333"
                    },

                    {
                        "id": 13,
                        "name": "理塘县",
                        "aid": "513334"
                    },

                    {
                        "id": 14,
                        "name": "巴塘县",
                        "aid": "513335"
                    },

                    {
                        "id": 15,
                        "name": "乡城县",
                        "aid": "513336"
                    },

                    {
                        "id": 16,
                        "name": "稻城县",
                        "aid": "513337"
                    },

                    {
                        "id": 17,
                        "name": "得荣县",
                        "aid": "513338"
                    },

                ]
            },

            {
                "id": 20,
                "name": "凉山彝族自治州",
                "aid": "513400",
                "sub": [

                    {
                        "id": 0,
                        "name": "西昌市",
                        "aid": "513401"
                    },

                    {
                        "id": 1,
                        "name": "木里藏族自治县",
                        "aid": "513422"
                    },

                    {
                        "id": 2,
                        "name": "盐源县",
                        "aid": "513423"
                    },

                    {
                        "id": 3,
                        "name": "德昌县",
                        "aid": "513424"
                    },

                    {
                        "id": 4,
                        "name": "会理县",
                        "aid": "513425"
                    },

                    {
                        "id": 5,
                        "name": "会东县",
                        "aid": "513426"
                    },

                    {
                        "id": 6,
                        "name": "宁南县",
                        "aid": "513427"
                    },

                    {
                        "id": 7,
                        "name": "普格县",
                        "aid": "513428"
                    },

                    {
                        "id": 8,
                        "name": "布拖县",
                        "aid": "513429"
                    },

                    {
                        "id": 9,
                        "name": "金阳县",
                        "aid": "513430"
                    },

                    {
                        "id": 10,
                        "name": "昭觉县",
                        "aid": "513431"
                    },

                    {
                        "id": 11,
                        "name": "喜德县",
                        "aid": "513432"
                    },

                    {
                        "id": 12,
                        "name": "冕宁县",
                        "aid": "513433"
                    },

                    {
                        "id": 13,
                        "name": "越西县",
                        "aid": "513434"
                    },

                    {
                        "id": 14,
                        "name": "甘洛县",
                        "aid": "513435"
                    },

                    {
                        "id": 15,
                        "name": "美姑县",
                        "aid": "513436"
                    },

                    {
                        "id": 16,
                        "name": "雷波县",
                        "aid": "513437"
                    },

                ]
            },

        ]
    },

    {
        "id": 23,
        "name": "贵州省",
        "aid": "520000",
        "sub": [

            {
                "id": 0,
                "name": "贵阳市",
                "aid": "520100",
                "sub": [

                    {
                        "id": 0,
                        "name": "南明区",
                        "aid": "520102"
                    },

                    {
                        "id": 1,
                        "name": "云岩区",
                        "aid": "520103"
                    },

                    {
                        "id": 2,
                        "name": "花溪区",
                        "aid": "520111"
                    },

                    {
                        "id": 3,
                        "name": "乌当区",
                        "aid": "520112"
                    },

                    {
                        "id": 4,
                        "name": "白云区",
                        "aid": "520113"
                    },

                    {
                        "id": 5,
                        "name": "观山湖区",
                        "aid": "520115"
                    },

                    {
                        "id": 6,
                        "name": "开阳县",
                        "aid": "520121"
                    },

                    {
                        "id": 7,
                        "name": "息烽县",
                        "aid": "520122"
                    },

                    {
                        "id": 8,
                        "name": "修文县",
                        "aid": "520123"
                    },

                    {
                        "id": 9,
                        "name": "清镇市",
                        "aid": "520181"
                    },

                    {
                        "id": 10,
                        "name": "贵安新区",
                        "aid": "520182"
                    },

                    {
                        "id": 11,
                        "name": "高新区",
                        "aid": "520183"
                    },

                ]
            },

            {
                "id": 1,
                "name": "六盘水市",
                "aid": "520200",
                "sub": [

                    {
                        "id": 0,
                        "name": "钟山区",
                        "aid": "520201"
                    },

                    {
                        "id": 1,
                        "name": "六枝特区",
                        "aid": "520203"
                    },

                    {
                        "id": 2,
                        "name": "水城县",
                        "aid": "520221"
                    },

                    {
                        "id": 3,
                        "name": "盘州市",
                        "aid": "520281"
                    },

                ]
            },

            {
                "id": 2,
                "name": "遵义市",
                "aid": "520300",
                "sub": [

                    {
                        "id": 0,
                        "name": "红花岗区",
                        "aid": "520302"
                    },

                    {
                        "id": 1,
                        "name": "汇川区",
                        "aid": "520303"
                    },

                    {
                        "id": 2,
                        "name": "播州区",
                        "aid": "520304"
                    },

                    {
                        "id": 3,
                        "name": "桐梓县",
                        "aid": "520322"
                    },

                    {
                        "id": 4,
                        "name": "绥阳县",
                        "aid": "520323"
                    },

                    {
                        "id": 5,
                        "name": "正安县",
                        "aid": "520324"
                    },

                    {
                        "id": 6,
                        "name": "道真仡佬族苗族自治县",
                        "aid": "520325"
                    },

                    {
                        "id": 7,
                        "name": "务川仡佬族苗族自治县",
                        "aid": "520326"
                    },

                    {
                        "id": 8,
                        "name": "凤冈县",
                        "aid": "520327"
                    },

                    {
                        "id": 9,
                        "name": "湄潭县",
                        "aid": "520328"
                    },

                    {
                        "id": 10,
                        "name": "余庆县",
                        "aid": "520329"
                    },

                    {
                        "id": 11,
                        "name": "习水县",
                        "aid": "520330"
                    },

                    {
                        "id": 12,
                        "name": "赤水市",
                        "aid": "520381"
                    },

                    {
                        "id": 13,
                        "name": "仁怀市",
                        "aid": "520382"
                    },

                ]
            },

            {
                "id": 3,
                "name": "安顺市",
                "aid": "520400",
                "sub": [

                    {
                        "id": 0,
                        "name": "西秀区",
                        "aid": "520402"
                    },

                    {
                        "id": 1,
                        "name": "平坝区",
                        "aid": "520403"
                    },

                    {
                        "id": 2,
                        "name": "普定县",
                        "aid": "520422"
                    },

                    {
                        "id": 3,
                        "name": "镇宁布依族苗族自治县",
                        "aid": "520423"
                    },

                    {
                        "id": 4,
                        "name": "关岭布依族苗族自治县",
                        "aid": "520424"
                    },

                    {
                        "id": 5,
                        "name": "紫云苗族布依族自治县",
                        "aid": "520425"
                    },

                ]
            },

            {
                "id": 4,
                "name": "毕节市",
                "aid": "520500",
                "sub": [

                    {
                        "id": 0,
                        "name": "七星关区",
                        "aid": "520502"
                    },

                    {
                        "id": 1,
                        "name": "大方县",
                        "aid": "520521"
                    },

                    {
                        "id": 2,
                        "name": "黔西县",
                        "aid": "520522"
                    },

                    {
                        "id": 3,
                        "name": "金沙县",
                        "aid": "520523"
                    },

                    {
                        "id": 4,
                        "name": "织金县",
                        "aid": "520524"
                    },

                    {
                        "id": 5,
                        "name": "纳雍县",
                        "aid": "520525"
                    },

                    {
                        "id": 6,
                        "name": "威宁彝族回族苗族自治县",
                        "aid": "520526"
                    },

                    {
                        "id": 7,
                        "name": "赫章县",
                        "aid": "520527"
                    },

                ]
            },

            {
                "id": 5,
                "name": "铜仁市",
                "aid": "520600",
                "sub": [

                    {
                        "id": 0,
                        "name": "碧江区",
                        "aid": "520602"
                    },

                    {
                        "id": 1,
                        "name": "万山区",
                        "aid": "520603"
                    },

                    {
                        "id": 2,
                        "name": "江口县",
                        "aid": "520621"
                    },

                    {
                        "id": 3,
                        "name": "玉屏侗族自治县",
                        "aid": "520622"
                    },

                    {
                        "id": 4,
                        "name": "石阡县",
                        "aid": "520623"
                    },

                    {
                        "id": 5,
                        "name": "思南县",
                        "aid": "520624"
                    },

                    {
                        "id": 6,
                        "name": "印江土家族苗族自治县",
                        "aid": "520625"
                    },

                    {
                        "id": 7,
                        "name": "德江县",
                        "aid": "520626"
                    },

                    {
                        "id": 8,
                        "name": "沿河土家族自治县",
                        "aid": "520627"
                    },

                    {
                        "id": 9,
                        "name": "松桃苗族自治县",
                        "aid": "520628"
                    },

                ]
            },

            {
                "id": 6,
                "name": "黔西南布依族苗族自治州",
                "aid": "522300",
                "sub": [

                    {
                        "id": 0,
                        "name": "兴义市 ",
                        "aid": "522301"
                    },

                    {
                        "id": 1,
                        "name": "兴仁县",
                        "aid": "522322"
                    },

                    {
                        "id": 2,
                        "name": "普安县",
                        "aid": "522323"
                    },

                    {
                        "id": 3,
                        "name": "晴隆县",
                        "aid": "522324"
                    },

                    {
                        "id": 4,
                        "name": "贞丰县",
                        "aid": "522325"
                    },

                    {
                        "id": 5,
                        "name": "望谟县",
                        "aid": "522326"
                    },

                    {
                        "id": 6,
                        "name": "册亨县",
                        "aid": "522327"
                    },

                    {
                        "id": 7,
                        "name": "安龙县",
                        "aid": "522328"
                    },

                ]
            },

            {
                "id": 7,
                "name": "黔东南苗族侗族自治州",
                "aid": "522600",
                "sub": [

                    {
                        "id": 0,
                        "name": "凯里市",
                        "aid": "522601"
                    },

                    {
                        "id": 1,
                        "name": "黄平县",
                        "aid": "522622"
                    },

                    {
                        "id": 2,
                        "name": "施秉县",
                        "aid": "522623"
                    },

                    {
                        "id": 3,
                        "name": "三穗县",
                        "aid": "522624"
                    },

                    {
                        "id": 4,
                        "name": "镇远县",
                        "aid": "522625"
                    },

                    {
                        "id": 5,
                        "name": "岑巩县",
                        "aid": "522626"
                    },

                    {
                        "id": 6,
                        "name": "天柱县",
                        "aid": "522627"
                    },

                    {
                        "id": 7,
                        "name": "锦屏县",
                        "aid": "522628"
                    },

                    {
                        "id": 8,
                        "name": "剑河县",
                        "aid": "522629"
                    },

                    {
                        "id": 9,
                        "name": "台江县",
                        "aid": "522630"
                    },

                    {
                        "id": 10,
                        "name": "黎平县",
                        "aid": "522631"
                    },

                    {
                        "id": 11,
                        "name": "榕江县",
                        "aid": "522632"
                    },

                    {
                        "id": 12,
                        "name": "从江县",
                        "aid": "522633"
                    },

                    {
                        "id": 13,
                        "name": "雷山县",
                        "aid": "522634"
                    },

                    {
                        "id": 14,
                        "name": "麻江县",
                        "aid": "522635"
                    },

                    {
                        "id": 15,
                        "name": "丹寨县",
                        "aid": "522636"
                    },

                ]
            },

            {
                "id": 8,
                "name": "黔南布依族苗族自治州",
                "aid": "522700",
                "sub": [

                    {
                        "id": 0,
                        "name": "都匀市",
                        "aid": "522701"
                    },

                    {
                        "id": 1,
                        "name": "福泉市",
                        "aid": "522702"
                    },

                    {
                        "id": 2,
                        "name": "荔波县",
                        "aid": "522722"
                    },

                    {
                        "id": 3,
                        "name": "贵定县",
                        "aid": "522723"
                    },

                    {
                        "id": 4,
                        "name": "瓮安县",
                        "aid": "522725"
                    },

                    {
                        "id": 5,
                        "name": "独山县",
                        "aid": "522726"
                    },

                    {
                        "id": 6,
                        "name": "平塘县",
                        "aid": "522727"
                    },

                    {
                        "id": 7,
                        "name": "罗甸县",
                        "aid": "522728"
                    },

                    {
                        "id": 8,
                        "name": "长顺县",
                        "aid": "522729"
                    },

                    {
                        "id": 9,
                        "name": "龙里县",
                        "aid": "522730"
                    },

                    {
                        "id": 10,
                        "name": "惠水县",
                        "aid": "522731"
                    },

                    {
                        "id": 11,
                        "name": "三都水族自治县",
                        "aid": "522732"
                    },

                ]
            },

        ]
    },

    {
        "id": 24,
        "name": "云南省",
        "aid": "530000",
        "sub": [

            {
                "id": 0,
                "name": "昆明市",
                "aid": "530100",
                "sub": [

                    {
                        "id": 0,
                        "name": "五华区",
                        "aid": "530102"
                    },

                    {
                        "id": 1,
                        "name": "盘龙区",
                        "aid": "530103"
                    },

                    {
                        "id": 2,
                        "name": "官渡区",
                        "aid": "530111"
                    },

                    {
                        "id": 3,
                        "name": "西山区",
                        "aid": "530112"
                    },

                    {
                        "id": 4,
                        "name": "东川区",
                        "aid": "530113"
                    },

                    {
                        "id": 5,
                        "name": "呈贡区",
                        "aid": "530114"
                    },

                    {
                        "id": 6,
                        "name": "晋宁区",
                        "aid": "530115"
                    },

                    {
                        "id": 7,
                        "name": "富民县",
                        "aid": "530124"
                    },

                    {
                        "id": 8,
                        "name": "宜良县",
                        "aid": "530125"
                    },

                    {
                        "id": 9,
                        "name": "石林彝族自治县",
                        "aid": "530126"
                    },

                    {
                        "id": 10,
                        "name": "嵩明县",
                        "aid": "530127"
                    },

                    {
                        "id": 11,
                        "name": "禄劝彝族苗族自治县",
                        "aid": "530128"
                    },

                    {
                        "id": 12,
                        "name": "寻甸回族彝族自治县 ",
                        "aid": "530129"
                    },

                    {
                        "id": 13,
                        "name": "安宁市",
                        "aid": "530181"
                    },

                    {
                        "id": 14,
                        "name": "滇中新区",
                        "aid": "530182"
                    },

                    {
                        "id": 15,
                        "name": "高新区",
                        "aid": "530183"
                    },

                ]
            },

            {
                "id": 5,
                "name": "丽江市",
                "aid": "530700",
                "sub": [

                    {
                        "id": 0,
                        "name": "古城区",
                        "aid": "530702"
                    },

                    {
                        "id": 1,
                        "name": "玉龙纳西族自治县",
                        "aid": "530721"
                    },

                    {
                        "id": 2,
                        "name": "永胜县",
                        "aid": "530722"
                    },

                    {
                        "id": 3,
                        "name": "华坪县",
                        "aid": "530723"
                    },

                    {
                        "id": 4,
                        "name": "宁蒗彝族自治县",
                        "aid": "530724"
                    },

                ]
            },

            {
                "id": 1,
                "name": "曲靖市",
                "aid": "530300",
                "sub": [

                    {
                        "id": 0,
                        "name": "麒麟区",
                        "aid": "530302"
                    },

                    {
                        "id": 1,
                        "name": "沾益区",
                        "aid": "530303"
                    },

                    {
                        "id": 2,
                        "name": "马龙县",
                        "aid": "530321"
                    },

                    {
                        "id": 3,
                        "name": "陆良县",
                        "aid": "530322"
                    },

                    {
                        "id": 4,
                        "name": "师宗县",
                        "aid": "530323"
                    },

                    {
                        "id": 5,
                        "name": "罗平县",
                        "aid": "530324"
                    },

                    {
                        "id": 6,
                        "name": "富源县",
                        "aid": "530325"
                    },

                    {
                        "id": 7,
                        "name": "会泽县",
                        "aid": "530326"
                    },

                    {
                        "id": 8,
                        "name": "宣威市",
                        "aid": "530381"
                    },

                ]
            },

            {
                "id": 2,
                "name": "玉溪市",
                "aid": "530400",
                "sub": [

                    {
                        "id": 0,
                        "name": "红塔区",
                        "aid": "530402"
                    },

                    {
                        "id": 1,
                        "name": "江川区",
                        "aid": "530403"
                    },

                    {
                        "id": 2,
                        "name": "澄江县",
                        "aid": "530422"
                    },

                    {
                        "id": 3,
                        "name": "通海县",
                        "aid": "530423"
                    },

                    {
                        "id": 4,
                        "name": "华宁县",
                        "aid": "530424"
                    },

                    {
                        "id": 5,
                        "name": "易门县",
                        "aid": "530425"
                    },

                    {
                        "id": 6,
                        "name": "峨山彝族自治县",
                        "aid": "530426"
                    },

                    {
                        "id": 7,
                        "name": "新平彝族傣族自治县",
                        "aid": "530427"
                    },

                    {
                        "id": 8,
                        "name": "元江哈尼族彝族傣族自治县",
                        "aid": "530428"
                    },

                ]
            },

            {
                "id": 3,
                "name": "保山市",
                "aid": "530500",
                "sub": [

                    {
                        "id": 0,
                        "name": "隆阳区",
                        "aid": "530502"
                    },

                    {
                        "id": 1,
                        "name": "施甸县",
                        "aid": "530521"
                    },

                    {
                        "id": 2,
                        "name": "龙陵县",
                        "aid": "530523"
                    },

                    {
                        "id": 3,
                        "name": "昌宁县",
                        "aid": "530524"
                    },

                    {
                        "id": 4,
                        "name": "腾冲市",
                        "aid": "530581"
                    },

                ]
            },

            {
                "id": 4,
                "name": "昭通市",
                "aid": "530600",
                "sub": [

                    {
                        "id": 0,
                        "name": "昭阳区",
                        "aid": "530602"
                    },

                    {
                        "id": 1,
                        "name": "鲁甸县",
                        "aid": "530621"
                    },

                    {
                        "id": 2,
                        "name": "巧家县",
                        "aid": "530622"
                    },

                    {
                        "id": 3,
                        "name": "盐津县",
                        "aid": "530623"
                    },

                    {
                        "id": 4,
                        "name": "大关县",
                        "aid": "530624"
                    },

                    {
                        "id": 5,
                        "name": "永善县",
                        "aid": "530625"
                    },

                    {
                        "id": 6,
                        "name": "绥江县",
                        "aid": "530626"
                    },

                    {
                        "id": 7,
                        "name": "镇雄县",
                        "aid": "530627"
                    },

                    {
                        "id": 8,
                        "name": "彝良县",
                        "aid": "530628"
                    },

                    {
                        "id": 9,
                        "name": "威信县",
                        "aid": "530629"
                    },

                    {
                        "id": 10,
                        "name": "水富县",
                        "aid": "530630"
                    },

                ]
            },

            {
                "id": 6,
                "name": "普洱市",
                "aid": "530800",
                "sub": [

                    {
                        "id": 0,
                        "name": "思茅区",
                        "aid": "530802"
                    },

                    {
                        "id": 1,
                        "name": "宁洱哈尼族彝族自治县",
                        "aid": "530821"
                    },

                    {
                        "id": 2,
                        "name": "墨江哈尼族自治县",
                        "aid": "530822"
                    },

                    {
                        "id": 3,
                        "name": "景东彝族自治县",
                        "aid": "530823"
                    },

                    {
                        "id": 4,
                        "name": "景谷傣族彝族自治县",
                        "aid": "530824"
                    },

                    {
                        "id": 5,
                        "name": "镇沅彝族哈尼族拉祜族自治县",
                        "aid": "530825"
                    },

                    {
                        "id": 6,
                        "name": "江城哈尼族彝族自治县",
                        "aid": "530826"
                    },

                    {
                        "id": 7,
                        "name": "孟连傣族拉祜族佤族自治县",
                        "aid": "530827"
                    },

                    {
                        "id": 8,
                        "name": "澜沧拉祜族自治县",
                        "aid": "530828"
                    },

                    {
                        "id": 9,
                        "name": "西盟佤族自治县",
                        "aid": "530829"
                    },

                ]
            },

            {
                "id": 7,
                "name": "临沧市",
                "aid": "530900",
                "sub": [

                    {
                        "id": 0,
                        "name": "临翔区",
                        "aid": "530902"
                    },

                    {
                        "id": 1,
                        "name": "凤庆县",
                        "aid": "530921"
                    },

                    {
                        "id": 2,
                        "name": "云县",
                        "aid": "530922"
                    },

                    {
                        "id": 3,
                        "name": "永德县",
                        "aid": "530923"
                    },

                    {
                        "id": 4,
                        "name": "镇康县",
                        "aid": "530924"
                    },

                    {
                        "id": 5,
                        "name": "双江拉祜族佤族布朗族傣族自治县",
                        "aid": "530925"
                    },

                    {
                        "id": 6,
                        "name": "耿马傣族佤族自治县",
                        "aid": "530926"
                    },

                    {
                        "id": 7,
                        "name": "沧源佤族自治县",
                        "aid": "530927"
                    },

                ]
            },

            {
                "id": 8,
                "name": "楚雄彝族自治州",
                "aid": "532300",
                "sub": [

                    {
                        "id": 0,
                        "name": "楚雄市",
                        "aid": "532301"
                    },

                    {
                        "id": 2,
                        "name": "牟定县",
                        "aid": "532323"
                    },

                    {
                        "id": 1,
                        "name": "双柏县",
                        "aid": "532322"
                    },

                    {
                        "id": 3,
                        "name": "南华县",
                        "aid": "532324"
                    },

                    {
                        "id": 4,
                        "name": "姚安县",
                        "aid": "532325"
                    },

                    {
                        "id": 5,
                        "name": "大姚县",
                        "aid": "532326"
                    },

                    {
                        "id": 6,
                        "name": "永仁县",
                        "aid": "532327"
                    },

                    {
                        "id": 7,
                        "name": "元谋县",
                        "aid": "532328"
                    },

                    {
                        "id": 8,
                        "name": "武定县",
                        "aid": "532329"
                    },

                    {
                        "id": 9,
                        "name": "禄丰县",
                        "aid": "532331"
                    },

                ]
            },

            {
                "id": 9,
                "name": "红河哈尼族彝族自治州",
                "aid": "532500",
                "sub": [

                    {
                        "id": 0,
                        "name": "个旧市",
                        "aid": "532501"
                    },

                    {
                        "id": 1,
                        "name": "开远市",
                        "aid": "532502"
                    },

                    {
                        "id": 2,
                        "name": "蒙自市",
                        "aid": "532503"
                    },

                    {
                        "id": 3,
                        "name": "弥勒市",
                        "aid": "532504"
                    },

                    {
                        "id": 4,
                        "name": "屏边苗族自治县",
                        "aid": "532523"
                    },

                    {
                        "id": 5,
                        "name": "建水县",
                        "aid": "532524"
                    },

                    {
                        "id": 6,
                        "name": "石屏县",
                        "aid": "532525"
                    },

                    {
                        "id": 7,
                        "name": "泸西县",
                        "aid": "532527"
                    },

                    {
                        "id": 8,
                        "name": "元阳县",
                        "aid": "532528"
                    },

                    {
                        "id": 9,
                        "name": "红河县",
                        "aid": "532529"
                    },

                    {
                        "id": 10,
                        "name": "金平苗族瑶族傣族自治县",
                        "aid": "532530"
                    },

                    {
                        "id": 11,
                        "name": "绿春县",
                        "aid": "532531"
                    },

                    {
                        "id": 12,
                        "name": "河口瑶族自治县",
                        "aid": "532532"
                    },

                ]
            },

            {
                "id": 10,
                "name": "文山壮族苗族自治州",
                "aid": "532600",
                "sub": [

                    {
                        "id": 0,
                        "name": "文山市",
                        "aid": "532601"
                    },

                    {
                        "id": 1,
                        "name": "砚山县",
                        "aid": "532622"
                    },

                    {
                        "id": 2,
                        "name": "西畴县",
                        "aid": "532623"
                    },

                    {
                        "id": 3,
                        "name": "麻栗坡县",
                        "aid": "532624"
                    },

                    {
                        "id": 4,
                        "name": "马关县",
                        "aid": "532625"
                    },

                    {
                        "id": 5,
                        "name": "丘北县",
                        "aid": "532626"
                    },

                    {
                        "id": 6,
                        "name": "广南县",
                        "aid": "532627"
                    },

                    {
                        "id": 7,
                        "name": "富宁县",
                        "aid": "532628"
                    },

                ]
            },

            {
                "id": 11,
                "name": "西双版纳傣族自治州",
                "aid": "532800",
                "sub": [

                    {
                        "id": 0,
                        "name": "景洪市",
                        "aid": "532801"
                    },

                    {
                        "id": 1,
                        "name": "勐海县",
                        "aid": "532822"
                    },

                    {
                        "id": 2,
                        "name": "勐腊县",
                        "aid": "532823"
                    },

                ]
            },

            {
                "id": 12,
                "name": "大理白族自治州",
                "aid": "532900",
                "sub": [

                    {
                        "id": 0,
                        "name": "大理市",
                        "aid": "532901"
                    },

                    {
                        "id": 1,
                        "name": "漾濞彝族自治县",
                        "aid": "532922"
                    },

                    {
                        "id": 2,
                        "name": "祥云县",
                        "aid": "532923"
                    },

                    {
                        "id": 3,
                        "name": "宾川县",
                        "aid": "532924"
                    },

                    {
                        "id": 4,
                        "name": "弥渡县",
                        "aid": "532925"
                    },

                    {
                        "id": 5,
                        "name": "南涧彝族自治县",
                        "aid": "532926"
                    },

                    {
                        "id": 6,
                        "name": "巍山彝族回族自治县",
                        "aid": "532927"
                    },

                    {
                        "id": 7,
                        "name": "永平县",
                        "aid": "532928"
                    },

                    {
                        "id": 8,
                        "name": "云龙县",
                        "aid": "532929"
                    },

                    {
                        "id": 9,
                        "name": "洱源县",
                        "aid": "532930"
                    },

                    {
                        "id": 10,
                        "name": "剑川县",
                        "aid": "532931"
                    },

                    {
                        "id": 11,
                        "name": "鹤庆县",
                        "aid": "532932"
                    },

                ]
            },

            {
                "id": 13,
                "name": "德宏傣族景颇族自治州",
                "aid": "533100",
                "sub": [

                    {
                        "id": 0,
                        "name": "瑞丽市",
                        "aid": "533102"
                    },

                    {
                        "id": 1,
                        "name": "芒市",
                        "aid": "533103"
                    },

                    {
                        "id": 2,
                        "name": "梁河县",
                        "aid": "533122"
                    },

                    {
                        "id": 3,
                        "name": "盈江县",
                        "aid": "533123"
                    },

                    {
                        "id": 4,
                        "name": "陇川县",
                        "aid": "533124"
                    },

                ]
            },

            {
                "id": 14,
                "name": "怒江傈僳族自治州",
                "aid": "533300",
                "sub": [

                    {
                        "id": 0,
                        "name": "泸水市",
                        "aid": "533301"
                    },

                    {
                        "id": 1,
                        "name": "福贡县",
                        "aid": "533323"
                    },

                    {
                        "id": 2,
                        "name": "贡山独龙族怒族自治县",
                        "aid": "533324"
                    },

                    {
                        "id": 3,
                        "name": "兰坪白族普米族自治县",
                        "aid": "533325"
                    },

                ]
            },

            {
                "id": 15,
                "name": "迪庆藏族自治州",
                "aid": "533400",
                "sub": [

                    {
                        "id": 0,
                        "name": "香格里拉市",
                        "aid": "533401"
                    },

                    {
                        "id": 1,
                        "name": "德钦县",
                        "aid": "533422"
                    },

                    {
                        "id": 2,
                        "name": "维西傈僳族自治县",
                        "aid": "533423"
                    },

                ]
            },

        ]
    },

    {
        "id": 25,
        "name": "西藏自治区",
        "aid": "540000",
        "sub": [

            {
                "id": 0,
                "name": "拉萨市",
                "aid": "540100",
                "sub": [

                    {
                        "id": 0,
                        "name": "城关区",
                        "aid": "540102"
                    },

                    {
                        "id": 1,
                        "name": "堆龙德庆区",
                        "aid": "540103"
                    },

                    {
                        "id": 2,
                        "name": "达孜区",
                        "aid": "540104"
                    },

                    {
                        "id": 3,
                        "name": "林周县",
                        "aid": "540121"
                    },

                    {
                        "id": 4,
                        "name": "当雄县",
                        "aid": "540122"
                    },

                    {
                        "id": 5,
                        "name": "尼木县",
                        "aid": "540123"
                    },

                    {
                        "id": 6,
                        "name": "曲水县",
                        "aid": "540124"
                    },

                    {
                        "id": 7,
                        "name": "墨竹工卡县",
                        "aid": "540127"
                    },

                ]
            },

            {
                "id": 1,
                "name": "日喀则市",
                "aid": "540200",
                "sub": [

                    {
                        "id": 0,
                        "name": "桑珠孜区",
                        "aid": "540202"
                    },

                    {
                        "id": 1,
                        "name": "南木林县",
                        "aid": "540221"
                    },

                    {
                        "id": 2,
                        "name": "江孜县",
                        "aid": "540222"
                    },

                    {
                        "id": 3,
                        "name": "定日县",
                        "aid": "540223"
                    },

                    {
                        "id": 4,
                        "name": "萨迦县",
                        "aid": "540224"
                    },

                    {
                        "id": 5,
                        "name": "拉孜县",
                        "aid": "540225"
                    },

                    {
                        "id": 6,
                        "name": "昂仁县",
                        "aid": "540226"
                    },

                    {
                        "id": 7,
                        "name": "谢通门县",
                        "aid": "540227"
                    },

                    {
                        "id": 8,
                        "name": "白朗县",
                        "aid": "540228"
                    },

                    {
                        "id": 9,
                        "name": "仁布县",
                        "aid": "540229"
                    },

                    {
                        "id": 10,
                        "name": "康马县",
                        "aid": "540230"
                    },

                    {
                        "id": 11,
                        "name": "定结县",
                        "aid": "540231"
                    },

                    {
                        "id": 12,
                        "name": "仲巴县",
                        "aid": "540232"
                    },

                    {
                        "id": 13,
                        "name": "亚东县",
                        "aid": "540233"
                    },

                    {
                        "id": 14,
                        "name": "吉隆县",
                        "aid": "540234"
                    },

                    {
                        "id": 15,
                        "name": "聂拉木县",
                        "aid": "540235"
                    },

                    {
                        "id": 16,
                        "name": "萨嘎县",
                        "aid": "540236"
                    },

                    {
                        "id": 17,
                        "name": "岗巴县",
                        "aid": "540237"
                    },

                ]
            },

            {
                "id": 2,
                "name": "昌都市",
                "aid": "540300",
                "sub": [

                    {
                        "id": 0,
                        "name": "卡若区",
                        "aid": "540302"
                    },

                    {
                        "id": 1,
                        "name": "江达县",
                        "aid": "540321"
                    },

                    {
                        "id": 2,
                        "name": "贡觉县",
                        "aid": "540322"
                    },

                    {
                        "id": 3,
                        "name": "类乌齐县",
                        "aid": "540323"
                    },

                    {
                        "id": 4,
                        "name": "丁青县",
                        "aid": "540324"
                    },

                    {
                        "id": 5,
                        "name": "察雅县",
                        "aid": "540325"
                    },

                    {
                        "id": 6,
                        "name": "八宿县",
                        "aid": "540326"
                    },

                    {
                        "id": 7,
                        "name": "左贡县",
                        "aid": "540327"
                    },

                    {
                        "id": 8,
                        "name": "芒康县",
                        "aid": "540328"
                    },

                    {
                        "id": 9,
                        "name": "洛隆县",
                        "aid": "540329"
                    },

                    {
                        "id": 10,
                        "name": "边坝县",
                        "aid": "540330"
                    },

                ]
            },

            {
                "id": 3,
                "name": "林芝市",
                "aid": "540400",
                "sub": [

                    {
                        "id": 0,
                        "name": "巴宜区",
                        "aid": "540402"
                    },

                    {
                        "id": 1,
                        "name": "工布江达县",
                        "aid": "540421"
                    },

                    {
                        "id": 2,
                        "name": "米林县",
                        "aid": "540422"
                    },

                    {
                        "id": 3,
                        "name": "墨脱县",
                        "aid": "540423"
                    },

                    {
                        "id": 4,
                        "name": "波密县",
                        "aid": "540424"
                    },

                    {
                        "id": 5,
                        "name": "察隅县",
                        "aid": "540425"
                    },

                    {
                        "id": 6,
                        "name": "朗县",
                        "aid": "540426"
                    },

                ]
            },

            {
                "id": 4,
                "name": "山南市",
                "aid": "540500",
                "sub": [

                    {
                        "id": 0,
                        "name": "乃东区",
                        "aid": "540502"
                    },

                    {
                        "id": 1,
                        "name": "扎囊县",
                        "aid": "540521"
                    },

                    {
                        "id": 2,
                        "name": "贡嘎县",
                        "aid": "540522"
                    },

                    {
                        "id": 3,
                        "name": "桑日县",
                        "aid": "540523"
                    },

                    {
                        "id": 4,
                        "name": "琼结县",
                        "aid": "540524"
                    },

                    {
                        "id": 5,
                        "name": "曲松县",
                        "aid": "540525"
                    },

                    {
                        "id": 6,
                        "name": "措美县",
                        "aid": "540526"
                    },

                    {
                        "id": 7,
                        "name": "洛扎县",
                        "aid": "540527"
                    },

                    {
                        "id": 8,
                        "name": "加查县",
                        "aid": "540528"
                    },

                    {
                        "id": 9,
                        "name": "隆子县",
                        "aid": "540529"
                    },

                    {
                        "id": 10,
                        "name": "错那县",
                        "aid": "540530"
                    },

                    {
                        "id": 11,
                        "name": "浪卡子县",
                        "aid": "540531"
                    },

                ]
            },

            {
                "id": 5,
                "name": "那曲市",
                "aid": "540600",
                "sub": [

                    {
                        "id": 0,
                        "name": "色尼区",
                        "aid": "540602"
                    },

                    {
                        "id": 1,
                        "name": "嘉黎县",
                        "aid": "540621"
                    },

                    {
                        "id": 2,
                        "name": "比如县",
                        "aid": "540622"
                    },

                    {
                        "id": 3,
                        "name": "聂荣县",
                        "aid": "540623"
                    },

                    {
                        "id": 4,
                        "name": "安多县",
                        "aid": "540624"
                    },

                    {
                        "id": 5,
                        "name": "申扎县",
                        "aid": "540625"
                    },

                    {
                        "id": 6,
                        "name": "索县",
                        "aid": "540626"
                    },

                    {
                        "id": 7,
                        "name": "班戈县",
                        "aid": "540627"
                    },

                    {
                        "id": 8,
                        "name": "巴青县",
                        "aid": "540628"
                    },

                    {
                        "id": 9,
                        "name": "尼玛县",
                        "aid": "540629"
                    },

                    {
                        "id": 10,
                        "name": "双湖县",
                        "aid": "540630"
                    },

                ]
            },

            {
                "id": 6,
                "name": "阿里地区",
                "aid": "542500",
                "sub": [

                    {
                        "id": 0,
                        "name": "普兰县",
                        "aid": "542521"
                    },

                    {
                        "id": 1,
                        "name": "札达县",
                        "aid": "542522"
                    },

                    {
                        "id": 2,
                        "name": "噶尔县",
                        "aid": "542523"
                    },

                    {
                        "id": 3,
                        "name": "日土县",
                        "aid": "542524"
                    },

                    {
                        "id": 4,
                        "name": "革吉县",
                        "aid": "542525"
                    },

                    {
                        "id": 5,
                        "name": "改则县",
                        "aid": "542526"
                    },

                    {
                        "id": 6,
                        "name": "措勤县",
                        "aid": "542527"
                    },

                ]
            },

        ]
    },

    {
        "id": 26,
        "name": "陕西省",
        "aid": "610000",
        "sub": [

            {
                "id": 0,
                "name": "西安市",
                "aid": "610100",
                "sub": [

                    {
                        "id": 0,
                        "name": "新城区",
                        "aid": "610102"
                    },

                    {
                        "id": 1,
                        "name": "碑林区",
                        "aid": "610103"
                    },

                    {
                        "id": 2,
                        "name": "莲湖区",
                        "aid": "610104"
                    },

                    {
                        "id": 3,
                        "name": "灞桥区",
                        "aid": "610111"
                    },

                    {
                        "id": 4,
                        "name": "未央区",
                        "aid": "610112"
                    },

                    {
                        "id": 5,
                        "name": "雁塔区",
                        "aid": "610113"
                    },

                    {
                        "id": 6,
                        "name": "阎良区",
                        "aid": "610114"
                    },

                    {
                        "id": 7,
                        "name": "临潼区",
                        "aid": "610115"
                    },

                    {
                        "id": 8,
                        "name": "长安区",
                        "aid": "610116"
                    },

                    {
                        "id": 9,
                        "name": "高陵区",
                        "aid": "610117"
                    },

                    {
                        "id": 10,
                        "name": "鄠邑区",
                        "aid": "610118"
                    },

                    {
                        "id": 11,
                        "name": "蓝田县",
                        "aid": "610122"
                    },

                    {
                        "id": 12,
                        "name": "周至县",
                        "aid": "610124"
                    },

                    {
                        "id": 13,
                        "name": "西咸新区",
                        "aid": "610125"
                    },

                    {
                        "id": 14,
                        "name": "曲江新区",
                        "aid": "610127"
                    },

                    {
                        "id": 15,
                        "name": "高新区",
                        "aid": "610128"
                    },

                ]
            },

            {
                "id": 1,
                "name": "铜川市",
                "aid": "610200",
                "sub": [

                    {
                        "id": 0,
                        "name": "王益区",
                        "aid": "610202"
                    },

                    {
                        "id": 1,
                        "name": "印台区",
                        "aid": "610203"
                    },

                    {
                        "id": 2,
                        "name": "耀州区",
                        "aid": "610204"
                    },

                    {
                        "id": 3,
                        "name": "宜君县",
                        "aid": "610222"
                    },

                ]
            },

            {
                "id": 2,
                "name": "宝鸡市",
                "aid": "610300",
                "sub": [

                    {
                        "id": 0,
                        "name": "渭滨区",
                        "aid": "610302"
                    },

                    {
                        "id": 1,
                        "name": "金台区",
                        "aid": "610303"
                    },

                    {
                        "id": 2,
                        "name": "陈仓区",
                        "aid": "610304"
                    },

                    {
                        "id": 3,
                        "name": "凤翔县",
                        "aid": "610322"
                    },

                    {
                        "id": 4,
                        "name": "岐山县",
                        "aid": "610323"
                    },

                    {
                        "id": 5,
                        "name": "扶风县",
                        "aid": "610324"
                    },

                    {
                        "id": 6,
                        "name": "眉县",
                        "aid": "610326"
                    },

                    {
                        "id": 7,
                        "name": "陇县",
                        "aid": "610327"
                    },

                    {
                        "id": 8,
                        "name": "千阳县",
                        "aid": "610328"
                    },

                    {
                        "id": 9,
                        "name": "麟游县",
                        "aid": "610329"
                    },

                    {
                        "id": 10,
                        "name": "凤县",
                        "aid": "610330"
                    },

                    {
                        "id": 11,
                        "name": "太白县",
                        "aid": "610331"
                    },

                    {
                        "id": 12,
                        "name": "高新区",
                        "aid": "610332"
                    },

                ]
            },

            {
                "id": 3,
                "name": "咸阳市",
                "aid": "610400",
                "sub": [

                    {
                        "id": 0,
                        "name": "秦都区",
                        "aid": "610402"
                    },

                    {
                        "id": 1,
                        "name": "杨陵区",
                        "aid": "610403"
                    },

                    {
                        "id": 2,
                        "name": "渭城区",
                        "aid": "610404"
                    },

                    {
                        "id": 3,
                        "name": "三原县",
                        "aid": "610422"
                    },

                    {
                        "id": 4,
                        "name": "泾阳县",
                        "aid": "610423"
                    },

                    {
                        "id": 5,
                        "name": "乾县",
                        "aid": "610424"
                    },

                    {
                        "id": 6,
                        "name": "礼泉县",
                        "aid": "610425"
                    },

                    {
                        "id": 7,
                        "name": "永寿县",
                        "aid": "610426"
                    },

                    {
                        "id": 8,
                        "name": "彬县",
                        "aid": "610427"
                    },

                    {
                        "id": 9,
                        "name": "长武县",
                        "aid": "610428"
                    },

                    {
                        "id": 10,
                        "name": "旬邑县",
                        "aid": "610429"
                    },

                    {
                        "id": 11,
                        "name": "淳化县",
                        "aid": "610430"
                    },

                    {
                        "id": 12,
                        "name": "武功县",
                        "aid": "610431"
                    },

                    {
                        "id": 13,
                        "name": "兴平市",
                        "aid": "610481"
                    },

                    {
                        "id": 14,
                        "name": "高新区",
                        "aid": "610482"
                    },

                ]
            },

            {
                "id": 4,
                "name": "渭南市",
                "aid": "610500",
                "sub": [

                    {
                        "id": 0,
                        "name": "临渭区",
                        "aid": "610502"
                    },

                    {
                        "id": 1,
                        "name": "华州区",
                        "aid": "610503"
                    },

                    {
                        "id": 2,
                        "name": "潼关县",
                        "aid": "610522"
                    },

                    {
                        "id": 3,
                        "name": "大荔县",
                        "aid": "610523"
                    },

                    {
                        "id": 4,
                        "name": "合阳县",
                        "aid": "610524"
                    },

                    {
                        "id": 5,
                        "name": "澄城县",
                        "aid": "610525"
                    },

                    {
                        "id": 6,
                        "name": "蒲城县",
                        "aid": "610526"
                    },

                    {
                        "id": 7,
                        "name": "白水县",
                        "aid": "610527"
                    },

                    {
                        "id": 8,
                        "name": "富平县",
                        "aid": "610528"
                    },

                    {
                        "id": 9,
                        "name": "韩城市",
                        "aid": "610581"
                    },

                    {
                        "id": 10,
                        "name": "华阴市",
                        "aid": "610582"
                    },

                ]
            },

            {
                "id": 5,
                "name": "延安市",
                "aid": "610600",
                "sub": [

                    {
                        "id": 0,
                        "name": "宝塔区",
                        "aid": "610602"
                    },

                    {
                        "id": 1,
                        "name": "安塞区",
                        "aid": "610603"
                    },

                    {
                        "id": 2,
                        "name": "延长县",
                        "aid": "610621"
                    },

                    {
                        "id": 3,
                        "name": "延川县",
                        "aid": "610622"
                    },

                    {
                        "id": 4,
                        "name": "子长县",
                        "aid": "610623"
                    },

                    {
                        "id": 5,
                        "name": "志丹县",
                        "aid": "610625"
                    },

                    {
                        "id": 6,
                        "name": "吴起县",
                        "aid": "610626"
                    },

                    {
                        "id": 7,
                        "name": "甘泉县",
                        "aid": "610627"
                    },

                    {
                        "id": 8,
                        "name": "富县",
                        "aid": "610628"
                    },

                    {
                        "id": 9,
                        "name": "洛川县",
                        "aid": "610629"
                    },

                    {
                        "id": 10,
                        "name": "宜川县",
                        "aid": "610630"
                    },

                    {
                        "id": 11,
                        "name": "黄龙县",
                        "aid": "610631"
                    },

                    {
                        "id": 12,
                        "name": "黄陵县",
                        "aid": "610632"
                    },

                ]
            },

            {
                "id": 6,
                "name": "汉中市",
                "aid": "610700",
                "sub": [

                    {
                        "id": 0,
                        "name": "汉台区",
                        "aid": "610702"
                    },

                    {
                        "id": 1,
                        "name": "南郑区",
                        "aid": "610703"
                    },

                    {
                        "id": 2,
                        "name": "城固县",
                        "aid": "610722"
                    },

                    {
                        "id": 3,
                        "name": "洋县",
                        "aid": "610723"
                    },

                    {
                        "id": 4,
                        "name": "西乡县",
                        "aid": "610724"
                    },

                    {
                        "id": 5,
                        "name": "勉县",
                        "aid": "610725"
                    },

                    {
                        "id": 6,
                        "name": "宁强县",
                        "aid": "610726"
                    },

                    {
                        "id": 7,
                        "name": "略阳县",
                        "aid": "610727"
                    },

                    {
                        "id": 8,
                        "name": "镇巴县",
                        "aid": "610728"
                    },

                    {
                        "id": 9,
                        "name": "留坝县",
                        "aid": "610729"
                    },

                    {
                        "id": 10,
                        "name": "佛坪县",
                        "aid": "610730"
                    },

                ]
            },

            {
                "id": 7,
                "name": "榆林市",
                "aid": "610800",
                "sub": [

                    {
                        "id": 0,
                        "name": "榆阳区",
                        "aid": "610802"
                    },

                    {
                        "id": 1,
                        "name": "横山区",
                        "aid": "610803"
                    },

                    {
                        "id": 2,
                        "name": "府谷县",
                        "aid": "610822"
                    },

                    {
                        "id": 3,
                        "name": "靖边县",
                        "aid": "610824"
                    },

                    {
                        "id": 4,
                        "name": "定边县",
                        "aid": "610825"
                    },

                    {
                        "id": 5,
                        "name": "绥德县",
                        "aid": "610826"
                    },

                    {
                        "id": 6,
                        "name": "米脂县",
                        "aid": "610827"
                    },

                    {
                        "id": 7,
                        "name": "佳县",
                        "aid": "610828"
                    },

                    {
                        "id": 8,
                        "name": "吴堡县",
                        "aid": "610829"
                    },

                    {
                        "id": 9,
                        "name": "清涧县",
                        "aid": "610830"
                    },

                    {
                        "id": 10,
                        "name": "子洲县",
                        "aid": "610831"
                    },

                    {
                        "id": 11,
                        "name": "神木市",
                        "aid": "610881"
                    },

                ]
            },

            {
                "id": 8,
                "name": "安康市",
                "aid": "610900",
                "sub": [

                    {
                        "id": 0,
                        "name": "汉滨区",
                        "aid": "610902"
                    },

                    {
                        "id": 1,
                        "name": "汉阴县",
                        "aid": "610921"
                    },

                    {
                        "id": 2,
                        "name": "石泉县",
                        "aid": "610922"
                    },

                    {
                        "id": 3,
                        "name": "宁陕县",
                        "aid": "610923"
                    },

                    {
                        "id": 4,
                        "name": "紫阳县",
                        "aid": "610924"
                    },

                    {
                        "id": 5,
                        "name": "岚皋县",
                        "aid": "610925"
                    },

                    {
                        "id": 6,
                        "name": "平利县",
                        "aid": "610926"
                    },

                    {
                        "id": 7,
                        "name": "镇坪县",
                        "aid": "610927"
                    },

                    {
                        "id": 8,
                        "name": "旬阳县",
                        "aid": "610928"
                    },

                    {
                        "id": 9,
                        "name": "白河县",
                        "aid": "610929"
                    },

                ]
            },

            {
                "id": 9,
                "name": "商洛市",
                "aid": "611000",
                "sub": [

                    {
                        "id": 0,
                        "name": "商州区",
                        "aid": "611002"
                    },

                    {
                        "id": 1,
                        "name": "洛南县",
                        "aid": "611021"
                    },

                    {
                        "id": 2,
                        "name": "丹凤县",
                        "aid": "611022"
                    },

                    {
                        "id": 3,
                        "name": "商南县",
                        "aid": "611023"
                    },

                    {
                        "id": 4,
                        "name": "山阳县",
                        "aid": "611024"
                    },

                    {
                        "id": 5,
                        "name": "镇安县",
                        "aid": "611025"
                    },

                    {
                        "id": 6,
                        "name": "柞水县",
                        "aid": "611026"
                    },

                ]
            },

        ]
    },

    {
        "id": 27,
        "name": "甘肃省",
        "aid": "620000",
        "sub": [

            {
                "id": 0,
                "name": "兰州市",
                "aid": "620100",
                "sub": [

                    {
                        "id": 0,
                        "name": "城关区",
                        "aid": "620102"
                    },

                    {
                        "id": 1,
                        "name": "七里河区",
                        "aid": "620103"
                    },

                    {
                        "id": 2,
                        "name": "西固区",
                        "aid": "620104"
                    },

                    {
                        "id": 3,
                        "name": "安宁区",
                        "aid": "620105"
                    },

                    {
                        "id": 4,
                        "name": "红古区",
                        "aid": "620111"
                    },

                    {
                        "id": 5,
                        "name": "永登县",
                        "aid": "620121"
                    },

                    {
                        "id": 6,
                        "name": "皋兰县",
                        "aid": "620122"
                    },

                    {
                        "id": 7,
                        "name": "榆中县",
                        "aid": "620123"
                    },

                    {
                        "id": 8,
                        "name": "兰州新区",
                        "aid": "620124"
                    },

                    {
                        "id": 9,
                        "name": "高新区",
                        "aid": "620125"
                    },

                    {
                        "id": 10,
                        "name": "经济开发区",
                        "aid": "620126"
                    },

                ]
            },

            {
                "id": 1,
                "name": "嘉峪关市",
                "aid": "620200",
                "sub": [

                    {
                        "id": 0,
                        "name": "雄关区",
                        "aid": "620201"
                    },

                    {
                        "id": 1,
                        "name": "长城区",
                        "aid": "620202"
                    },

                    {
                        "id": 2,
                        "name": "镜铁区",
                        "aid": "620203"
                    },

                ]
            },

            {
                "id": 2,
                "name": "金昌市",
                "aid": "620300",
                "sub": [

                    {
                        "id": 0,
                        "name": "金川区",
                        "aid": "620302"
                    },

                    {
                        "id": 1,
                        "name": "永昌县",
                        "aid": "620321"
                    },

                ]
            },

            {
                "id": 3,
                "name": "白银市",
                "aid": "620400",
                "sub": [

                    {
                        "id": 0,
                        "name": "白银区",
                        "aid": "620402"
                    },

                    {
                        "id": 1,
                        "name": "平川区",
                        "aid": "620403"
                    },

                    {
                        "id": 2,
                        "name": "靖远县",
                        "aid": "620421"
                    },

                    {
                        "id": 3,
                        "name": "会宁县",
                        "aid": "620422"
                    },

                    {
                        "id": 4,
                        "name": "景泰县",
                        "aid": "620423"
                    },

                ]
            },

            {
                "id": 4,
                "name": "天水市",
                "aid": "620500",
                "sub": [

                    {
                        "id": 0,
                        "name": "秦州区",
                        "aid": "620502"
                    },

                    {
                        "id": 1,
                        "name": "麦积区",
                        "aid": "620503"
                    },

                    {
                        "id": 2,
                        "name": "清水县",
                        "aid": "620521"
                    },

                    {
                        "id": 3,
                        "name": "秦安县",
                        "aid": "620522"
                    },

                    {
                        "id": 4,
                        "name": "甘谷县",
                        "aid": "620523"
                    },

                    {
                        "id": 5,
                        "name": "武山县",
                        "aid": "620524"
                    },

                    {
                        "id": 6,
                        "name": "张家川回族自治县",
                        "aid": "620525"
                    },

                ]
            },

            {
                "id": 5,
                "name": "武威市",
                "aid": "620600",
                "sub": [

                    {
                        "id": 0,
                        "name": "凉州区",
                        "aid": "620602"
                    },

                    {
                        "id": 1,
                        "name": "民勤县",
                        "aid": "620621"
                    },

                    {
                        "id": 2,
                        "name": "古浪县",
                        "aid": "620622"
                    },

                    {
                        "id": 3,
                        "name": "天祝藏族自治县",
                        "aid": "620623"
                    },

                ]
            },

            {
                "id": 6,
                "name": "张掖市",
                "aid": "620700",
                "sub": [

                    {
                        "id": 0,
                        "name": "甘州区",
                        "aid": "620702"
                    },

                    {
                        "id": 1,
                        "name": "肃南裕固族自治县",
                        "aid": "620721"
                    },

                    {
                        "id": 2,
                        "name": "民乐县",
                        "aid": "620722"
                    },

                    {
                        "id": 3,
                        "name": "临泽县",
                        "aid": "620723"
                    },

                    {
                        "id": 4,
                        "name": "高台县",
                        "aid": "620724"
                    },

                    {
                        "id": 5,
                        "name": "山丹县",
                        "aid": "620725"
                    },

                ]
            },

            {
                "id": 7,
                "name": "平凉市",
                "aid": "620800",
                "sub": [

                    {
                        "id": 0,
                        "name": "崆峒区",
                        "aid": "620802"
                    },

                    {
                        "id": 1,
                        "name": "泾川县",
                        "aid": "620821"
                    },

                    {
                        "id": 2,
                        "name": "灵台县",
                        "aid": "620822"
                    },

                    {
                        "id": 3,
                        "name": "崇信县",
                        "aid": "620823"
                    },

                    {
                        "id": 4,
                        "name": "华亭县",
                        "aid": "620824"
                    },

                    {
                        "id": 5,
                        "name": "庄浪县",
                        "aid": "620825"
                    },

                    {
                        "id": 6,
                        "name": "静宁县",
                        "aid": "620826"
                    },

                ]
            },

            {
                "id": 8,
                "name": "酒泉市",
                "aid": "620900",
                "sub": [

                    {
                        "id": 0,
                        "name": "肃州区",
                        "aid": "620902"
                    },

                    {
                        "id": 1,
                        "name": "金塔县",
                        "aid": "620921"
                    },

                    {
                        "id": 2,
                        "name": "瓜州县",
                        "aid": "620922"
                    },

                    {
                        "id": 3,
                        "name": "肃北蒙古族自治县",
                        "aid": "620923"
                    },

                    {
                        "id": 4,
                        "name": "阿克塞哈萨克族自治县",
                        "aid": "620924"
                    },

                    {
                        "id": 5,
                        "name": "玉门市",
                        "aid": "620981"
                    },

                    {
                        "id": 6,
                        "name": "敦煌市",
                        "aid": "620982"
                    },

                ]
            },

            {
                "id": 9,
                "name": "庆阳市",
                "aid": "621000",
                "sub": [

                    {
                        "id": 0,
                        "name": "西峰区",
                        "aid": "621002"
                    },

                    {
                        "id": 1,
                        "name": "庆城县",
                        "aid": "621021"
                    },

                    {
                        "id": 2,
                        "name": "环县",
                        "aid": "621022"
                    },

                    {
                        "id": 3,
                        "name": "华池县",
                        "aid": "621023"
                    },

                    {
                        "id": 4,
                        "name": "合水县",
                        "aid": "621024"
                    },

                    {
                        "id": 5,
                        "name": "正宁县",
                        "aid": "621025"
                    },

                    {
                        "id": 6,
                        "name": "宁县",
                        "aid": "621026"
                    },

                    {
                        "id": 7,
                        "name": "镇原县",
                        "aid": "621027"
                    },

                ]
            },

            {
                "id": 10,
                "name": "定西市",
                "aid": "621100",
                "sub": [

                    {
                        "id": 0,
                        "name": "安定区",
                        "aid": "621102"
                    },

                    {
                        "id": 1,
                        "name": "通渭县",
                        "aid": "621121"
                    },

                    {
                        "id": 2,
                        "name": "陇西县",
                        "aid": "621122"
                    },

                    {
                        "id": 3,
                        "name": "渭源县",
                        "aid": "621123"
                    },

                    {
                        "id": 4,
                        "name": "临洮县",
                        "aid": "621124"
                    },

                    {
                        "id": 5,
                        "name": "漳县",
                        "aid": "621125"
                    },

                    {
                        "id": 6,
                        "name": "岷县",
                        "aid": "621126"
                    },

                ]
            },

            {
                "id": 11,
                "name": "陇南市",
                "aid": "621200",
                "sub": [

                    {
                        "id": 0,
                        "name": "武都区",
                        "aid": "621202"
                    },

                    {
                        "id": 1,
                        "name": "成县",
                        "aid": "621221"
                    },

                    {
                        "id": 2,
                        "name": "文县",
                        "aid": "621222"
                    },

                    {
                        "id": 3,
                        "name": "宕昌县",
                        "aid": "621223"
                    },

                    {
                        "id": 4,
                        "name": "康县",
                        "aid": "621224"
                    },

                    {
                        "id": 5,
                        "name": "西和县",
                        "aid": "621225"
                    },

                    {
                        "id": 6,
                        "name": "礼县",
                        "aid": "621226"
                    },

                    {
                        "id": 7,
                        "name": "徽县",
                        "aid": "621227"
                    },

                    {
                        "id": 8,
                        "name": "两当县",
                        "aid": "621228"
                    },

                ]
            },

            {
                "id": 12,
                "name": "临夏回族自治州",
                "aid": "622900",
                "sub": [

                    {
                        "id": 0,
                        "name": "临夏市",
                        "aid": "622901"
                    },

                    {
                        "id": 1,
                        "name": "临夏县",
                        "aid": "622921"
                    },

                    {
                        "id": 2,
                        "name": "康乐县",
                        "aid": "622922"
                    },

                    {
                        "id": 3,
                        "name": "永靖县",
                        "aid": "622923"
                    },

                    {
                        "id": 4,
                        "name": "广河县",
                        "aid": "622924"
                    },

                    {
                        "id": 5,
                        "name": "和政县",
                        "aid": "622925"
                    },

                    {
                        "id": 6,
                        "name": "东乡族自治县",
                        "aid": "622926"
                    },

                    {
                        "id": 7,
                        "name": "积石山保安族东乡族撒拉族自治县",
                        "aid": "622927"
                    },

                ]
            },

            {
                "id": 13,
                "name": "甘南藏族自治州",
                "aid": "623000",
                "sub": [

                    {
                        "id": 0,
                        "name": "合作市",
                        "aid": "623001"
                    },

                    {
                        "id": 1,
                        "name": "临潭县",
                        "aid": "623021"
                    },

                    {
                        "id": 2,
                        "name": "卓尼县",
                        "aid": "623022"
                    },

                    {
                        "id": 3,
                        "name": "舟曲县",
                        "aid": "623023"
                    },

                    {
                        "id": 4,
                        "name": "迭部县",
                        "aid": "623024"
                    },

                    {
                        "id": 5,
                        "name": "玛曲县",
                        "aid": "623025"
                    },

                    {
                        "id": 6,
                        "name": "碌曲县",
                        "aid": "623026"
                    },

                    {
                        "id": 7,
                        "name": "夏河县",
                        "aid": "623027"
                    },

                ]
            },

        ]
    },

    {
        "id": 28,
        "name": "青海省",
        "aid": "630000",
        "sub": [

            {
                "id": 0,
                "name": "西宁市",
                "aid": "630100",
                "sub": [

                    {
                        "id": 0,
                        "name": "城东区",
                        "aid": "630102"
                    },

                    {
                        "id": 1,
                        "name": "城中区",
                        "aid": "630103"
                    },

                    {
                        "id": 2,
                        "name": "城西区",
                        "aid": "630104"
                    },

                    {
                        "id": 3,
                        "name": "城北区",
                        "aid": "630105"
                    },

                    {
                        "id": 4,
                        "name": "大通回族土族自治县",
                        "aid": "630121"
                    },

                    {
                        "id": 5,
                        "name": "湟中县",
                        "aid": "630122"
                    },

                    {
                        "id": 6,
                        "name": "湟源县",
                        "aid": "630123"
                    },

                ]
            },

            {
                "id": 1,
                "name": "海东市",
                "aid": "630200",
                "sub": [

                    {
                        "id": 0,
                        "name": "乐都区",
                        "aid": "630202"
                    },

                    {
                        "id": 1,
                        "name": "平安区",
                        "aid": "630203"
                    },

                    {
                        "id": 2,
                        "name": "民和回族土族自治县",
                        "aid": "630222"
                    },

                    {
                        "id": 3,
                        "name": "互助土族自治县",
                        "aid": "630223"
                    },

                    {
                        "id": 4,
                        "name": "化隆回族自治县",
                        "aid": "630224"
                    },

                    {
                        "id": 5,
                        "name": "循化撒拉族自治县",
                        "aid": "630225"
                    },

                ]
            },

            {
                "id": 2,
                "name": "海北藏族自治州",
                "aid": "632200",
                "sub": [

                    {
                        "id": 0,
                        "name": "门源回族自治县",
                        "aid": "632221"
                    },

                    {
                        "id": 1,
                        "name": "祁连县",
                        "aid": "632222"
                    },

                    {
                        "id": 2,
                        "name": "海晏县",
                        "aid": "632223"
                    },

                    {
                        "id": 3,
                        "name": "刚察县",
                        "aid": "632224"
                    },

                ]
            },

            {
                "id": 3,
                "name": "黄南藏族自治州",
                "aid": "632300",
                "sub": [

                    {
                        "id": 0,
                        "name": "同仁县",
                        "aid": "632321"
                    },

                    {
                        "id": 1,
                        "name": "尖扎县",
                        "aid": "632322"
                    },

                    {
                        "id": 2,
                        "name": "泽库县",
                        "aid": "632323"
                    },

                    {
                        "id": 3,
                        "name": "河南蒙古族自治县",
                        "aid": "632324"
                    },

                ]
            },

            {
                "id": 4,
                "name": "海南藏族自治州",
                "aid": "632500",
                "sub": [

                    {
                        "id": 0,
                        "name": "共和县",
                        "aid": "632521"
                    },

                    {
                        "id": 1,
                        "name": "同德县",
                        "aid": "632522"
                    },

                    {
                        "id": 2,
                        "name": "贵德县",
                        "aid": "632523"
                    },

                    {
                        "id": 3,
                        "name": "兴海县",
                        "aid": "632524"
                    },

                    {
                        "id": 4,
                        "name": "贵南县",
                        "aid": "632525"
                    },

                ]
            },

            {
                "id": 5,
                "name": "果洛藏族自治州",
                "aid": "632600",
                "sub": [

                    {
                        "id": 0,
                        "name": "玛沁县",
                        "aid": "632621"
                    },

                    {
                        "id": 1,
                        "name": "班玛县",
                        "aid": "632622"
                    },

                    {
                        "id": 2,
                        "name": "甘德县",
                        "aid": "632623"
                    },

                    {
                        "id": 3,
                        "name": "达日县",
                        "aid": "632624"
                    },

                    {
                        "id": 4,
                        "name": "久治县",
                        "aid": "632625"
                    },

                    {
                        "id": 5,
                        "name": "玛多县",
                        "aid": "632626"
                    },

                ]
            },

            {
                "id": 6,
                "name": "玉树藏族自治州",
                "aid": "632700",
                "sub": [

                    {
                        "id": 0,
                        "name": "玉树市",
                        "aid": "632701"
                    },

                    {
                        "id": 1,
                        "name": "杂多县",
                        "aid": "632722"
                    },

                    {
                        "id": 2,
                        "name": "称多县",
                        "aid": "632723"
                    },

                    {
                        "id": 3,
                        "name": "治多县",
                        "aid": "632724"
                    },

                    {
                        "id": 4,
                        "name": "囊谦县",
                        "aid": "632725"
                    },

                    {
                        "id": 5,
                        "name": "曲麻莱县",
                        "aid": "632726"
                    },

                ]
            },

            {
                "id": 7,
                "name": "海西蒙古族藏族自治州",
                "aid": "632800",
                "sub": [

                    {
                        "id": 0,
                        "name": "格尔木市",
                        "aid": "632801"
                    },

                    {
                        "id": 1,
                        "name": "德令哈市",
                        "aid": "632802"
                    },

                    {
                        "id": 2,
                        "name": "乌兰县",
                        "aid": "632821"
                    },

                    {
                        "id": 3,
                        "name": "都兰县",
                        "aid": "632822"
                    },

                    {
                        "id": 4,
                        "name": "天峻县",
                        "aid": "632823"
                    },

                ]
            },

        ]
    },

    {
        "id": 29,
        "name": "宁夏回族自治区",
        "aid": "640000",
        "sub": [

            {
                "id": 0,
                "name": "银川市",
                "aid": "640100",
                "sub": [

                    {
                        "id": 0,
                        "name": "兴庆区",
                        "aid": "640104"
                    },

                    {
                        "id": 1,
                        "name": "西夏区",
                        "aid": "640105"
                    },

                    {
                        "id": 2,
                        "name": "金凤区",
                        "aid": "640106"
                    },

                    {
                        "id": 3,
                        "name": "永宁县",
                        "aid": "640121"
                    },

                    {
                        "id": 4,
                        "name": "贺兰县",
                        "aid": "640122"
                    },

                    {
                        "id": 5,
                        "name": "灵武市",
                        "aid": "640181"
                    },

                    {
                        "id": 6,
                        "name": "经济开发区",
                        "aid": "640182"
                    },

                ]
            },

            {
                "id": 1,
                "name": "石嘴山市",
                "aid": "640200",
                "sub": [

                    {
                        "id": 0,
                        "name": "大武口区",
                        "aid": "640202"
                    },

                    {
                        "id": 1,
                        "name": "惠农区",
                        "aid": "640205"
                    },

                    {
                        "id": 2,
                        "name": "平罗县",
                        "aid": "640221"
                    },

                    {
                        "id": 3,
                        "name": "经济开发区",
                        "aid": "640222"
                    },

                ]
            },

            {
                "id": 2,
                "name": "吴忠市",
                "aid": "640300",
                "sub": [

                    {
                        "id": 0,
                        "name": "利通区",
                        "aid": "640302"
                    },

                    {
                        "id": 1,
                        "name": "红寺堡区",
                        "aid": "640303"
                    },

                    {
                        "id": 2,
                        "name": "盐池县",
                        "aid": "640323"
                    },

                    {
                        "id": 3,
                        "name": "同心县",
                        "aid": "640324"
                    },

                    {
                        "id": 4,
                        "name": "青铜峡市",
                        "aid": "640381"
                    },

                ]
            },

            {
                "id": 3,
                "name": "固原市",
                "aid": "640400",
                "sub": [

                    {
                        "id": 0,
                        "name": "原州区",
                        "aid": "640402"
                    },

                    {
                        "id": 1,
                        "name": "西吉县",
                        "aid": "640422"
                    },

                    {
                        "id": 2,
                        "name": "隆德县",
                        "aid": "640423"
                    },

                    {
                        "id": 3,
                        "name": "泾源县",
                        "aid": "640424"
                    },

                    {
                        "id": 4,
                        "name": "彭阳县",
                        "aid": "640425"
                    },

                ]
            },

            {
                "id": 4,
                "name": "中卫市",
                "aid": "640500",
                "sub": [

                    {
                        "id": 0,
                        "name": "沙坡头区",
                        "aid": "640502"
                    },

                    {
                        "id": 1,
                        "name": "中宁县",
                        "aid": "640521"
                    },

                    {
                        "id": 2,
                        "name": "海原县",
                        "aid": "640522"
                    },

                ]
            },

        ]
    },

    {
        "id": 30,
        "name": "新疆维吾尔自治区",
        "aid": "650000",
        "sub": [

            {
                "id": 0,
                "name": "乌鲁木齐市",
                "aid": "650100",
                "sub": [

                    {
                        "id": 0,
                        "name": "天山区",
                        "aid": "650102"
                    },

                    {
                        "id": 1,
                        "name": "沙依巴克区",
                        "aid": "650103"
                    },

                    {
                        "id": 2,
                        "name": "新市区",
                        "aid": "650104"
                    },

                    {
                        "id": 3,
                        "name": "水磨沟区",
                        "aid": "650105"
                    },

                    {
                        "id": 4,
                        "name": "头屯河区",
                        "aid": "650106"
                    },

                    {
                        "id": 5,
                        "name": "达坂城区",
                        "aid": "650107"
                    },

                    {
                        "id": 6,
                        "name": "米东区",
                        "aid": "650109"
                    },

                    {
                        "id": 7,
                        "name": "乌鲁木齐县",
                        "aid": "650121"
                    },

                ]
            },

            {
                "id": 1,
                "name": "克拉玛依市",
                "aid": "650200",
                "sub": [

                    {
                        "id": 0,
                        "name": "独山子区",
                        "aid": "650202"
                    },

                    {
                        "id": 1,
                        "name": "克拉玛依区",
                        "aid": "650203"
                    },

                    {
                        "id": 2,
                        "name": "白碱滩区",
                        "aid": "650204"
                    },

                    {
                        "id": 3,
                        "name": "乌尔禾区",
                        "aid": "650205"
                    },

                ]
            },

            {
                "id": 2,
                "name": "吐鲁番市",
                "aid": "650400",
                "sub": [

                    {
                        "id": 0,
                        "name": "高昌区",
                        "aid": "650402"
                    },

                    {
                        "id": 1,
                        "name": "鄯善县",
                        "aid": "650421"
                    },

                    {
                        "id": 2,
                        "name": "托克逊县",
                        "aid": "650422"
                    },

                ]
            },

            {
                "id": 3,
                "name": "哈密市",
                "aid": "650500",
                "sub": [

                    {
                        "id": 0,
                        "name": "伊州区",
                        "aid": "650502"
                    },

                    {
                        "id": 1,
                        "name": "巴里坤哈萨克自治县",
                        "aid": "650521"
                    },

                    {
                        "id": 2,
                        "name": "伊吾县",
                        "aid": "650522"
                    },

                ]
            },

            {
                "id": 4,
                "name": "昌吉回族自治州",
                "aid": "652300",
                "sub": [

                    {
                        "id": 0,
                        "name": "昌吉市",
                        "aid": "652301"
                    },

                    {
                        "id": 1,
                        "name": "阜康市",
                        "aid": "652302"
                    },

                    {
                        "id": 2,
                        "name": "呼图壁县",
                        "aid": "652323"
                    },

                    {
                        "id": 3,
                        "name": "玛纳斯县",
                        "aid": "652324"
                    },

                    {
                        "id": 4,
                        "name": "奇台县",
                        "aid": "652325"
                    },

                    {
                        "id": 5,
                        "name": "吉木萨尔县",
                        "aid": "652327"
                    },

                    {
                        "id": 6,
                        "name": "木垒哈萨克自治县",
                        "aid": "652328"
                    },

                ]
            },

            {
                "id": 5,
                "name": "博尔塔拉蒙古自治州",
                "aid": "652700",
                "sub": [

                    {
                        "id": 0,
                        "name": "博乐市",
                        "aid": "652701"
                    },

                    {
                        "id": 1,
                        "name": "阿拉山口市",
                        "aid": "652702"
                    },

                    {
                        "id": 2,
                        "name": "精河县",
                        "aid": "652722"
                    },

                    {
                        "id": 3,
                        "name": "温泉县",
                        "aid": "652723"
                    },

                ]
            },

            {
                "id": 6,
                "name": "巴音郭楞蒙古自治州",
                "aid": "652800",
                "sub": [

                    {
                        "id": 0,
                        "name": "库尔勒市",
                        "aid": "652801"
                    },

                    {
                        "id": 1,
                        "name": "轮台县",
                        "aid": "652822"
                    },

                    {
                        "id": 2,
                        "name": "尉犁县",
                        "aid": "652823"
                    },

                    {
                        "id": 3,
                        "name": "若羌县",
                        "aid": "652824"
                    },

                    {
                        "id": 4,
                        "name": "且末县",
                        "aid": "652825"
                    },

                    {
                        "id": 5,
                        "name": "焉耆回族自治县",
                        "aid": "652826"
                    },

                    {
                        "id": 6,
                        "name": "和静县",
                        "aid": "652827"
                    },

                    {
                        "id": 7,
                        "name": "和硕县",
                        "aid": "652828"
                    },

                    {
                        "id": 8,
                        "name": "博湖县",
                        "aid": "652829"
                    },

                ]
            },

            {
                "id": 7,
                "name": "阿克苏地区",
                "aid": "652900",
                "sub": [

                    {
                        "id": 0,
                        "name": "阿克苏市",
                        "aid": "652901"
                    },

                    {
                        "id": 1,
                        "name": "温宿县",
                        "aid": "652922"
                    },

                    {
                        "id": 2,
                        "name": "库车县",
                        "aid": "652923"
                    },

                    {
                        "id": 3,
                        "name": "沙雅县",
                        "aid": "652924"
                    },

                    {
                        "id": 4,
                        "name": "新和县",
                        "aid": "652925"
                    },

                    {
                        "id": 5,
                        "name": "拜城县",
                        "aid": "652926"
                    },

                    {
                        "id": 6,
                        "name": "乌什县",
                        "aid": "652927"
                    },

                    {
                        "id": 7,
                        "name": "阿瓦提县",
                        "aid": "652928"
                    },

                    {
                        "id": 8,
                        "name": "柯坪县",
                        "aid": "652929"
                    },

                ]
            },

            {
                "id": 8,
                "name": "克孜勒苏柯尔克孜自治州",
                "aid": "653000",
                "sub": [

                    {
                        "id": 0,
                        "name": "阿图什市",
                        "aid": "653001"
                    },

                    {
                        "id": 1,
                        "name": "阿克陶县",
                        "aid": "653022"
                    },

                    {
                        "id": 2,
                        "name": "阿合奇县",
                        "aid": "653023"
                    },

                    {
                        "id": 3,
                        "name": "乌恰县",
                        "aid": "653024"
                    },

                ]
            },

            {
                "id": 9,
                "name": "喀什地区",
                "aid": "653100",
                "sub": [

                    {
                        "id": 0,
                        "name": "喀什市",
                        "aid": "653101"
                    },

                    {
                        "id": 1,
                        "name": "疏附县",
                        "aid": "653121"
                    },

                    {
                        "id": 2,
                        "name": "疏勒县",
                        "aid": "653122"
                    },

                    {
                        "id": 3,
                        "name": "英吉沙县",
                        "aid": "653123"
                    },

                    {
                        "id": 4,
                        "name": "泽普县",
                        "aid": "653124"
                    },

                    {
                        "id": 5,
                        "name": "莎车县",
                        "aid": "653125"
                    },

                    {
                        "id": 6,
                        "name": "叶城县",
                        "aid": "653126"
                    },

                    {
                        "id": 7,
                        "name": "麦盖提县",
                        "aid": "653127"
                    },

                    {
                        "id": 8,
                        "name": "岳普湖县",
                        "aid": "653128"
                    },

                    {
                        "id": 9,
                        "name": "伽师县",
                        "aid": "653129"
                    },

                    {
                        "id": 10,
                        "name": "巴楚县",
                        "aid": "653130"
                    },

                    {
                        "id": 11,
                        "name": "塔什库尔干塔吉克自治县",
                        "aid": "653131"
                    },

                ]
            },

            {
                "id": 10,
                "name": "和田地区",
                "aid": "653200",
                "sub": [

                    {
                        "id": 0,
                        "name": "和田市",
                        "aid": "653201"
                    },

                    {
                        "id": 1,
                        "name": "和田县",
                        "aid": "653221"
                    },

                    {
                        "id": 2,
                        "name": "墨玉县",
                        "aid": "653222"
                    },

                    {
                        "id": 3,
                        "name": "皮山县",
                        "aid": "653223"
                    },

                    {
                        "id": 4,
                        "name": "洛浦县",
                        "aid": "653224"
                    },

                    {
                        "id": 5,
                        "name": "策勒县",
                        "aid": "653225"
                    },

                    {
                        "id": 6,
                        "name": "于田县",
                        "aid": "653226"
                    },

                    {
                        "id": 7,
                        "name": "民丰县",
                        "aid": "653227"
                    },

                ]
            },

            {
                "id": 11,
                "name": "伊犁哈萨克自治州",
                "aid": "654000",
                "sub": [

                    {
                        "id": 0,
                        "name": "伊宁市",
                        "aid": "654002"
                    },

                    {
                        "id": 1,
                        "name": "奎屯市",
                        "aid": "654003"
                    },

                    {
                        "id": 2,
                        "name": "霍尔果斯市",
                        "aid": "654004"
                    },

                    {
                        "id": 3,
                        "name": "伊宁县",
                        "aid": "654021"
                    },

                    {
                        "id": 4,
                        "name": "察布查尔锡伯自治县",
                        "aid": "654022"
                    },

                    {
                        "id": 5,
                        "name": "霍城县",
                        "aid": "654023"
                    },

                    {
                        "id": 6,
                        "name": "巩留县",
                        "aid": "654024"
                    },

                    {
                        "id": 7,
                        "name": "新源县",
                        "aid": "654025"
                    },

                    {
                        "id": 8,
                        "name": "昭苏县",
                        "aid": "654026"
                    },

                    {
                        "id": 9,
                        "name": "特克斯县",
                        "aid": "654027"
                    },

                    {
                        "id": 10,
                        "name": "尼勒克县",
                        "aid": "654028"
                    },

                ]
            },

            {
                "id": 12,
                "name": "塔城地区",
                "aid": "654200",
                "sub": [

                    {
                        "id": 0,
                        "name": "塔城市",
                        "aid": "654201"
                    },

                    {
                        "id": 1,
                        "name": "乌苏市",
                        "aid": "654202"
                    },

                    {
                        "id": 2,
                        "name": "额敏县",
                        "aid": "654221"
                    },

                    {
                        "id": 3,
                        "name": "沙湾县",
                        "aid": "654223"
                    },

                    {
                        "id": 4,
                        "name": "托里县",
                        "aid": "654224"
                    },

                    {
                        "id": 5,
                        "name": "裕民县",
                        "aid": "654225"
                    },

                    {
                        "id": 6,
                        "name": "和布克赛尔蒙古自治县",
                        "aid": "654226"
                    },

                ]
            },

            {
                "id": 13,
                "name": "阿勒泰地区",
                "aid": "654300",
                "sub": [

                    {
                        "id": 0,
                        "name": "阿勒泰市",
                        "aid": "654301"
                    },

                    {
                        "id": 1,
                        "name": "布尔津县",
                        "aid": "654321"
                    },

                    {
                        "id": 2,
                        "name": "富蕴县",
                        "aid": "654322"
                    },

                    {
                        "id": 3,
                        "name": "福海县",
                        "aid": "654323"
                    },

                    {
                        "id": 4,
                        "name": "哈巴河县",
                        "aid": "654324"
                    },

                    {
                        "id": 5,
                        "name": "青河县",
                        "aid": "654325"
                    },

                    {
                        "id": 6,
                        "name": "吉木乃县",
                        "aid": "654326"
                    },

                ]
            },

            {
                "id": 14,
                "name": "石河子市",
                "aid": "659001",
                "sub": [

                    {
                        "id": 0,
                        "name": "新城街道",
                        "aid": "659101"
                    },

                    {
                        "id": 1,
                        "name": "向阳街道",
                        "aid": "659102"
                    },

                    {
                        "id": 2,
                        "name": "红山街道",
                        "aid": "659103"
                    },

                    {
                        "id": 3,
                        "name": "老街街道",
                        "aid": "659104"
                    },

                    {
                        "id": 4,
                        "name": "东城街道",
                        "aid": "659105"
                    },

                    {
                        "id": 5,
                        "name": "北泉镇",
                        "aid": "659106"
                    },

                    {
                        "id": 6,
                        "name": "石河子乡",
                        "aid": "659107"
                    },

                    {
                        "id": 7,
                        "name": "一五二团",
                        "aid": "659108"
                    },

                ]
            },

            {
                "id": 15,
                "name": "阿拉尔市",
                "aid": "659002",
                "sub": [

                    {
                        "id": 0,
                        "name": "幸福路街道",
                        "aid": "659201"
                    },

                    {
                        "id": 1,
                        "name": "金银川路街道",
                        "aid": "659202"
                    },

                    {
                        "id": 2,
                        "name": "青松路街道",
                        "aid": "659203"
                    },

                    {
                        "id": 3,
                        "name": "南口街道",
                        "aid": "659204"
                    },

                    {
                        "id": 4,
                        "name": "托喀依乡",
                        "aid": "659205"
                    },

                    {
                        "id": 5,
                        "name": "金银川镇",
                        "aid": "659206"
                    },

                ]
            },

            {
                "id": 16,
                "name": "图木舒克市",
                "aid": "659003",
                "sub": [

                    {
                        "id": 0,
                        "name": "图木舒克市区",
                        "aid": "659301"
                    },

                    {
                        "id": 1,
                        "name": "兵团四十四团",
                        "aid": "659302"
                    },

                    {
                        "id": 2,
                        "name": "兵团四十九团",
                        "aid": "659303"
                    },

                    {
                        "id": 3,
                        "name": "兵团五十团",
                        "aid": "659304"
                    },

                    {
                        "id": 4,
                        "name": "兵团五十一团",
                        "aid": "659305"
                    },

                    {
                        "id": 5,
                        "name": "兵团五十二团",
                        "aid": "659306"
                    },

                    {
                        "id": 6,
                        "name": "兵团五十三团",
                        "aid": "659307"
                    },

                    {
                        "id": 7,
                        "name": "喀拉拜勒镇",
                        "aid": "659308"
                    },

                    {
                        "id": 8,
                        "name": "永安坝",
                        "aid": "659309"
                    },

                ]
            },

            {
                "id": 17,
                "name": "五家渠市",
                "aid": "659004",
                "sub": [

                    {
                        "id": 0,
                        "name": "城区",
                        "aid": "659401"
                    },

                    {
                        "id": 1,
                        "name": "一零一团",
                        "aid": "659402"
                    },

                    {
                        "id": 2,
                        "name": "一零二团",
                        "aid": "659403"
                    },

                    {
                        "id": 3,
                        "name": "一零三团",
                        "aid": "659404"
                    },

                ]
            },

            {
                "id": 18,
                "name": "北屯市",
                "aid": "659005",
                "sub": [

                    {
                        "id": 0,
                        "name": "新城区",
                        "aid": "659501"
                    },

                    {
                        "id": 1,
                        "name": "老城区",
                        "aid": "659502"
                    },

                    {
                        "id": 2,
                        "name": "工业园区",
                        "aid": "659503"
                    },

                    {
                        "id": 3,
                        "name": "海川镇",
                        "aid": "659504"
                    },

                    {
                        "id": 4,
                        "name": "丰庆镇",
                        "aid": "659505"
                    },

                    {
                        "id": 5,
                        "name": "锡伯渡镇",
                        "aid": "659506"
                    },

                ]
            },

            {
                "id": 19,
                "name": "铁门关市",
                "aid": "659006",
                "sub": [

                    {
                        "id": 0,
                        "name": "二十九团场",
                        "aid": "659601"
                    },

                    {
                        "id": 1,
                        "name": "库西经济工业园",
                        "aid": "659602"
                    },

                    {
                        "id": 2,
                        "name": "博古其镇",
                        "aid": "659603"
                    },

                    {
                        "id": 3,
                        "name": "双丰镇",
                        "aid": "659604"
                    },

                ]
            },

            {
                "id": 20,
                "name": "双河市",
                "aid": "659007",
                "sub": [

                    {
                        "id": 0,
                        "name": "八十一团",
                        "aid": "659701"
                    },

                    {
                        "id": 1,
                        "name": "八十四团",
                        "aid": "659702"
                    },

                    {
                        "id": 2,
                        "name": "八十五团",
                        "aid": "659703"
                    },

                    {
                        "id": 3,
                        "name": "八十六团",
                        "aid": "659704"
                    },

                    {
                        "id": 4,
                        "name": "八十九团",
                        "aid": "659705"
                    },

                    {
                        "id": 5,
                        "name": "九十团",
                        "aid": "659706"
                    },

                ]
            },

            {
                "id": 21,
                "name": "可克达拉市",
                "aid": "659008",
                "sub": [

                    {
                        "id": 0,
                        "name": "63团",
                        "aid": "659801"
                    },

                    {
                        "id": 1,
                        "name": "64团",
                        "aid": "659802"
                    },

                    {
                        "id": 2,
                        "name": "66团",
                        "aid": "659803"
                    },

                    {
                        "id": 3,
                        "name": "67团",
                        "aid": "659804"
                    },

                    {
                        "id": 4,
                        "name": "68团",
                        "aid": "659805"
                    },

                ]
            },

            {
                "id": 22,
                "name": "昆玉市",
                "aid": "659009",
                "sub": [

                    {
                        "id": 0,
                        "name": "皮山农场",
                        "aid": "659901"
                    },

                    {
                        "id": 1,
                        "name": "二二四团",
                        "aid": "659902"
                    },

                    {
                        "id": 2,
                        "name": "四十七团",
                        "aid": "659903"
                    },

                    {
                        "id": 3,
                        "name": "一牧场",
                        "aid": "659904"
                    },

                ]
            },

        ]
    },

    {
        "id": 31,
        "name": "台湾",
        "aid": "710000",
        "sub": [

            {
                "id": 0,
                "name": "台北市",
                "aid": "710100",
                "sub": [

                    {
                        "id": 0,
                        "name": "松山区",
                        "aid": "710101"
                    },

                    {
                        "id": 1,
                        "name": "信义区",
                        "aid": "710102"
                    },

                    {
                        "id": 2,
                        "name": "大安区",
                        "aid": "710103"
                    },

                    {
                        "id": 3,
                        "name": "中山区",
                        "aid": "710104"
                    },

                    {
                        "id": 4,
                        "name": "中正区",
                        "aid": "710105"
                    },

                    {
                        "id": 5,
                        "name": "大同区",
                        "aid": "710106"
                    },

                    {
                        "id": 6,
                        "name": "万华区",
                        "aid": "710107"
                    },

                    {
                        "id": 7,
                        "name": "文山区",
                        "aid": "710108"
                    },

                    {
                        "id": 8,
                        "name": "南港区",
                        "aid": "710109"
                    },

                    {
                        "id": 9,
                        "name": "内湖区",
                        "aid": "710110"
                    },

                    {
                        "id": 10,
                        "name": "士林区",
                        "aid": "710111"
                    },

                    {
                        "id": 11,
                        "name": "北投区",
                        "aid": "710112"
                    },

                ]
            },

            {
                "id": 5,
                "name": "新竹市",
                "aid": "710600",
                "sub": [

                    {
                        "id": 0,
                        "name": "东区",
                        "aid": "710601"
                    },

                    {
                        "id": 1,
                        "name": "北区",
                        "aid": "710602"
                    },

                    {
                        "id": 2,
                        "name": "香山区",
                        "aid": "710603"
                    },

                ]
            },

            {
                "id": 1,
                "name": "高雄市",
                "aid": "710200",
                "sub": [

                    {
                        "id": 0,
                        "name": "盐埕区",
                        "aid": "710201"
                    },

                    {
                        "id": 12,
                        "name": "林园区",
                        "aid": "710213"
                    },

                    {
                        "id": 1,
                        "name": "鼓山区",
                        "aid": "710202"
                    },

                    {
                        "id": 2,
                        "name": "左营区",
                        "aid": "710203"
                    },

                    {
                        "id": 3,
                        "name": "楠梓区",
                        "aid": "710204"
                    },

                    {
                        "id": 4,
                        "name": "三民区",
                        "aid": "710205"
                    },

                    {
                        "id": 5,
                        "name": "新兴区",
                        "aid": "710206"
                    },

                    {
                        "id": 6,
                        "name": "前金区",
                        "aid": "710207"
                    },

                    {
                        "id": 7,
                        "name": "苓雅区",
                        "aid": "710208"
                    },

                    {
                        "id": 8,
                        "name": "前镇区",
                        "aid": "710209"
                    },

                    {
                        "id": 9,
                        "name": "旗津区",
                        "aid": "710210"
                    },

                    {
                        "id": 10,
                        "name": "小港区",
                        "aid": "710211"
                    },

                    {
                        "id": 11,
                        "name": "凤山区",
                        "aid": "710212"
                    },

                    {
                        "id": 13,
                        "name": "大寮区",
                        "aid": "710214"
                    },

                    {
                        "id": 14,
                        "name": "大树区",
                        "aid": "710215"
                    },

                    {
                        "id": 15,
                        "name": "大社区",
                        "aid": "710216"
                    },

                    {
                        "id": 16,
                        "name": "仁武区",
                        "aid": "710217"
                    },

                    {
                        "id": 17,
                        "name": "鸟松区",
                        "aid": "710218"
                    },

                    {
                        "id": 18,
                        "name": "冈山区",
                        "aid": "710219"
                    },

                    {
                        "id": 19,
                        "name": "桥头区",
                        "aid": "710220"
                    },

                    {
                        "id": 20,
                        "name": "燕巢区",
                        "aid": "710221"
                    },

                    {
                        "id": 21,
                        "name": "田寮区",
                        "aid": "710222"
                    },

                    {
                        "id": 22,
                        "name": "阿莲区",
                        "aid": "710223"
                    },

                    {
                        "id": 23,
                        "name": "路竹区",
                        "aid": "710224"
                    },

                    {
                        "id": 24,
                        "name": "湖内区",
                        "aid": "710225"
                    },

                    {
                        "id": 25,
                        "name": "茄萣区",
                        "aid": "710226"
                    },

                    {
                        "id": 26,
                        "name": "永安区",
                        "aid": "710227"
                    },

                    {
                        "id": 27,
                        "name": "弥陀区",
                        "aid": "710228"
                    },

                    {
                        "id": 28,
                        "name": "梓官区",
                        "aid": "710229"
                    },

                    {
                        "id": 29,
                        "name": "旗山区",
                        "aid": "710230"
                    },

                    {
                        "id": 30,
                        "name": "美浓区",
                        "aid": "710231"
                    },

                    {
                        "id": 31,
                        "name": "六龟区",
                        "aid": "710232"
                    },

                    {
                        "id": 32,
                        "name": "甲仙区",
                        "aid": "710233"
                    },

                    {
                        "id": 33,
                        "name": "杉林区",
                        "aid": "710234"
                    },

                    {
                        "id": 34,
                        "name": "内门区",
                        "aid": "710235"
                    },

                    {
                        "id": 35,
                        "name": "茂林区",
                        "aid": "710236"
                    },

                    {
                        "id": 36,
                        "name": "桃源区",
                        "aid": "710237"
                    },

                    {
                        "id": 37,
                        "name": "那玛夏区",
                        "aid": "710238"
                    },

                ]
            },

            {
                "id": 2,
                "name": "基隆市",
                "aid": "710300",
                "sub": [

                    {
                        "id": 0,
                        "name": "中正区",
                        "aid": "710301"
                    },

                    {
                        "id": 1,
                        "name": "七堵区",
                        "aid": "710302"
                    },

                    {
                        "id": 2,
                        "name": "暖暖区",
                        "aid": "710303"
                    },

                    {
                        "id": 3,
                        "name": "仁爱区",
                        "aid": "710304"
                    },

                    {
                        "id": 4,
                        "name": "中山区",
                        "aid": "710305"
                    },

                    {
                        "id": 5,
                        "name": "安乐区",
                        "aid": "710306"
                    },

                    {
                        "id": 6,
                        "name": "信义区",
                        "aid": "710307"
                    },

                ]
            },

            {
                "id": 3,
                "name": "台中市",
                "aid": "710400",
                "sub": [

                    {
                        "id": 0,
                        "name": "中区",
                        "aid": "710401"
                    },

                    {
                        "id": 1,
                        "name": "东区",
                        "aid": "710402"
                    },

                    {
                        "id": 2,
                        "name": "南区",
                        "aid": "710403"
                    },

                    {
                        "id": 3,
                        "name": "西区",
                        "aid": "710404"
                    },

                    {
                        "id": 4,
                        "name": "北区",
                        "aid": "710405"
                    },

                    {
                        "id": 5,
                        "name": "西屯区",
                        "aid": "710406"
                    },

                    {
                        "id": 6,
                        "name": "南屯区",
                        "aid": "710407"
                    },

                    {
                        "id": 7,
                        "name": "北屯区",
                        "aid": "710408"
                    },

                    {
                        "id": 8,
                        "name": "丰原区",
                        "aid": "710409"
                    },

                    {
                        "id": 9,
                        "name": "东势区",
                        "aid": "710410"
                    },

                    {
                        "id": 10,
                        "name": "大甲区",
                        "aid": "710411"
                    },

                    {
                        "id": 11,
                        "name": "清水区",
                        "aid": "710412"
                    },

                    {
                        "id": 12,
                        "name": "沙鹿区",
                        "aid": "710413"
                    },

                    {
                        "id": 13,
                        "name": "梧栖区",
                        "aid": "710414"
                    },

                    {
                        "id": 14,
                        "name": "后里区",
                        "aid": "710415"
                    },

                    {
                        "id": 15,
                        "name": "神冈区",
                        "aid": "710416"
                    },

                    {
                        "id": 16,
                        "name": "潭子区",
                        "aid": "710417"
                    },

                    {
                        "id": 17,
                        "name": "大雅区",
                        "aid": "710418"
                    },

                    {
                        "id": 18,
                        "name": "新社区",
                        "aid": "710419"
                    },

                    {
                        "id": 19,
                        "name": "石冈区",
                        "aid": "710420"
                    },

                    {
                        "id": 20,
                        "name": "外埔区",
                        "aid": "710421"
                    },

                    {
                        "id": 21,
                        "name": "大安区",
                        "aid": "710422"
                    },

                    {
                        "id": 22,
                        "name": "乌日区",
                        "aid": "710423"
                    },

                    {
                        "id": 23,
                        "name": "大肚区",
                        "aid": "710424"
                    },

                    {
                        "id": 24,
                        "name": "龙井区",
                        "aid": "710425"
                    },

                    {
                        "id": 25,
                        "name": "雾峰区",
                        "aid": "710426"
                    },

                    {
                        "id": 26,
                        "name": "太平区",
                        "aid": "710427"
                    },

                    {
                        "id": 27,
                        "name": "大里区",
                        "aid": "710428"
                    },

                    {
                        "id": 28,
                        "name": "和平区",
                        "aid": "710429"
                    },

                ]
            },

            {
                "id": 4,
                "name": "台南市",
                "aid": "710500",
                "sub": [

                    {
                        "id": 0,
                        "name": "东区",
                        "aid": "710501"
                    },

                    {
                        "id": 1,
                        "name": "南区",
                        "aid": "710502"
                    },

                    {
                        "id": 2,
                        "name": "北区",
                        "aid": "710504"
                    },

                    {
                        "id": 3,
                        "name": "安南区",
                        "aid": "710506"
                    },

                    {
                        "id": 4,
                        "name": "安平区",
                        "aid": "710507"
                    },

                    {
                        "id": 5,
                        "name": "中西区",
                        "aid": "710508"
                    },

                    {
                        "id": 6,
                        "name": "新营区",
                        "aid": "710509"
                    },

                    {
                        "id": 7,
                        "name": "盐水区",
                        "aid": "710510"
                    },

                    {
                        "id": 8,
                        "name": "白河区",
                        "aid": "710511"
                    },

                    {
                        "id": 9,
                        "name": "柳营区",
                        "aid": "710512"
                    },

                    {
                        "id": 10,
                        "name": "后壁区",
                        "aid": "710513"
                    },

                    {
                        "id": 11,
                        "name": "东山区",
                        "aid": "710514"
                    },

                    {
                        "id": 12,
                        "name": "麻豆区",
                        "aid": "710515"
                    },

                    {
                        "id": 13,
                        "name": "下营区",
                        "aid": "710516"
                    },

                    {
                        "id": 14,
                        "name": "六甲区",
                        "aid": "710517"
                    },

                    {
                        "id": 15,
                        "name": "官田区",
                        "aid": "710518"
                    },

                    {
                        "id": 16,
                        "name": "大内区",
                        "aid": "710519"
                    },

                    {
                        "id": 17,
                        "name": "佳里区",
                        "aid": "710520"
                    },

                    {
                        "id": 18,
                        "name": "学甲区",
                        "aid": "710521"
                    },

                    {
                        "id": 19,
                        "name": "西港区",
                        "aid": "710522"
                    },

                    {
                        "id": 20,
                        "name": "七股区",
                        "aid": "710523"
                    },

                    {
                        "id": 21,
                        "name": "将军区",
                        "aid": "710524"
                    },

                    {
                        "id": 22,
                        "name": "北门区",
                        "aid": "710525"
                    },

                    {
                        "id": 23,
                        "name": "新化区",
                        "aid": "710526"
                    },

                    {
                        "id": 24,
                        "name": "善化区",
                        "aid": "710527"
                    },

                    {
                        "id": 25,
                        "name": "新市区",
                        "aid": "710528"
                    },

                    {
                        "id": 26,
                        "name": "安定区",
                        "aid": "710529"
                    },

                    {
                        "id": 27,
                        "name": "山上区",
                        "aid": "710530"
                    },

                    {
                        "id": 28,
                        "name": "玉井区",
                        "aid": "710531"
                    },

                    {
                        "id": 29,
                        "name": "楠西区",
                        "aid": "710532"
                    },

                    {
                        "id": 30,
                        "name": "南化区",
                        "aid": "710533"
                    },

                    {
                        "id": 31,
                        "name": "左镇区",
                        "aid": "710534"
                    },

                    {
                        "id": 32,
                        "name": "仁德区",
                        "aid": "710535"
                    },

                    {
                        "id": 33,
                        "name": "归仁区",
                        "aid": "710536"
                    },

                    {
                        "id": 34,
                        "name": "关庙区",
                        "aid": "710537"
                    },

                    {
                        "id": 35,
                        "name": "龙崎区",
                        "aid": "710538"
                    },

                    {
                        "id": 36,
                        "name": "永康区",
                        "aid": "710539"
                    },

                ]
            },

            {
                "id": 6,
                "name": "嘉义市",
                "aid": "710700",
                "sub": [

                    {
                        "id": 0,
                        "name": "东区",
                        "aid": "710701"
                    },

                    {
                        "id": 1,
                        "name": "西区",
                        "aid": "710702"
                    },

                ]
            },

            {
                "id": 7,
                "name": "新北市",
                "aid": "710800",
                "sub": [

                    {
                        "id": 0,
                        "name": "板桥区",
                        "aid": "710801"
                    },

                    {
                        "id": 1,
                        "name": "三重区",
                        "aid": "710802"
                    },

                    {
                        "id": 2,
                        "name": "中和区",
                        "aid": "710803"
                    },

                    {
                        "id": 3,
                        "name": "永和区",
                        "aid": "710804"
                    },

                    {
                        "id": 4,
                        "name": "新庄区",
                        "aid": "710805"
                    },

                    {
                        "id": 5,
                        "name": "新店区",
                        "aid": "710806"
                    },

                    {
                        "id": 6,
                        "name": "树林区",
                        "aid": "710807"
                    },

                    {
                        "id": 7,
                        "name": "莺歌区",
                        "aid": "710808"
                    },

                    {
                        "id": 8,
                        "name": "三峡区",
                        "aid": "710809"
                    },

                    {
                        "id": 9,
                        "name": "淡水区",
                        "aid": "710810"
                    },

                    {
                        "id": 10,
                        "name": "汐止区",
                        "aid": "710811"
                    },

                    {
                        "id": 11,
                        "name": "瑞芳区",
                        "aid": "710812"
                    },

                    {
                        "id": 12,
                        "name": "土城区",
                        "aid": "710813"
                    },

                    {
                        "id": 13,
                        "name": "芦洲区",
                        "aid": "710814"
                    },

                    {
                        "id": 14,
                        "name": "五股区",
                        "aid": "710815"
                    },

                    {
                        "id": 15,
                        "name": "泰山区",
                        "aid": "710816"
                    },

                    {
                        "id": 16,
                        "name": "林口区",
                        "aid": "710817"
                    },

                    {
                        "id": 17,
                        "name": "深坑区",
                        "aid": "710818"
                    },

                    {
                        "id": 18,
                        "name": "石碇区",
                        "aid": "710819"
                    },

                    {
                        "id": 19,
                        "name": "坪林区",
                        "aid": "710820"
                    },

                    {
                        "id": 20,
                        "name": "三芝区",
                        "aid": "710821"
                    },

                    {
                        "id": 21,
                        "name": "石门区",
                        "aid": "710822"
                    },

                    {
                        "id": 22,
                        "name": "八里区",
                        "aid": "710823"
                    },

                    {
                        "id": 23,
                        "name": "平溪区",
                        "aid": "710824"
                    },

                    {
                        "id": 24,
                        "name": "双溪区",
                        "aid": "710825"
                    },

                    {
                        "id": 25,
                        "name": "贡寮区",
                        "aid": "710826"
                    },

                    {
                        "id": 26,
                        "name": "金山区",
                        "aid": "710827"
                    },

                    {
                        "id": 27,
                        "name": "万里区",
                        "aid": "710828"
                    },

                    {
                        "id": 28,
                        "name": "乌来区",
                        "aid": "710829"
                    },

                ]
            },

            {
                "id": 8,
                "name": "宜兰县",
                "aid": "712200",
                "sub": [

                    {
                        "id": 0,
                        "name": "宜兰市",
                        "aid": "712201"
                    },

                    {
                        "id": 1,
                        "name": "罗东镇",
                        "aid": "712221"
                    },

                    {
                        "id": 2,
                        "name": "苏澳镇",
                        "aid": "712222"
                    },

                    {
                        "id": 3,
                        "name": "头城镇",
                        "aid": "712223"
                    },

                    {
                        "id": 4,
                        "name": "礁溪乡",
                        "aid": "712224"
                    },

                    {
                        "id": 5,
                        "name": "壮围乡",
                        "aid": "712225"
                    },

                    {
                        "id": 6,
                        "name": "员山乡",
                        "aid": "712226"
                    },

                    {
                        "id": 7,
                        "name": "冬山乡",
                        "aid": "712227"
                    },

                    {
                        "id": 8,
                        "name": "五结乡",
                        "aid": "712228"
                    },

                    {
                        "id": 9,
                        "name": "三星乡",
                        "aid": "712229"
                    },

                    {
                        "id": 10,
                        "name": "大同乡",
                        "aid": "712230"
                    },

                    {
                        "id": 11,
                        "name": "南澳乡",
                        "aid": "712231"
                    },

                ]
            },

            {
                "id": 9,
                "name": "桃园市",
                "aid": "712300",
                "sub": [

                    {
                        "id": 0,
                        "name": "桃园市",
                        "aid": "712301"
                    },

                    {
                        "id": 1,
                        "name": "中坜市",
                        "aid": "712302"
                    },

                    {
                        "id": 2,
                        "name": "平镇市",
                        "aid": "712303"
                    },

                    {
                        "id": 3,
                        "name": "八德市",
                        "aid": "712304"
                    },

                    {
                        "id": 4,
                        "name": "杨梅市",
                        "aid": "712305"
                    },

                    {
                        "id": 5,
                        "name": "芦竹市",
                        "aid": "712306"
                    },

                    {
                        "id": 6,
                        "name": "大溪镇",
                        "aid": "712321"
                    },

                    {
                        "id": 7,
                        "name": "大园乡",
                        "aid": "712324"
                    },

                    {
                        "id": 8,
                        "name": "龟山乡",
                        "aid": "712325"
                    },

                    {
                        "id": 9,
                        "name": "龙潭乡",
                        "aid": "712327"
                    },

                    {
                        "id": 10,
                        "name": "新屋乡",
                        "aid": "712329"
                    },

                    {
                        "id": 11,
                        "name": "观音乡",
                        "aid": "712330"
                    },

                    {
                        "id": 12,
                        "name": "复兴乡",
                        "aid": "712331"
                    },

                ]
            },

            {
                "id": 10,
                "name": "新竹县",
                "aid": "712400",
                "sub": [

                    {
                        "id": 0,
                        "name": "竹北市",
                        "aid": "712401"
                    },

                    {
                        "id": 1,
                        "name": "竹东镇",
                        "aid": "712421"
                    },

                    {
                        "id": 2,
                        "name": "新埔镇",
                        "aid": "712422"
                    },

                    {
                        "id": 3,
                        "name": "关西镇",
                        "aid": "712423"
                    },

                    {
                        "id": 4,
                        "name": "湖口乡",
                        "aid": "712424"
                    },

                    {
                        "id": 5,
                        "name": "新丰乡",
                        "aid": "712425"
                    },

                    {
                        "id": 6,
                        "name": "芎林乡",
                        "aid": "712426"
                    },

                    {
                        "id": 7,
                        "name": "横山乡",
                        "aid": "712427"
                    },

                    {
                        "id": 8,
                        "name": "北埔乡",
                        "aid": "712428"
                    },

                    {
                        "id": 9,
                        "name": "宝山乡",
                        "aid": "712429"
                    },

                    {
                        "id": 10,
                        "name": "峨眉乡",
                        "aid": "712430"
                    },

                    {
                        "id": 11,
                        "name": "尖石乡",
                        "aid": "712431"
                    },

                    {
                        "id": 12,
                        "name": "五峰乡",
                        "aid": "712432"
                    },

                ]
            },

            {
                "id": 11,
                "name": "苗栗县",
                "aid": "712500",
                "sub": [

                    {
                        "id": 0,
                        "name": "苗栗市",
                        "aid": "712501"
                    },

                    {
                        "id": 1,
                        "name": "苑里镇",
                        "aid": "712521"
                    },

                    {
                        "id": 2,
                        "name": "通霄镇",
                        "aid": "712522"
                    },

                    {
                        "id": 3,
                        "name": "竹南镇",
                        "aid": "712523"
                    },

                    {
                        "id": 4,
                        "name": "头份市",
                        "aid": "712524"
                    },

                    {
                        "id": 5,
                        "name": "后龙镇",
                        "aid": "712525"
                    },

                    {
                        "id": 6,
                        "name": "卓兰镇",
                        "aid": "712526"
                    },

                    {
                        "id": 7,
                        "name": "大湖乡",
                        "aid": "712527"
                    },

                    {
                        "id": 8,
                        "name": "公馆乡",
                        "aid": "712528"
                    },

                    {
                        "id": 9,
                        "name": "铜锣乡",
                        "aid": "712529"
                    },

                    {
                        "id": 10,
                        "name": "南庄乡",
                        "aid": "712530"
                    },

                    {
                        "id": 11,
                        "name": "头屋乡",
                        "aid": "712531"
                    },

                    {
                        "id": 12,
                        "name": "三义乡",
                        "aid": "712532"
                    },

                    {
                        "id": 13,
                        "name": "西湖乡",
                        "aid": "712533"
                    },

                    {
                        "id": 14,
                        "name": "造桥乡",
                        "aid": "712534"
                    },

                    {
                        "id": 15,
                        "name": "三湾乡",
                        "aid": "712535"
                    },

                    {
                        "id": 16,
                        "name": "狮潭乡",
                        "aid": "712536"
                    },

                    {
                        "id": 17,
                        "name": "泰安乡",
                        "aid": "712537"
                    },

                ]
            },

            {
                "id": 12,
                "name": "彰化县",
                "aid": "712700",
                "sub": [

                    {
                        "id": 0,
                        "name": "彰化市",
                        "aid": "712701"
                    },

                    {
                        "id": 1,
                        "name": "鹿港镇",
                        "aid": "712721"
                    },

                    {
                        "id": 2,
                        "name": "和美镇",
                        "aid": "712722"
                    },

                    {
                        "id": 3,
                        "name": "线西乡",
                        "aid": "712723"
                    },

                    {
                        "id": 4,
                        "name": "伸港乡",
                        "aid": "712724"
                    },

                    {
                        "id": 5,
                        "name": "福兴乡",
                        "aid": "712725"
                    },

                    {
                        "id": 6,
                        "name": "秀水乡",
                        "aid": "712726"
                    },

                    {
                        "id": 7,
                        "name": "花坛乡",
                        "aid": "712727"
                    },

                    {
                        "id": 8,
                        "name": "芬园乡",
                        "aid": "712728"
                    },

                    {
                        "id": 9,
                        "name": "员林市",
                        "aid": "712729"
                    },

                    {
                        "id": 10,
                        "name": "溪湖镇",
                        "aid": "712730"
                    },

                    {
                        "id": 11,
                        "name": "田中镇",
                        "aid": "712731"
                    },

                    {
                        "id": 12,
                        "name": "大村乡",
                        "aid": "712732"
                    },

                    {
                        "id": 13,
                        "name": "埔盐乡",
                        "aid": "712733"
                    },

                    {
                        "id": 14,
                        "name": "埔心乡",
                        "aid": "712734"
                    },

                    {
                        "id": 15,
                        "name": "永靖乡",
                        "aid": "712735"
                    },

                    {
                        "id": 16,
                        "name": "社头乡",
                        "aid": "712736"
                    },

                    {
                        "id": 17,
                        "name": "二水乡",
                        "aid": "712737"
                    },

                    {
                        "id": 18,
                        "name": "北斗镇",
                        "aid": "712738"
                    },

                    {
                        "id": 19,
                        "name": "二林镇",
                        "aid": "712739"
                    },

                    {
                        "id": 20,
                        "name": "田尾乡",
                        "aid": "712740"
                    },

                    {
                        "id": 21,
                        "name": "埤头乡",
                        "aid": "712741"
                    },

                    {
                        "id": 22,
                        "name": "芳苑乡",
                        "aid": "712742"
                    },

                    {
                        "id": 23,
                        "name": "大城乡",
                        "aid": "712743"
                    },

                    {
                        "id": 24,
                        "name": "竹塘乡",
                        "aid": "712744"
                    },

                    {
                        "id": 25,
                        "name": "溪州乡",
                        "aid": "712745"
                    },

                ]
            },

            {
                "id": 13,
                "name": "南投县",
                "aid": "712800",
                "sub": [

                    {
                        "id": 0,
                        "name": "南投市",
                        "aid": "712801"
                    },

                    {
                        "id": 1,
                        "name": "埔里镇",
                        "aid": "712821"
                    },

                    {
                        "id": 2,
                        "name": "草屯镇",
                        "aid": "712822"
                    },

                    {
                        "id": 3,
                        "name": "竹山镇",
                        "aid": "712823"
                    },

                    {
                        "id": 4,
                        "name": "集集镇",
                        "aid": "712824"
                    },

                    {
                        "id": 5,
                        "name": "名间乡",
                        "aid": "712825"
                    },

                    {
                        "id": 6,
                        "name": "鹿谷乡",
                        "aid": "712826"
                    },

                    {
                        "id": 7,
                        "name": "中寮乡",
                        "aid": "712827"
                    },

                    {
                        "id": 8,
                        "name": "鱼池乡",
                        "aid": "712828"
                    },

                    {
                        "id": 9,
                        "name": "国姓乡",
                        "aid": "712829"
                    },

                    {
                        "id": 10,
                        "name": "水里乡",
                        "aid": "712830"
                    },

                    {
                        "id": 11,
                        "name": "信义乡",
                        "aid": "712831"
                    },

                    {
                        "id": 12,
                        "name": "仁爱乡",
                        "aid": "712832"
                    },

                ]
            },

            {
                "id": 14,
                "name": "云林县",
                "aid": "712900",
                "sub": [

                    {
                        "id": 0,
                        "name": "斗六市",
                        "aid": "712901"
                    },

                    {
                        "id": 1,
                        "name": "斗南镇",
                        "aid": "712921"
                    },

                    {
                        "id": 2,
                        "name": "虎尾镇",
                        "aid": "712922"
                    },

                    {
                        "id": 3,
                        "name": "西螺镇",
                        "aid": "712923"
                    },

                    {
                        "id": 4,
                        "name": "土库镇",
                        "aid": "712924"
                    },

                    {
                        "id": 5,
                        "name": "北港镇",
                        "aid": "712925"
                    },

                    {
                        "id": 6,
                        "name": "古坑乡",
                        "aid": "712926"
                    },

                    {
                        "id": 7,
                        "name": "大埤乡",
                        "aid": "712927"
                    },

                    {
                        "id": 8,
                        "name": "莿桐乡",
                        "aid": "712928"
                    },

                    {
                        "id": 9,
                        "name": "林内乡",
                        "aid": "712929"
                    },

                    {
                        "id": 10,
                        "name": "二仑乡",
                        "aid": "712930"
                    },

                    {
                        "id": 11,
                        "name": "仑背乡",
                        "aid": "712931"
                    },

                    {
                        "id": 12,
                        "name": "麦寮乡",
                        "aid": "712932"
                    },

                    {
                        "id": 13,
                        "name": "东势乡",
                        "aid": "712933"
                    },

                    {
                        "id": 14,
                        "name": "褒忠乡",
                        "aid": "712934"
                    },

                    {
                        "id": 15,
                        "name": "台西乡",
                        "aid": "712935"
                    },

                    {
                        "id": 16,
                        "name": "元长乡",
                        "aid": "712936"
                    },

                    {
                        "id": 17,
                        "name": "四湖乡",
                        "aid": "712937"
                    },

                    {
                        "id": 18,
                        "name": "口湖乡",
                        "aid": "712938"
                    },

                    {
                        "id": 19,
                        "name": "水林乡",
                        "aid": "712939"
                    },

                ]
            },

            {
                "id": 15,
                "name": "嘉义县",
                "aid": "713000",
                "sub": [

                    {
                        "id": 0,
                        "name": "太保市",
                        "aid": "713001"
                    },

                    {
                        "id": 1,
                        "name": "朴子市",
                        "aid": "713002"
                    },

                    {
                        "id": 2,
                        "name": "布袋镇",
                        "aid": "713023"
                    },

                    {
                        "id": 3,
                        "name": "大林镇",
                        "aid": "713024"
                    },

                    {
                        "id": 4,
                        "name": "民雄乡",
                        "aid": "713025"
                    },

                    {
                        "id": 5,
                        "name": "溪口乡",
                        "aid": "713026"
                    },

                    {
                        "id": 6,
                        "name": "新港乡",
                        "aid": "713027"
                    },

                    {
                        "id": 7,
                        "name": "六脚乡",
                        "aid": "713028"
                    },

                    {
                        "id": 8,
                        "name": "东石乡",
                        "aid": "713029"
                    },

                    {
                        "id": 9,
                        "name": "义竹乡",
                        "aid": "713030"
                    },

                    {
                        "id": 10,
                        "name": "鹿草乡",
                        "aid": "713031"
                    },

                    {
                        "id": 11,
                        "name": "水上乡",
                        "aid": "713032"
                    },

                    {
                        "id": 12,
                        "name": "中埔乡",
                        "aid": "713033"
                    },

                    {
                        "id": 13,
                        "name": "竹崎乡",
                        "aid": "713034"
                    },

                    {
                        "id": 14,
                        "name": "梅山乡",
                        "aid": "713035"
                    },

                    {
                        "id": 15,
                        "name": "番路乡",
                        "aid": "713036"
                    },

                    {
                        "id": 16,
                        "name": "大埔乡",
                        "aid": "713037"
                    },

                    {
                        "id": 17,
                        "name": "阿里山乡",
                        "aid": "713038"
                    },

                ]
            },

            {
                "id": 16,
                "name": "屏东县",
                "aid": "713300",
                "sub": [

                    {
                        "id": 0,
                        "name": "屏东市",
                        "aid": "713301"
                    },

                    {
                        "id": 1,
                        "name": "潮州镇",
                        "aid": "713321"
                    },

                    {
                        "id": 2,
                        "name": "东港镇",
                        "aid": "713322"
                    },

                    {
                        "id": 3,
                        "name": "恒春镇",
                        "aid": "713323"
                    },

                    {
                        "id": 4,
                        "name": "万丹乡",
                        "aid": "713324"
                    },

                    {
                        "id": 5,
                        "name": "长治乡",
                        "aid": "713325"
                    },

                    {
                        "id": 6,
                        "name": "麟洛乡",
                        "aid": "713326"
                    },

                    {
                        "id": 7,
                        "name": "九如乡",
                        "aid": "713327"
                    },

                    {
                        "id": 8,
                        "name": "里港乡",
                        "aid": "713328"
                    },

                    {
                        "id": 9,
                        "name": "盐埔乡",
                        "aid": "713329"
                    },

                    {
                        "id": 10,
                        "name": "高树乡",
                        "aid": "713330"
                    },

                    {
                        "id": 11,
                        "name": "万峦乡",
                        "aid": "713331"
                    },

                    {
                        "id": 12,
                        "name": "内埔乡",
                        "aid": "713332"
                    },

                    {
                        "id": 13,
                        "name": "竹田乡",
                        "aid": "713333"
                    },

                    {
                        "id": 14,
                        "name": "新埤乡",
                        "aid": "713334"
                    },

                    {
                        "id": 15,
                        "name": "枋寮乡",
                        "aid": "713335"
                    },

                    {
                        "id": 16,
                        "name": "新园乡",
                        "aid": "713336"
                    },

                    {
                        "id": 17,
                        "name": "崁顶乡",
                        "aid": "713337"
                    },

                    {
                        "id": 18,
                        "name": "林边乡",
                        "aid": "713338"
                    },

                    {
                        "id": 19,
                        "name": "南州乡",
                        "aid": "713339"
                    },

                    {
                        "id": 20,
                        "name": "佳冬乡",
                        "aid": "713340"
                    },

                    {
                        "id": 21,
                        "name": "琉球乡",
                        "aid": "713341"
                    },

                    {
                        "id": 22,
                        "name": "车城乡",
                        "aid": "713342"
                    },

                    {
                        "id": 23,
                        "name": "满州乡",
                        "aid": "713343"
                    },

                    {
                        "id": 24,
                        "name": "枋山乡",
                        "aid": "713344"
                    },

                    {
                        "id": 25,
                        "name": "三地门乡",
                        "aid": "713345"
                    },

                    {
                        "id": 26,
                        "name": "雾台乡",
                        "aid": "713346"
                    },

                    {
                        "id": 27,
                        "name": "玛家乡",
                        "aid": "713347"
                    },

                    {
                        "id": 28,
                        "name": "泰武乡",
                        "aid": "713348"
                    },

                    {
                        "id": 29,
                        "name": "来义乡",
                        "aid": "713349"
                    },

                    {
                        "id": 30,
                        "name": "春日乡",
                        "aid": "713350"
                    },

                    {
                        "id": 31,
                        "name": "狮子乡",
                        "aid": "713351"
                    },

                    {
                        "id": 32,
                        "name": "牡丹乡",
                        "aid": "713352"
                    },

                ]
            },

            {
                "id": 17,
                "name": "台东县",
                "aid": "713400",
                "sub": [

                    {
                        "id": 0,
                        "name": "台东市",
                        "aid": "713401"
                    },

                    {
                        "id": 1,
                        "name": "成功镇",
                        "aid": "713421"
                    },

                    {
                        "id": 2,
                        "name": "关山镇",
                        "aid": "713422"
                    },

                    {
                        "id": 3,
                        "name": "卑南乡",
                        "aid": "713423"
                    },

                    {
                        "id": 4,
                        "name": "鹿野乡",
                        "aid": "713424"
                    },

                    {
                        "id": 5,
                        "name": "池上乡",
                        "aid": "713425"
                    },

                    {
                        "id": 6,
                        "name": "东河乡",
                        "aid": "713426"
                    },

                    {
                        "id": 7,
                        "name": "长滨乡",
                        "aid": "713427"
                    },

                    {
                        "id": 8,
                        "name": "太麻里乡",
                        "aid": "713428"
                    },

                    {
                        "id": 9,
                        "name": "大武乡",
                        "aid": "713429"
                    },

                    {
                        "id": 10,
                        "name": "绿岛乡",
                        "aid": "713430"
                    },

                    {
                        "id": 11,
                        "name": "海端乡",
                        "aid": "713431"
                    },

                    {
                        "id": 12,
                        "name": "延平乡",
                        "aid": "713432"
                    },

                    {
                        "id": 13,
                        "name": "金峰乡",
                        "aid": "713433"
                    },

                    {
                        "id": 14,
                        "name": "达仁乡",
                        "aid": "713434"
                    },

                    {
                        "id": 15,
                        "name": "兰屿乡",
                        "aid": "713435"
                    },

                ]
            },

            {
                "id": 18,
                "name": "花莲县",
                "aid": "713500",
                "sub": [

                    {
                        "id": 0,
                        "name": "花莲市",
                        "aid": "713501"
                    },

                    {
                        "id": 1,
                        "name": "凤林镇",
                        "aid": "713521"
                    },

                    {
                        "id": 2,
                        "name": "玉里镇",
                        "aid": "713522"
                    },

                    {
                        "id": 3,
                        "name": "新城乡",
                        "aid": "713523"
                    },

                    {
                        "id": 4,
                        "name": "吉安乡",
                        "aid": "713524"
                    },

                    {
                        "id": 5,
                        "name": "寿丰乡",
                        "aid": "713525"
                    },

                    {
                        "id": 6,
                        "name": "光复乡",
                        "aid": "713526"
                    },

                    {
                        "id": 7,
                        "name": "丰滨乡",
                        "aid": "713527"
                    },

                    {
                        "id": 8,
                        "name": "瑞穗乡",
                        "aid": "713528"
                    },

                    {
                        "id": 9,
                        "name": "富里乡",
                        "aid": "713529"
                    },

                    {
                        "id": 10,
                        "name": "秀林乡",
                        "aid": "713530"
                    },

                    {
                        "id": 11,
                        "name": "万荣乡",
                        "aid": "713531"
                    },

                    {
                        "id": 12,
                        "name": "卓溪乡",
                        "aid": "713532"
                    },

                ]
            },

            {
                "id": 19,
                "name": "澎湖县",
                "aid": "713600",
                "sub": [

                    {
                        "id": 0,
                        "name": "马公市",
                        "aid": "713601"
                    },

                    {
                        "id": 1,
                        "name": "湖西乡",
                        "aid": "713621"
                    },

                    {
                        "id": 2,
                        "name": "白沙乡",
                        "aid": "713622"
                    },

                    {
                        "id": 3,
                        "name": "西屿乡",
                        "aid": "713623"
                    },

                    {
                        "id": 4,
                        "name": "望安乡",
                        "aid": "713624"
                    },

                    {
                        "id": 5,
                        "name": "七美乡",
                        "aid": "713625"
                    },

                ]
            },

            {
                "id": 20,
                "name": "金门县",
                "aid": "713700",
                "sub": [

                    {
                        "id": 0,
                        "name": "金城镇",
                        "aid": "713701"
                    },

                    {
                        "id": 1,
                        "name": "金湖镇",
                        "aid": "713702"
                    },

                    {
                        "id": 2,
                        "name": "金沙镇",
                        "aid": "713703"
                    },

                    {
                        "id": 3,
                        "name": "金宁乡",
                        "aid": "713704"
                    },

                    {
                        "id": 4,
                        "name": "烈屿乡",
                        "aid": "713705"
                    },

                    {
                        "id": 5,
                        "name": "乌丘乡",
                        "aid": "713706"
                    },

                ]
            },

            {
                "id": 21,
                "name": "连江县",
                "aid": "713800",
                "sub": [

                    {
                        "id": 0,
                        "name": "南竿乡",
                        "aid": "713801"
                    },

                    {
                        "id": 1,
                        "name": "北竿乡",
                        "aid": "713802"
                    },

                    {
                        "id": 2,
                        "name": "莒光乡",
                        "aid": "713803"
                    },

                    {
                        "id": 3,
                        "name": "东引乡",
                        "aid": "713804"
                    },

                ]
            },

        ]
    },

    {
        "id": 32,
        "name": "香港特别行政区",
        "aid": "810000",
        "sub": [

            {
                "id": 0,
                "name": "香港岛",
                "aid": "810100",
                "sub": [

                    {
                        "id": 0,
                        "name": "中西区",
                        "aid": "810101"
                    },

                    {
                        "id": 1,
                        "name": "湾仔区",
                        "aid": "810102"
                    },

                    {
                        "id": 2,
                        "name": "东区",
                        "aid": "810103"
                    },

                    {
                        "id": 3,
                        "name": "南区",
                        "aid": "810104"
                    },

                ]
            },

            {
                "id": 1,
                "name": "九龙",
                "aid": "810200",
                "sub": [

                    {
                        "id": 0,
                        "name": "油尖旺区",
                        "aid": "810201"
                    },

                    {
                        "id": 1,
                        "name": "深水埗区",
                        "aid": "810202"
                    },

                    {
                        "id": 2,
                        "name": "九龙城区",
                        "aid": "810203"
                    },

                    {
                        "id": 3,
                        "name": "黄大仙区",
                        "aid": "810204"
                    },

                    {
                        "id": 4,
                        "name": "观塘区",
                        "aid": "810205"
                    },

                ]
            },

            {
                "id": 2,
                "name": "新界",
                "aid": "810300",
                "sub": [

                    {
                        "id": 0,
                        "name": "荃湾区",
                        "aid": "810301"
                    },

                    {
                        "id": 1,
                        "name": "屯门区",
                        "aid": "810302"
                    },

                    {
                        "id": 2,
                        "name": "元朗区",
                        "aid": "810303"
                    },

                    {
                        "id": 3,
                        "name": "北区",
                        "aid": "810304"
                    },

                    {
                        "id": 4,
                        "name": "大埔区",
                        "aid": "810305"
                    },

                    {
                        "id": 5,
                        "name": "西贡区",
                        "aid": "810306"
                    },

                    {
                        "id": 6,
                        "name": "沙田区",
                        "aid": "810307"
                    },

                    {
                        "id": 7,
                        "name": "葵青区",
                        "aid": "810308"
                    },

                    {
                        "id": 8,
                        "name": "离岛区",
                        "aid": "810309"
                    },

                ]
            },

        ]
    },

    {
        "id": 33,
        "name": "澳门特别行政区",
        "aid": "820000",
        "sub": [

            {
                "id": 0,
                "name": "澳门半岛",
                "aid": "820100",
                "sub": [

                    {
                        "id": 0,
                        "name": "花地玛堂区",
                        "aid": "820101"
                    },

                    {
                        "id": 1,
                        "name": "圣安多尼堂区",
                        "aid": "820102"
                    },

                    {
                        "id": 2,
                        "name": "大堂区",
                        "aid": "820103"
                    },

                    {
                        "id": 3,
                        "name": "望德堂区",
                        "aid": "820104"
                    },

                    {
                        "id": 4,
                        "name": "风顺堂区",
                        "aid": "820105"
                    },

                ]
            },

            {
                "id": 1,
                "name": "氹仔岛",
                "aid": "820200",
                "sub": [

                    {
                        "id": 0,
                        "name": "嘉模堂区",
                        "aid": "820201"
                    },

                ]
            },

            {
                "id": 2,
                "name": "路环岛",
                "aid": "820300",
                "sub": [

                    {
                        "id": 0,
                        "name": "圣方济各堂区",
                        "aid": "820301"
                    },

                ]
            },

        ]
    },

    {
        "id": 34,
        "name": "钓鱼岛",
        "aid": "900000",
        "sub": [

        ]
    },

]